{
    "common": [
        "\nGeorge Lucas was so sure the film would flop that instead of attending the premiere, he went on vacation to Hawaii with his good friend Steven Spielberg, where they came up with the idea for Raiders of the Lost Ark (1981).  ",
        "\nIn early drafts of the script, R2-D2 could speak standard English, and he had a rather foul vocabulary. Although all of R2's English speech was removed, many of C-3PO's reactions to it were left in.  ",
        "\nThe skeleton that C-3PO passes belongs to a Tatooine creature called a Greater Krayt Dragon. This artificial skeleton was left in the Tunisian desert after filming and still lies there. During filming of Star Wars: Episode II - Attack of the Clones (2002), the site was visited by the crew once more and the skeleton was still there.  ",
        "\nThe first film to make over $300,000,000.  ",
        "\nGeorge Lucas' decision to accept a lower salary on the film in exchange for full merchandising rights was considered a fool's gamble on his part. Toys based on movies had never been major money-earners (though some movie-toy combinations had done moderate retail returns) because of the long gap between when a movie would go through its theatrical run and when any products based on it would be available. Star Wars, however, was such a phenomenon that it reached the holiday 1977 sales period in full swing, and changed the way movies were merchandised forever.  ",
        "\nAccording to Harrison Ford, during the making of the film, he and Mark Hamill would usually fool around and not commit to their work whenever Alec Guinness was not on set. When Guinness was on set, they behaved much more professionally.  ",
        "\nHarrison Ford didn't learn his lines for the intercom conversation in the cell block so that it would sound spontaneous.  ",
        "\nJames Earl Jones and David Prowse, who play the voice and body of Darth Vader respectively, have never met.  ",
        "\nThe actors found George Lucas to be very uncommunicative towards them, with his only directions generally being either \"faster\" or \"more intense.\" At one point, when he temporarily lost his voice, the crew provided him with a board with just those two phrases written on it.  ",
        "\nPrior to the film's release, George Lucas showed an early cut of the film to a group of his film director friends. Most, including Lucas himself, felt the film would be a flop; Brian De Palma reportedly called it the \"worst movie ever.\" The only dissenter was Steven Spielberg, who correctly predicted the film would make millions of dollars.  ",
        "\nStunt doubles were not used for the scene where Luke and Leia swing to safety. Carrie Fisher and Mark Hamill performed the stunt themselves, shooting it in just one take.  ",
        "\nThe scene of Darth Vader's TIE Fighter spinning out of control was added late in the film at the insistence of George Lucas. Other members of the film crew were opposed to including this shot, feeling that it set up a sequel (at the time sequels were generally regarded as inferior cash-in movies), but Lucas insisted upon its inclusion nonetheless.  ",
        "\nThe lightsaber sound effect is a combination of the hum of an idling 35mm movie projector and the feedback generated by passing a stripped microphone cable by a television.  ",
        "\nWhile George Lucas was filming on location in Tunisia, the Libyan government became worried about a massive military vehicle parked near the Libyan border. Consequently, the Tunisian government, receiving threats of military mobilization, politely asked Lucas to move his Jawa sandcrawler farther away from the border.  ",
        "\nDue to the limited budget, the American cast members and crew (including George Lucas) all decided to fly coach class to England, rather than first class. When Carrie Fisher's mother, Debbie Reynolds, heard about this, she called Lucas, complaining about how insulting it was for her daughter to be flying coach. Fisher was in the room with Lucas when he took the call, and after a few minutes, asked if she could talk to her mother. When Lucas handed her the phone, she simply said, \"Mother, I want to fly coach, will you f**k off?!\" and hung up.  ",
        "\nAfter visiting the set of Close Encounters of the Third Kind (1977), George Lucas was sure Close Encounters would outperform the yet-to-be-released Star Wars at the box office. Steven Spielberg disagreed, and felt Lucas's Star Wars would be the bigger hit. Lucas proposed they trade 2.5% of the profit on each other's films; Spielberg took the trade, and still receives 2.5% of the profits from Star Wars.  ",
        "\nThe name Wookiee came about as a result of an accident. When San Francisco DJ Terence McGovern was doing voice-over work on THX 1138 (1971) for George Lucas, he made a blunder and exclaimed, \"I think I ran over a wookiee back there.\" George Lucas, confused, asked what he meant by the term. Terence McGovern admitted that he didn't know and added that he simply made it up. George Lucas never forgot the cute word and used it years later in Star Wars: Episode IV - A New Hope (1977).  ",
        "\nThe second most attended film of all time in North America, having sold an estimated 178 million tickets over its various theatrical runs, which would equate to gross of approximately $1.48 billion at 2015 ticket prices. The only film to have sold more tickets is Gone with the Wind (1939) with 202 million.  ",
        "\nHarrison Ford found the dialogue to be very difficult, later saying, \"You can type this shit, but you can't say it.\"  ",
        "\nMark Hamill held his breath for so long during the trash compactor scene that he broke a blood vessel in his face. Subsequent shots are from one side only.  ",
        "\nPeter Mayhew and David Prowse were both given a choice as to which giant character they wanted to play, Chewbacca or Darth Vader. Mayhew wanted to play a good guy and Prowse wanted to play a bad guy, so they ended up playing the matching characters.  ",
        "\nWhen 20th Century Fox attempted to distribute the film in the U.S., fewer than 40 theaters agreed to show it. As a solution, Fox threatened that any cinema that refused to show Star Wars would not be given the rights to screen the potential blockbuster The Other Side of Midnight (1977), which ended up grossing less than 10% of what Star Wars did.  ",
        "\nKenny Baker has said that often when the cast and crew broke for lunch, they would forget he was in the R2-D2 outfit and leave him behind.  ",
        "\nObi-Wan never says, \"May the Force be with you;\" he always says a close variation of the line. The line is spoken by both Han Solo (to Luke) and General Dodonna (while addressing the assembled rebel pilots), neither of whom has Force powers.  ",
        "\nGeorge Lucas waived the normal writer/director fee and asked for a mere $175,000 plus 40% of the merchandising rights. After the failure of Doctor Dolittle (1967), when its massive merchandising push proved an equally costly debacle, studio executives saw little if any profit from such matters and agreed. Star Wars: Episode IV - A New Hope (1977) related merchandise has since generated many millions of dollars in sales, allowing Lucas to make movies completely independent of the studio system he decried. Merchandising rights are now a major part of any film contract.  ",
        "\nOn the first day of filming in the deserts of Tunisia, the country experienced its first major rainstorm in 50 years.  ",
        "\nDuring production, the cast attempted to make George Lucas laugh or smile, as he often appeared depressed.  ",
        "\nCarrie Fisher's breasts were taped down with Gaffer's tape, as her costume did not permit any lingerie to be worn underneath. She joked later, \"As we all know, there is no underwear in space.\"  ",
        "\nThis is the only Star Wars film where Darth Vader's signature theme \"The Imperial March\" is not played in some form or another, as it had not been written at the time.  ",
        "\nThe Chewbacca suit retained a bad smell for the duration of filming, after the trash-compactor scene.  ",
        "\nJames Earl Jones supplied the voice of Darth Vader, but specifically requested that he not be credited. At the time, the reason he cited was that he felt he had not done enough work to get the billing, but he later admitted that he didn't want his name associated with the film because he was still an up-and-coming actor, and didn't want to be typecast. Jones does receive billing in the subsequent sequels and the 1997 \"Special Edition.\"  ",
        "\nWhen the Stormtroopers enter the room where C-3PO and R2-D2 are hiding, one of the actors accidentally bumps his head on the doorway due to his limited visibility. When the special edition came out in 1997, a sound effect had been added to the scene to accompany the head bump.  ",
        "\nAccording to Mark Hamill, studio executives were unhappy that Chewbacca has no clothes and attempted to have the costume redesigned with shorts.  ",
        "\nDenis Lawson, who played Wedge Antilles (his name is misspelt in the credits as \"Dennis Lawson\"), is the uncle of Ewan McGregor, who plays Obi-Wan Kenobi in the prequels. See also Star Wars: Episode VI - Return of the Jedi (1983).  ",
        "\nCarrie Fisher was not accustomed to using guns prior to filming this movie. In preparation, she took shooting lessons from the same person that taught Robert De Niro to shoot for Taxi Driver (1976).  ",
        "\nPeter Cushing found the boots that came with his costume extremely uncomfortable to wear because they were too small for his feet. Thus, he only wore them in the few shots in which Tarkin's feet could be seen. In all other shots, Peter Cushing wore a pair of fuzzy slippers.  ",
        "\nGeorge Lucas came up with the name R2-D2 during post-production of American Graffiti (1973). One of the sound crew wanted Lucas to retrieve Reel #2 of the Second Dialogue track. In post-production parlance, this came out as, \"Could you get R2-D2 for me?\" Lucas liked the sound of that and noted it down for future use.  ",
        "\nThe accounts on how Alec Guinness regarded the movie and his work on it vary greatly. He frequently recalled the experience of making the movie as a bad one, and consistently claimed that it was his idea to have his character killed off in the first film, so as to limit his involvement and make sure he \"wouldn't have to carry on saying these rubbish lines.\" He later mentioned to \"shrivel up\" each time someone mentioned the movie, and claimed to throw away all Star Wars related fan mail without even opening it (a logical paradox, making it likely that this is not true, as his journals report what some of this mail said in detail), because he hated the fact that he would be most remembered as Obi-Wan Kenobi, despite other roles which he held in much higher regard. Contrary to all this, George Lucas has said he made the decision to kill off Kenobi, since the character had no part to play in the movie's finale, and deserved a memorable exit. According to Lucas, Guinness was \"less than happy\" that his character was dying earlier than expected, and even appeared to enjoy his time on set. Lucas, Mark Hamill, Harrison Ford and Carrie Fisher have always stated how patient and helpful Guinness was on the set, and praised his professionalism and respectfulness to all cast and crew members. While Guinness made no secret that he disliked the dialogue in George Lucas' script, he claimed that he accepted the role for two reasons: 1) He was an admirer of Lucas' previous film, American Graffiti (1973) and 2) The narrative compelled him to read the whole script through to the end, in spite of not liking the dialogue and not being a fan of science-fiction. Of the final film, he remarked that he found it \"staggering as spectacle and technically brilliant, exciting, very noisy and warmhearted. The battle scenes at the end go on for five minutes too long, and some of the dialogue is excruciating and much of it is lost in noise, but it remains a vivid experience.\"  ",
        "\nGeorge Lucas's script evolved into a mammoth 200-page screenplay. Having spent a full year writing it, he was reluctant to condense it, so instead, he chose to concentrate on the first third, with a view to expanding the remaining two-thirds into two additional films.  ",
        "\nThe Jawas' language is Zulu electronically sped up. Greedo's language is Quechua, an indigenous South American language, played backwards.  ",
        "\nThe Bantha, seen being mounted by Tusken Raiders after they spot Luke Skywalker's speeder, was actually an Asian elephant owned by Exotic Animal Trainer Ralph Helfer, dressed in a costume of fur and fake horns. Filming the scene proved difficult because the elephant was not accustomed to the extreme heat of Death Valley, and kept removing the costume.  ",
        "\nPrincess Leia and Obi-Wan Kenobi never actually meet within this film. The closest they get to meeting is when she sees him from a distance during the lightsaber duel.  ",
        "\nThe hilt of the lightsaber given to Luke Skywalker is a Graflex 3 Cell Camera flash tube with some rubber grips and a loop attached to the base. These flash tubes can still be bought today, but cost around the same as an official replica hilt.  ",
        "\nAccording to an interview with George Lucas, originally, Luke was a girl, Han Solo was an Alien, the wookiees were called Jawas, and R2-D2 and C-3PO were called A-2 and C-3.  ",
        "\nA great deal of the film was shot by vintage 1950s VistaVision cameras, because they were of higher quality than any others available. After the film was released, the prices of these cameras skyrocketed.  ",
        "\nThe music by John Williams is ranked #1 on AFI's 100 Years of Film Scores.  ",
        "\nPeter Mayhew worked as an orderly in a Yorkshire hospital prior to being cast in the movie. He won his role ten seconds after meeting George Lucas for the first time; all the 7'2\" Mayhew had to do was stand up.  ",
        "\nDuring the scene on the Death Star right after Ben leaves to shut down the tractor beam, Chewbacca barks something to Luke to which Han says, \"Boy, you said it Chewie.\" Backstage footage reveals that what Chewbacca says is, \"The old man's gone mad.\"  ",
        "\nAlthough their respective characters obviously despise each other, Carrie Fisher found Peter Cushing to be very charming, polite and humorous on set. They got along so well, in fact, that Fisher found it a real challenge to act as if she hated him.  ",
        "\nChewbacca was modeled after George Lucas's dog, Indiana.  ",
        "\nOut of all six live-action Star Wars films from the original and prequel trilogies, this is the only one to feature profanity more than once. \"Hell\" and \"damn\" are used several times, and R2-D2 \"swears\" in droid language, but he only chirps and beeps. The language was added to get the movie a PG rating, and avoid its being stereotyped as a G-rated \"kids' movie\".  ",
        "\nThe 2003 book, Alec Guinness: The Authorised Biography, reprints several letters that Guinness wrote to his longtime friend and correspondent, Anne Kaufman, in which he expressed his displeasure with and dubiousness about the quality of Star Wars as it was in production. Before filming started, he wrote, \"I have been offered a movie (20th Cent. Fox) which I may accept, if they come up with proper money. London and N. Africa, starting in mid-March. Science fiction, which gives me pause, but is to be directed by Paul [sic] Lucas who did American Graffiti (1973), which makes me feel I should. Big part. Fairy-tale rubbish but could be interesting perhaps.\" Then, after filming started, he wrote to Kaufman again to complain about the dialogue and describe his costars: \"new rubbish dialogue reaches me every other day on wadges of pink paper - and none of it makes my character clear or even bearable. I just think, thankfully, of the lovely bread, which will help me keep going until next April ... I must off to studio and work with a dwarf (very sweet - and he has to wash in a bidet) and your fellow countrymen Mark Hamill and Tennyson (that can't be right) Ford. Ellison (? - No!) - well, a rangy, languid young man who is probably intelligent and amusing. But Oh, God, God, they make me feel ninety - and treat me as if I was 106. - Oh, [the actor's name is] Harrison Ford - ever heard of him?\"  ",
        "\nGeorge Lucas planned to score the film with existing classical music like Stanley Kubrick had done on 2001: A Space Odyssey (1968), before Steven Spielberg introduced him to composer John Williams. Lucas and Williams agreed on a classical 19th-century Romantic music style with liberal use of leitmotif for the score. Since the movie would show worlds never seen before, the music had to serve as an \"emotional anchor\" for the audience to relate.  ",
        "\nHarrison Ford was originally not allowed to audition, as he had starred in American Graffiti (1973), also directed by George Lucas. George Lucas originally intended to use only new faces for Star Wars, but after using Harrison Ford to read lines with actors auditioning for the other roles, he realized Ford was the best actor for the part of Han Solo.  ",
        "\nGeorge Lucas had not originally intended to have Anthony Daniels for the voice of C-3PO. He only changed his mind after a suggestion by Stan Freberg, one of the actors considered as Daniels' replacement. Daniels' voice was altered in post-production. His character was supposed to be like a \"used car salesman\". Ultimately, though, George Lucas was won over by the charisma of Daniels' reading of the part as a \"snooty British butler,\" and so Daniels has done the voice for C-3PO ever since.  ",
        "\nAccording to the Blu-ray commentary, much of the Millennium Falcon is made up of junk parts from cars and airplanes, much of which were obtained from dumping grounds and the like.  ",
        "\nMost of the Stormtroopers are left-handed. That is because of how the weapons are constructed. Their weapons are based on a real weapon, where the magazine is on the left side of the weapons. This construction caused it to hit the troopers in the chest. Therefore, they have to switch grip of the weapon, which made them look left-handed.  ",
        "\nBody count: 2,002,795,192.  ",
        "\nThe humorous moment when Chewbacca frightens a skittish mouse droid was thought up on set and not scripted.  ",
        "\nAlan Ladd Jr. was very anxious when he attended the premiere in Japan, only to be met by total silence at the end. He didn't know that Japanese moviegoers usually wait for a film's end titles to finish before speaking or leaving the theater.  ",
        "\nThe shootout between Han Solo and Greedo inside the Cantina was the subject for a lot of controversy and debate among Star Wars fans as to who shot first. Many fans debated that Greedo actually shot first a split second before Solo did, but with careful examination of the scene, it was obvious that Greedo never fired his shot at all. For the 1997 special edition release of this movie, George Lucas had edited the scene to include Greedo shooting first at Solo at point blank range, with Solo moving his head slightly to the right to dodge the shot before firing back at Greedo. This caused perhaps the worst backlash of all the alterations made to the original trilogy from outraged fans. The shooting scene was therefore edited for a third time for the 2004 DVD release, so that both Greedo and Han Solo fired their guns more or less at the same time.  ",
        "\nThe following characters \"have a bad feeling about this\": Obi Wan (Episode I), Anakin (Episode II), Obi Wan (Episode III), Luke (Episode IV), Han (Episode IV and Episode VII), Leia (Episode V), C-3PO (Episode VI). See also Star Wars: Episode V - The Empire Strikes Back (1980), Star Wars: Episode VI - Return of the Jedi (1983) and Star Wars: Episode III - Revenge of the Sith (2005). The line is also spoken by Harrison Ford again as Indiana Jones in George Lucas' Indiana Jones and the Kingdom of the Crystal Skull (2008).  ",
        "\nAt one point, George Lucas had planned the character of Han Solo to be a huge green-skinned monster with no nose and gills. Lucas then changed the idea of Han Solo to a black human. He auditioned several black actors and even musicians (including Billy Dee Williams) until finally settling on Glynn Turman. But after this, he decided to make the role white. Kurt Russell, Nick Nolte, Christopher Walken, Jack Nicholson, Al Pacino, Chevy Chase, Steve Martin, Bill Murray, Robert Englund, Sylvester Stallone, John Travolta, James Woods and Perry King were all candidates for the role of Han Solo. George Lucas also wanted to stay away from any actors he had previously used in his films. James Caan, Jack Nicholson, Robert De Niro and Burt Reynolds all turned down the role. Harrison Ford, who had played Bob Falfa in Lucas's American Graffiti (1973), read the part of Han Solo for screen tests of other characters, but wasn't originally considered for the part. During these tests, Lucas realized Ford was perfect for the role.  ",
        "\nWhen Obi-Wan is giving a short history of the Jedi Order and Luke's father in his hut on Tatooine, a patch can be seen on the right shoulder of his robe. It is explained in Star Wars: Episode III - Revenge of the Sith (2005) how this robe got burnt.  ",
        "\nAccording to Ben Burtt, the sounds Chewbacca makes were created from a compilation of large mammals, mostly bears. He said that one particular zoo-kept grizzly bear was an invaluable source of Chewbacca sounds. R2-D2's sounds are various people (mostly Burtt) making baby-like sounds or recordings of real-life babies electronically manipulated.  ",
        "\nDavid Prowse, the actor in the Darth Vader suit, was still disgruntled more than 20 years after the film's release about the fact that his voice was replaced by James Earl Jones. In an interview with the Canadian press, Prowse claimed that he was a victim of \"reverse racism\" because the cast had no black members, and the studio was worried they would lose a significant slice of the audience. However, Jones wasn't credited in the original film, so no one knew a black actor voiced Vader. George Lucas said he dubbed Vader's dialogue because of Prowse's strong Bristol accent. The cast and crew's nickname for Prowse was Darth Farmer.  ",
        "\nWhen first released in 1977, this movie was simply titled \"Star Wars,\" as it was intended to be a stand-alone film. The sequels were not considered until after it became wildly successful. The name of this movie was changed to \"Star Wars: Episode IV - A New Hope\" in 1981 to fit in better with the names of the other films. The later print was the first one to be released on mass market video (an earlier Betamax release did not have the subtitle), and all video, laserdisc or DVD releases have featured the subtitles. The theatrical cut DVDs, released in September 2006, were the first time that the original opening crawl, without subtitle, had been released on home video. The reason George Lucas created the title card \"Episode IV\" in the first film was as a homage to 1940's Saturday afternoon \"cliffhanger\" serials, like the Buck Rogers and Flash Gordon. He also used the \"text crawl\" the same way each of those series opened up new chapters. He did not, at the time, have Episodes I, II, and III already planned. In fact, at one point, 20th Century Fox wanted the \"Episode IV\" title removed so as not to confuse moviegoers. There are some prints of the film that do not have that title card.  ",
        "\nIn 2010, George Lucas sent Damon Lindelof and Carlton Cuse, the executive producers of TV's Lost (2004), a letter congratulating them on the show's end and letting them in on some (possibly facetious) secrets about his development of the Star Wars movie series: \"Don't tell anyone ... but when 'Star Wars' first came out, I didn't know where it was going either. The trick is to pretend you've planned the whole thing out in advance. Throw in some father issues and references to other stories - let's call them homages - and you've got a series.\"  ",
        "\nGeorge Lucas originally wanted Orson Welles to do Darth Vader's voice, but decided against it, feeling that Welles' voice would be too recognizable.  ",
        "\nDuring production, George Lucas referred to the film as a \"Disney movie,\" trying to capture the whimsy of classic 1950s Disney family films, one of Lucas's favorites being Swiss Family Robinson (1960). Ironically, more than 30 years after the release of the film, the Walt Disney Company would acquire LucasFilm, Lucas' production company, including all rights to the \"Star Wars\" stories and characters for $4 billion; thus the film actually became a Disney movie.  ",
        "\nAnthony Daniels initially had no interest in the movie, and only agreed to meet George Lucas to be polite. Almost immediately into their initial meeting, Daniels became intrigued by Ralph McQuarrie's conceptual art of C-3PO and became drawn to playing the character. Daniels also believes a major reason why he was selected was because, unlike most others who met with Lucas for the part, didn't try to impress him with any unasked for stiff robot movements during the interview process.  ",
        "\nA fierce sandstorm destroyed several of the Tatooine sets in the desert outside Tozeur, Tunisia. Filming resumed two days later. The same thing would happen to George Lucas twenty-two years later while filming Star Wars: Episode I - The Phantom Menace (1999).  ",
        "\nKenner Toys signed on for merchandising shortly before the film opened, prepared to produce a modest line of space-themed toys. When Star Wars became a hit, they were unprepared to produce enough toys to handle Christmas demand. Instead, they sold boxed vouchers for various toys. The toys sold during the December \"Empty Box\" campaign were delivered the following March.  ",
        "\nThe famous Darth Vader suit was designed by production designer Ralph McQuarrie, who was concerned about the character being able to breathe while he was traveling from his spaceship to Princess Leia's spaceship. It was not explained why Darth Vader wears the suit at all times until Star Wars: Episode V - The Empire Strikes Back (1980). The look of the Darth Vader suit was based on robes worn by Bedouin Warriors.  ",
        "\nTwo different basic designs were created for the Millennium Falcon. The rejected one became the Rebel Blockade Runner seen at the start of the film.  ",
        "\nDarth Vader was the first character that George Lucas created for the story.  ",
        "\nDuring production, Anthony Daniels and all other actors playing \"C-3PO\"-type droids had to lean against a board to rest, as his costume was not flexible enough to allow them to sit. In scenes where C-3PO is required to sit, Daniels' costume had to be partially disassembled to allow him to sit down. This was hidden by using camera angles, and by having C-3PO sit behind things. This inflexible costume problem was also experienced by actor Jack Haley, who played the Tin Woodsman in The Wizard of Oz (1939).  ",
        "\nPeter Cushing commenting on his role: \"I've often wondered what a 'Grand Moff' was. It sounds like something that flew out of a cupboard.\"  ",
        "\nThe \"TIE\" in TIE Fighter is an acronym, standing for \"Twin Ion Engines.\" Modelmaker Joe Johnston came up with this acronym. In \"The Making of Star Wars\" book, he mentions another possibility had been \"Third Intergalactic Empire.\"  ",
        "\nThe word \"Jedi\" is derived from the Japanese words \"Jidai Geki,\" which translate as \"period adventure drama.\" A period adventure drama is a Japanese TV soap opera program set in the samurai days. George Lucas mentioned in an interview that he saw a \"Jidai Geki\" program on TV while in Japan a year or so before the movie was made, and he liked the word.  ",
        "\nWhen George Lucas screened the film for Fox executives, the reaction was surprisingly positive. Alan Ladd Jr. and the other studio executives loved the film, and Gareth Wigan told Lucas, \"This is the greatest film I've ever seen,\" and cried during the screening. Lucas found the experience shocking and rewarding, having never gained any approval from studio executives before.  ",
        "\nGeorge Lucas and the production team apparently had a series of running battles with the studio cleaning service, which would continually clean and buff the floors on set, even though Lucas had requested they leave them scuffed and dull, part of his idea that the world the characters inhabit should look \"lived in.\" After the sets were constructed, George Lucas went through them and had every single one of them \"dirtied up.\" The R2-D2s were all rolled in the dirt, nicked with a saw, and kicked around a bit. George Lucas popularized the concept of giving sets/props/etc. a \"dirtied up\" appearance, to create the illusion that they were old and worn. However, he was not the first person to use this strategy. Over a decade prior, Gerry Anderson had extensively used this process in his Supermarionation series, most notably Thunderbirds (1965).  ",
        "\nThe only movie, out of the first six, when one of the characters refers to the droids as \"robots\" on screen.  ",
        "\nGeorge Lucas based the character of Han Solo on his friend, Francis Ford Coppola, director of The Godfather trilogy (1972-1990).  ",
        "\nFor the film's opening crawl, George Lucas originally wrote a composition consisting of six paragraphs with four sentences each. He said, \"The crawl is such a hard thing because you have to be careful that you're not using too many words that people don't understand. It's like a poem.\" Lucas showed his draft to his friends. Brian De Palma, who was there, described it, \"The crawl at the beginning looks like it was written on a driveway. It goes on forever. It's gibberish.\" Lucas recounted what De Palma said the first time he saw it, \"George, you're out of your mind! Let me sit down and write this for you.\" De Palma helped to edit the text into the form used in the film.  ",
        "\nThis is the only film in the series where David Prowse did the lightsaber fighting on his own; he was doubled in the sequels because he kept breaking the poles that stood in for the blades. This switch might explain why Vader pivots on his feet in this film, but not in the others.  ",
        "\nWhen Darth Vader crushes the neck of Captain Antilles, the actual sound you hear is of walnut shells being crushed. The same sound effect is used in Star Wars: Episode VI - Return of the Jedi (1983), when Han Solo is freed from the carbonite.  ",
        "\nTwentieth Century Fox was so sure Star Wars: Episode IV - A New Hope (1977) was going to be a disaster that they almost sold off their stake in the film as a tax shelter. They changed their minds after positive feedback from an advance screening. The profits from the film saved the studio from bankruptcy.  ",
        "\nThe pulsating engine sound of the Star Destroyer is a manipulated recording of a broken air conditioner.  ",
        "\nThe \"Star Wars\" visual dictionary by David West Reynolds and James Luceno mentions that Han Solo was raised by space gypsies and never knew who his real parents were.  ",
        "\nIn an earlier version of the script, the Millennium Falcon does not land on the Death Star, but at a Cloud City that floats above the gaseous surface of the planet Alderaan. The rescue of Princess Leia and Obi-Wan Kenobi's duel with Darth Vader take place at this base, not on the Death Star. A cut in the budget for the movie forced George Lucas to bring in the Death Star early, and in the finished film, the scenes that would have taken place in the Cloud City take place there, instead. The Cloud City, of course, was later used in Star Wars: Episode V - The Empire Strikes Back (1980). Since Alderaan was destroyed in Star Wars: Episode IV - A New Hope (1977), however, it obviously could not be the location of the Cloud City. So a new planet was created to house the Cloud City: Bespin.  ",
        "\nThe first two drafts of the screenplay apparently ripped off Flash Gordon and Frank Herbert's Dune, respectively. George Lucas had to rework the draft several times when the rights holders (King Features and Herbert) balked. Even then, Herbert tried to sue because they were still similar, but he relented when the film became a hit in its own right.  ",
        "\nA small pair of metal dice can be seen hanging in the cockpit of the Millennium Falcon, as Chewbacca makes preparations to depart from Mos Eisley. Set designer Roger Christian claims he added the pair of dice hanging in the Millennium Falcon cockpit (briefly seen when Chewbacca bumps his head on them as he first enters) because there were dice hanging in Harrison Ford's car in American Graffiti (1973). However, Ford's character had a skull hanging from his rear view mirror. Ron Howard had the fluffy dice. They don't appear in subsequent scenes, because they were stolen from the set and never replaced.  ",
        "\nThe Tatooine scenes were filmed in Tunisia. There is a town in Tunisia's rural south named Tataouine (Berber for \"eyes\"), and George Lucas liked the name so much, he adopted it for Luke Skywalker's home world. Some of the interiors and the courtyard of Luke's house were filmed in a hotel in Matmata, Tunisia. One can visit this two-star hotel and see some pictures and the painted ceiling of what was used for the Lars' dining room. When Luke goes out of the farm, he appears in a flat deserted area, while the reality, when you get out of the hotel, there're a lot of other houses, small stone hills and a lot of prickly peartrees (a variety of cactus very common in Tunisia).  ",
        "\nIn the novelization of the film, the book begins with a short prologue, which tells the story of the fall of the \"Old Republic,\" the rise of the Empire, and the rise of the Rebel Alliance. This would be part of the basis for Episodes 1-3 of the \"Prequel Trilogy.\"  ",
        "\nWhile speaking at London's National Film Theatre in 2009, Ben Burtt disclosed that the alien gibberish sprouted by the Mos Eisley spy Garindan/Long Snoot was actually the processed voice of John Wayne.  ",
        "\nLuke went through several changes. George Lucas toyed with the idea of changing him into a woman, after cutting Princess Leia from the script. He also entertained the notion of casting the principal characters as dwarves. In an early screenplay, Skywalker was a 60-year-old general. In the shooting script, he was called \"Luke Starkiller,\" but this was changed to Luke Skywalker during production.  ",
        "\nSome fans took offense to the fact that Chewbacca did not receive a medal in the closing scene. MTV remedied this twenty years later when they gave the character a Lifetime Achievement Award, presented by none other than Carrie Fisher. Marvel Comics' adaptation of the movie explained, \"Chewbacca of course will have his own medal, but he will have to put it on himself. Few space princesses are that tall.\"  ",
        "\nUpon receiving the script prior to her audition, Carrie Fisher read it aloud with her friend, actor Miguel Ferrer. Struck by how unique the story was, Fisher decided to lobby hard for the role of Princess Leia, a decision which paid off.  ",
        "\nThe first movie to be dubbed into Navajo. Joseph Campbell, whose writings on mythology inspired George Lucas' work, had studied and written about the Navajo religion.  ",
        "\nIndustrial Light and Magic (ILM) spent most of the production period in chaos, attempting to create special effects that had never been created before. They blew half their budget on four shots which George Lucas rejected. Ultimately, around $5,000,000 of the $8,000,000 budget was spent by ILM.  ",
        "\nAt 121 minutes (special edition runs 125 minutes), this is the shortest of the first seven \"Star Wars\" films.  ",
        "\nThe first draft was twice as long as the finished film, and contained a lot of elements that would be recycled in later movies. For example, the last act would take place on the jungle planet Yavin, which would be the home planet of the Wookiees (originally envisioned as smaller, with heads like that of \"giant bushbabies,\" and not technologically capable), who would end up fighting the Empire alongside our heroes. The second draft was a substantial rewrite which cut all this out, but Lucas still wanted a Wookiee in the movie, so he created Chewbacca, a Wookiee co-pilot who was familiar with technology. For Star Wars: Episode VI - Return of the Jedi (1983), Lucas brought back his idea of a low technology race fighting the Empire, but in place of the Wookiees, he invented the Ewoks (by effectively shrinking them down half the size and inverting the two syllables in their species name). A giant battle with Wookiees on their home planet Kashyyyk finally made it to screen in Star Wars: Episode III - Revenge of the Sith (2005).  ",
        "\nWhen Harrison Ford visited a record store to buy an album after the film's release, enthusiastic fans tore half his shirt off.  ",
        "\nAccording to Star Wars canon, Tatooine's twin suns heat the planet so much that only the polar regions are habitable.  ",
        "\nMay 4th has come to be designated as Intergalactic Star Wars Day. The date, May the Fourth, was seen as a play on the movie's catchphrase, \"May The Force Be With You.\" In addition, May is the anniversary month of the release of every Star Wars film until Episodes VII and VIII.  ",
        "\nLuke's line \"I can't see a thing in this helmet\" was not scripted. Mark Hamill said this to Harrison Ford when he thought the cameras had stopped rolling. But, they decided to leave the line in.  ",
        "\nDarth Vader's breathing was originally meant to be much more labored and raspy. The sound of this more labored, raspy breathing would be used later on in Star Wars: Episode VI - Return of the Jedi (1983), during that movie's climax.  ",
        "\nThe full name Chewbacca is only said once in this movie. Every other time, he is called just \"Chewie.\"  ",
        "\nThe scene between Luke and Obi-Wan in Obi-Wan's home was originally written and edited to have the dialogue in a different order. It originally began with Obi-Wan listening to the message in R2-D2. Leia's mention of the Clone Wars is what leads Luke to ask Ben about his service in them, which is what leads to discussing Luke's father, his lightsaber, and the Force. It was changed when George Lucas and his editors decided that there was no urgency to Leia's message, if Luke and Obi-Wan are able to have other casual conversations after listening to it. As it is edited now, they listen to Leia's message much later in the scene, and immediately afterwards, Obi-Wan begins talking about going to Alderaan.  ",
        "\nGeorge Lucas had ILM watch archival footage of World War II dogfights as reference material for the final battle over the Death Star. The practice evolved into pre-visualization \"animatics\" used today. Former fighter pilots were employed as technical advisors. Audio recordings of radio communications made during dogfights were studied, to help with the dialogue.  ",
        "\nContrary to popular belief, Greedo shooting first in the remastered version of the film was not George Lucas' fault. The MPAA insisted he put it in there in order for the movie to keep its PG rating.  ",
        "\n20th Century Fox bought the screenplay, largely because George Lucas had hired conceptual artist Ralph McQuarrie to create paintings of a number of scenes to help sell it.  ",
        "\nAs an executive at 20th Century Fox, Gareth Wigan saw an early screening of the film. When he got home, he gathered his family around the kitchen table and said, \"I want you to remember this day because I just had one of the greatest experiences in my life.\"  ",
        "\nThe actors playing the stormtroopers, in the scene where they investigate the escape pod, were paid 8500 Tunisian Dinar, which, back then, was the equivalent of only US$6.50, in 1976 dollars. Adjusted for inflation would be US$24.76, in 2010 dollars.  ",
        "\nThe filming of the special effects sequences at ILM's studio was interrupted at one point by a visit by representatives from the local camera operators union, insisting that ILM hire union camera operators. Someone then programmed the newly-developed Dykstraflex motion-controlled camera to perform a complex series of moves that ended with the camera being pointed at the faces of the union reps. At this point, the union reps were told, \"Send us someone who can operate *that*.\" The union reps left and were not heard from again.  ",
        "\nWhen the blasters are cocked, they have a clicking/clunking sound. This is a recording of a parking meter handle being turned.  ",
        "\nJoe Maddalena of Profiles in History acquired the Panavision camera that filmed Star Wars: Episode IV - A New Hope, from Carrie Fisher's brother, Todd Fisher. On Maddalena's television show, the short lived series Hollywood Treasure (2010), the camera was featured at the Profiles in History private auction and was sold for an astounding $520,000, making it the most valuable piece of Star Wars memorabilia in the world.  ",
        "\nJohn Williams' score features cues inspired by several classical works. The music in the scene where the Millenium Falcon is pulled into the Death Star resembles \"Mars, The Bringer Of War\" by Gustav Holst. Parts of the Tatooine music resembles selections from Igor Stravinsky's Sacre Du Printemps.  ",
        "\nThe day before he began filming as C-3PO, Anthony Daniels tried on his costume for the first time. Within two steps, the left leg shattered down into the plastic of the left foot, beginning to stab the actor every time he took a step.  ",
        "\nUnlike the other films in the series, this film features Grand Moff Tarkin (Peter Cushing) as the ranking Imperial villain, instead of Emperor Palpatine (Ian McDiarmid). Both of their names are references to the Roman Republic/Empire. The Tarquins were kings of Rome in the days before the Roman Republic. Palatine Hill was a major location in the city of Rome.  ",
        "\nThe chess scene on the Millennium Falcon was done using stop-motion creatures. The crew considered doing it with costumed actors, but opted for the stop-motion technique, as they wanted to avoid comparisons and similarities to the film Westworld.  ",
        "\nThe origin of R2-D2 can be found in the \"drones\" Huey, Dewey, and Louie from the film Silent Running (1972). Upon meeting Douglas Trumbull, director and special effects chief on \"Silent Running,\" George Lucas commented on how much he liked the designs of Trumbull's two-footed robots in the film, which were operated by bilateral amputees. Four years later, a functionally similar design appeared as R2-D2 in \"Star Wars.\" Universal Studios, the distributor of \"Silent Running,\" noted the similarity between the robots (and the similarity of \"Star Wars\" to the Buck Rogers (1939) serials of the '30s), and promptly sued 20th Century Fox for infringement. The lawsuit was eventually settled when Fox counter-sued over Battlestar Galactica (1978), which bore a striking resemblance to \"Star Wars.\"  ",
        "\nAt one point, George Lucas planned for the characters of Luke Skywalker and his aunt and uncle, to be dwarves. Lucas would eventually use the dwarf hero idea in the film Willow (1988).  ",
        "\nAt the time of his casting for the movie, Mark Hamill was under contract to co-star in the TV series Eight Is Enough (1977). Hamill tried to get out of his contract for Eight Is Enough, as between shooting schedules and filming locations, there was no way he could do both. After filming the pilot for the TV series, he was involved in an auto accident damaging his face. This resulted in the TV producers deciding to let him out of his contract for the series, enabling him to take the part of Luke.  ",
        "\nThe targeting grid used for the Millennium Falcon's cannon is based on a paperweight George Lucas saw on Arthur C. Clarke's desk.  ",
        "\n20th Century Fox green lit the film, despite marketing surveys indicating little or no interest among potential moviegoers in a science fiction movie. A related survey also resulted in a strong dislike of the film's title, as the word \"Wars\" held negative connotations for much of the general public during the immediate aftermath of the Vietnam War.  ",
        "\nThe only Star Wars film in which Darth Vader is not seen unmasked. In the next film, Vader is seen having his mask put back on, exposing his scalp. In VI, Luke takes off Vader's mask, and in III, Vader is seen having his armor put on for the first time.  ",
        "\nWhile a guest on the NPR quiz show \"Wait Wait Don't Tell Me\" in 2009, Carrie Fisher was asked to tell a \"juicy\" story about Alec Guinness, and her response was, \"Alec Guinness once gave Mark Hamill £20 to go away. [Hamill] was asking Alec all these questions about his career, and it became annoying.\"  ",
        "\nFollowing principal photography, new scenes had to be filmed for the Cantina scene, to give it more diversity and add more aliens to the scene. However, the reshoot set was very small. If you look at the close-up scenes of most of the aliens when Luke and company enter, you can see the same window in the background.  ",
        "\nIt was stunt coordinator Peter Diamond's decision to arm Sand People with Gaffi sticks, getting a choice of weapons from various studio props. He felt the stick was a good choice, having served in the British Army, using bayonets and similar weaponry and being familiar with what they were capable of. Diamond played the Sand Person that attacks Luke, being the only stunt person on hand for the Tunisian portion of filming. He initially did not plan on playing the part.  ",
        "\nMark Hamill, Harrison Ford, and Carrie Fisher were all taken aback by George Lucas's decided lack of good dialogue skills. They stood up to him-and Lucas, chastened, allowed the actors to basically improvise their own wording for the basic points of the screenplay's dialogue.  ",
        "\nIn the original draft, Luke made a failed Death Star Trench bombing attempt before making his shot that ultimately destroyed the station. While all footage of the first trench run was eliminated from the final movie, one line that referenced the first run remained: \"They're coming much faster THIS TIME.\"  ",
        "\nAccording to the commentary on the Blu-ray Disc version of the movie, the scene where Tarkin blows up Alderaan was the first scene Carrie Fisher filmed as Leia. She admits to being influenced by Peter Cushing, and admits she may have based some of her performance on his own style of acting.  ",
        "\nOver 60% of this film was shot with a film stock that was so prone to fading, it was discontinued in the early 1980s.  ",
        "\nThe film was originally scheduled for a Christmas 1976 release. It was pushed back five months for post-production; special effects took longer than expected. Studio executives were concerned that the new release date, May 25, 1977, would hurt the box office because Smokey and the Bandit (1977) came out the same week. By the end of its initial theatrical run in the U.S., Star Wars: Episode IV - A New Hope (1977) had grossed over twice as much as Smokey and the Bandit (1977).  ",
        "\nThe first feature film to be screened in Dolby Stereo. Previously, films like The Rocky Horror Picture Show (1975) and Mr. Billion (1977) had made use of the sound system with disastrous results. However, technical-minded George Lucas knew exactly how he wanted to incorporate the system and made it work for his picture.  ",
        "\nBefore casting Alec Guinness as Obi-Wan Kenobi, George Lucas considered casting Japanese actor Toshirô Mifune. He also considered casting a Japanese actress for Princess Leia.  ",
        "\nThe terms \"X-wing\" and \"Y-wing\" and \"TIE fighter\" were used by ILM effects guys to distinguish the fighters. These terms are not used in this film, though they were incorporated into the sequels. They also became popular with the public after the toys and the Making Of special aired on TV. In addition, ILM's special effects staff nicknamed the Millennium Falcon \"The Porkburger,\" but this never caught on.  ",
        "\nDuring a holiday break for Christmas in 1976, Mark Hamill and Carrie Fisher spent a few days in New York City together. One evening they saw a movie together, and a trailer for Star Wars happened to be showed prior to the feature. Hamill recalls that upon the ending of the trailer, a heckler shouted, \"Coming soon to the Late Show!\"  ",
        "\nMost of the planets/moons/etc. seen in the films were just balls that were painted. However, unlike the planets, an actual model was built of the Death Star, because there were constant shots of vehicles approaching it.  ",
        "\nThe film was initially budgeted at $8 million, but production problems forced the studio to contribute an additional $3 million.  ",
        "\nWhile Carrie Fisher disliked her outfit for covering up her womanly curves, a voluptuous, seductive portrayal of Leia is featured in the early original posters by the brothers Hildebrandt.  ",
        "\nWhen writing the script, George Lucas had terrible trouble remembering how to spell all the odd names he had invented for his universe. This explains why there is such inconsistency over the way Wookiee is spelled.  ",
        "\nThis is the opening sentence for a 13-page treatment George Lucas wrote in 1972: \"...the story of Mace Windu, a revered Jedi-bendu of Opuchi who was related to Usby C.J. Thape, a Padawaan learner to the famed Jedi...\" George Lucas spent nearly three years rewriting before he completed the script for Star Wars: Episode IV - A New Hope (1977). Although most of that early script was ultimately unused, the character of Mace Windu and the term padawaan, with the spelling changed to padawan, both appear in the prequel trilogy. Mace Windu, of course, is one of the Jedi Council members, played by Samuel L. Jackson. The term padawan is used to refer to Jedi apprentices.  ",
        "\nThe cantina creature, later to be known as \"Dice Ibegon,\" was really nothing more than a hand puppet known as the \"Drooling arm.\" This was because it was fashioned to have a red, oozy liquid drip from its mouth. When they tried this on film however, the liquid spurted all over the place and the shot was judged to be too disgusting for a PG movie.  ",
        "\nProduction was so laden with problems that George Lucas worked himself into poor health. At one point, he experience chest pains and checked himself into the hospital fearing a heart attack. He was diagnosed with hypertension.  ",
        "\nThe first science fiction film to be nominated for a Best Picture Academy Award.  ",
        "\nBoth of the main robot characters were inducted into the Robot Hall of Fame, R2-D2 in 2003 (inaugural class) and C-3PO in 2004.  ",
        "\nAlong with Beru Lars and Mon Mothma, Leia is only one of three female characters to star in the Original Trilogy, while in this film, she and Beru are the only two female characters to appear, although non-speaking female extras are seen in Mos Eisley.  ",
        "\n20th Century Fox didn't like the title \"Star Wars\" and wanted to rename the movie. In a 2013 \"Nerdist\" podcast, Mark Hamill said that one of their concerns was they thought that potential female audiences (already a group they thought would be unlikely to enjoy science fiction) would be turned off by the word \"wars\" in the title. Hamill also said that another reason they wanted to change the title was that a rather large percentage of the Fox focus group members who heard the title (Hamill said 30%) thought that the movie must be a \"behind-the-scenes look at the Elizabeth Taylor-Richard Burton marriage.\"  ",
        "\nBen Burtt created the sound of Darth Vader's breathing by placing a small microphone in the second stage (mouthpiece) of a scuba regulator, and then recording the sound made by his breathing through the regulator.  ",
        "\nAccording to the exhibit at the Smithsonian, the sound of a TIE fighter is created by combining the squeal of a young elephant with the sound of a car driving by on a rain-slicked highway.  ",
        "\nGeorge Lucas originally prepared a fourteen-page story treatment for his space opera. The major studios all rejected it because they viewed it as science fiction, which was very difficult to market at the time. Lucas did find one sympathetic ear, Alan Ladd Jr., the then new head of 20th Century Fox, who had been impressed with Lucas's efforts on American Graffiti (1973). It was Ladd who eventually greenlit the movie, to the tune of an $8,000,000 budget.  ",
        "\nAccording to Harrison Ford (in Making Star Wars (1977)), Chewbacca the wookiee is 200 years old. In the recording \"The Story of Star Wars\" (issued as a book-and-record set, with stills from the movie illustrating the story), narrator Roscoe Lee Browne introduces Chewbacca as \"a 200-year-old wookiee\".  ",
        "\nWithin three weeks of the film's release, 20th Century Fox's stock price doubled to a record high.  ",
        "\nCardboard cutouts were used for some of the background starfighters in the Rebel hangar bay and for most of the crowd watching the heroes receive their medallions in the final scene.  ",
        "\nGeorge Lucas shot the opening sequence of the Storm Troopers bursting through the blockade runner door, and the ensuing battle against rebel troops, in two takes. While the action on set was over very quickly, Lucas used six cameras to capture it, thereby extending the length of the scene on screen. Since some cameras were in very tight and others wide, it is difficult to tell the various actions that were duplicated.  ",
        "\nGeorge Lucas wanted TIE Fighters to move by very fast in the Death Star Escape sequence. His crew thought this meant a ship moving by the ship's window in 3-4 seconds, when Lucas wanted them to go past in about half a second. This led to the film crew moving the backgrounds, in additions to the TIEs themselves, to create a greater illusion of speed.  ",
        "\nThe line \"May the Force be with you\" is ranked #8 on AFI's 100 Years...100 Movie Quotes.  ",
        "\nSeveral scenes were filmed of Luke with his friends on Tatooine, in an effort to introduce the main character earlier in the film. First, Luke watches Princess Leia's ship battle with the Imperial cruiser in the sky overhead through his binoculars, and later he meets his best friend Biggs Darklighter in Anchorhead, who has left the Imperial Academy and plans to join the Rebel Alliance. Also present in the Anchorhead scenes were Anthony Forrest as Fixer and Koo Stark as Fixer's girlfriend Cammie. All these scenes were later cut, leaving Luke's mention of Biggs to his aunt and uncle as the sole reference to his character early on. The scenes have never officially appeared in any release of the movie, but stills were included in \"The Story of Star Wars\" (a book-and-record set), and the scenes also appeared in the comic book and novel adaptations. This has led several people to believe they actually saw the scenes on the silver screen. All of the scenes were included on the CD-Rom \"Star Wars: Behind the Magic\" in 1998. A reunion scene between Luke and Biggs at the Rebel base was included in the Special Edition re-release of the movie. However, a line by Red Leader about having once met Luke's father was cut from this exchange.  ",
        "\nThough the only thing Chewbacca can say from start to finish is a Wookiee growl, he has the last line in the film.  ",
        "\nMeco's Disco version of the theme song is the biggest selling instrumental single of all time.  ",
        "\nThe reason the scene transitions using a wipe upwards when Ben and Luke carry C-3PO to repair him after the Sand People attack (around the 33rd minute mark) is that \"Anthony Daniels (I)\" was only wearing black tights below the waist. It was done this way to hide them.  ",
        "\nThe movie opened in May 1977 and by November had dethroned Jaws (1975) as the all-time domestic (U.S.) box-office champion. It then was beaten by E.T. the Extra-Terrestrial (1982), but was back on top when it was re-released in 1997. It held that position until Titanic (1997).  ",
        "\nThe horned alien seen in the Cantina sequence was originally a devil mask created by Rick Baker for a Halloween show.  ",
        "\nJabba the Hutt was originally supposed to appear in the film, dropped in optically on top of stand-in actor Declan Mulholland. However, the effect was not acceptable and the scene was cut until CGI allowed it to be completed for the 1997 \"Special Edition.\"  ",
        "\nDuring the scene where Han Solo and the others emerge from the Millennium Falcon's secret compartments, John Williams wrote a 3-note motif for the accompanied soundtrack. This 3-note motif is a cue from Psycho (1960). As a friend and colleague of Bernard Herrmann, who wrote the music for Psycho (1960), John Williams included this particular cue as an homage to Bernard Herrmann. SOURCE: \"The Making of Psycho\" documentary, which can be found in the Bonus Materials section on the \"Psycho (1960) Collector's Edition\" DVD. The 1:16 mark of the documentary reveals this information.  ",
        "\nGeorge Lucas said in an interview with Leonard Maltin that the Ewoks in Star Wars: Episode VI - Return of the Jedi (1983) were originally supposed to be Wookiees. However, since he had established Chewbacca as a fairly sophisticated character who was able to fly spaceships, he opted to make the Ewoks more primitive so as to contrast with the Imperials and their technology.  ",
        "\nPortions of the sound effects for the Millennium Falcon's engines were recorded at an air show at the Experimental Aircraft Association's annual convention in Oshkosh, WI. In a gesture of thanks, Lucasfilm donated a model of the Falcon to the EAA Air Museum. Coincidentally, Harrison Ford served as the chairman of the Young Eagles program at the museum.  ",
        "\nWhile it was originally planned that C-3PO'S voice would be dubbed with a different actor, Anthony Daniels has gone on to voice the part in nearly every other incarnation of the character, including the radio dramatization and several animated series.  ",
        "\nWhen the film was re-released in theaters after having become so successful, the Daffy Duck cartoon Duck Dodgers in the 24½th Century (1953) was run preceding the feature, at the request of George Lucas.  ",
        "\nAt one point in the scripting process, the Force was a large crystal or galactic holy grail called the \"Kyber crystal.\" This idea was used in the 1978 Star Wars novel \"Splinter of the Mind's Eye.\"  ",
        "\nWhile the shot where the escape pod leaves Leia's ship was the first ever completed by ILM, the first shot actually approved by George Lucas for the movie was a shot of the laser cannons in the Death Star trench.  ",
        "\nThe moon Yavin 4, which acted as the rebel base in the film, was filmed in the Mayan temples at Tikal, Guatemala. George Lucas selected the location as a potential filming site after seeing a poster of it hanging at a travel agency, while he was filming in England. This inspired him to send a film crew to Guatemala in March 1977 to shoot scenes. While filming in Tikal, the crew paid locals with a six pack of beer to watch over the camera equipment for several days.  ",
        "\nR2-D2's vocal patterns largely contain sound designer Ben Burtt's own voice. In trying to create the beeping, whistling noises of the droid, Burtt found that he was vocalizing a lot of what he was trying to achieve, so he recorded his voice, mainly making baby noises, and then fed it through a synthesizer.  ",
        "\nApart from influences from Flash Gordon, Buck Rogers and Frank Herbert's Dune, George Lucas was inspired by J.R.R. Tolkien's \"Lord of the Rings\" fantasy novels, as well as many Japanese samurai movies, when he wrote the Star Wars story. Akira Kurosawa's The Hidden Fortress (1958), which also deals with a famous warrior and a princess who need to be moved safely to allied territory while being pursued by hostiles, especially served as an inspiration; as an homage, Lucas has admiral Motti refer in the film to the Rebel's secret base as their \"hidden fortress,\" although the last word is muffled when his throat is grabbed by Vader's psychic attack.  ",
        "\nNormally 20th Century-Fox released about 20 films per year, but the long-running success of Star Wars: Episode IV - A New Hope (1977) resulted in the studio issuing only seven new films in the entire year of 1978.  ",
        "\nPrior to the release of this movie, the greatest profit 20th Century Fox had ever made in one year was $37,000,000. In 1977, because of the film, their year-end profit was $79,000,000.  ",
        "\nSteven Spielberg recommended John Williams as composer.  ",
        "\nThe final version of the opening crawl for this movie was co-written by Brian De Palma after complaining that the previous (third draft) version was too difficult to understand.  ",
        "\nCame fourth in the UK's Ultimate Film list, in which films were placed in order of how many seats they sold at cinemas. Gone with the Wind (1939), The Sound of Music (1965), and Snow White and the Seven Dwarfs (1937) came first, second and third.  ",
        "\nIn previous drafts of the screenplay, the young hero was known as Annikin (sic) Starkiller, and Luke Skywalker was the name of a grizzled veteran (essentially the character who would become Obi-Wan Kenobi). George Lucas played around with different variations on these names, and in the shooting script, the young hero was called Luke Starkiller. During filming, Lucas decided that \"Starkiller\" suggested a Charles Manson-like cult leader and changed Luke's surname to Skywalker. Since the name Starkiller hadn't been spoken in filming, no footage had to be reshot or dubbed.  ",
        "\nThe weapons the stormtroopers used were essentially the Sterling L2A3 9mm SMG (sub-machine gun), a military weapon developed in the late 1940s in the UK and adopted by the British and Canadian Armies in the 1950s. The curved left entry side mounted magazine was removed, and that was as much as it was modified for the film. The longer sandtrooper weapon was the MG-34 machine gun from Germany.  ",
        "\nIn some Spanish subtitled releases, R2-D2's name appears subtitled as \"Arturito\" or \"little Arthur\" in Spanish, since the pronunciation is very closely resembled. This is also the case with C-3PO, whose name is subtitled as \"Citripio,\" but that does not resemble anything in Spanish.  ",
        "\nThe enhanced effects used for the Death Star explosions in the 1997 re-releases of this movie and Star Wars: Episode VI - Return of the Jedi (1983) feature the \"Praxis Wave,\" so named for its first use by Industrial Light and Magic in Star Trek VI: The Undiscovered Country (1991) for the explosion of the Klingon moon, Praxis.  ",
        "\nWILHELM SCREAM: The film revived and re-popularized the \"Wilhelm Scream\" sound effect, first used in Distant Drums (1951).  ",
        "\nIn the DVD commentary, Carrie Fisher shares that she and a friend of hers read the script out loud and both wanted to play Han Solo.  ",
        "\nThe character name Obi-Wan Kenobi appears to allude to the following definitions. OBI - a form of belief involving sorcery, practiced in parts of the West Indies, South America, the southern U.S., and Africa. And a charm used in this belief system. WAN - Archaically meaning dark or gloomy; also pale in color or hue, meaning decline in ability (referring to dotage of the aging Jedi). KEN - knowledge, understanding, or cognizance; mental perception. range of sight or vision.  ",
        "\nThe cast and crew's nickname for David Prowse was Darth Farmer, because of his heavy Bristol accent.  ",
        "\nCarrie Fisher was cast under the condition that she lose 10 pounds.  ",
        "\nThe second film to gross more than $100 million at the US box office. The first was Jaws (1975).  ",
        "\nAmong the first promotional licenses granted was to Marvel Comics, who published a Star Wars comic book series, which ran for 107 issues from 1977-86. The first six issues were an adaption of the film, which included some deleted scenes from the film. The adaptation was also published in a tabloid-sized Collector's Edition format.  ",
        "\nIn Italy, R2-D2 was renamed C1-P8, while Darth Vader became Lord Fener, the reason being that \"Vader\" in Italian sounds too close to the common noun for the toilet bowl (the \"water,\" clearly from the English \"water closet\"). The \"clones\" mentioned by Obi-Wan Kenobi became \"quotes\" (Italian: \"cloni\"/\"quoti\").  ",
        "\nDavid Prowse's Darth Vader mask had to be padded with foam because it was much too large to fit over his face properly.  ",
        "\nFirst of 18 consecutive films with Dolby-encoded soundtracks to win Academy Awards for Best Achievement in Sound.  ",
        "\nThe sounds of the lasers were made by striking a metal wrench up the steel reinforcement cables of a high-voltage electricity pylon, which are the long lines of power pylons that criss-cross most countries. The Millennium Falcon \"shutdown\" engine noise was sourced from an external air-conditioning unit on its last legs.  ",
        "\nThere are 28 optical wipes in the original version of the film. The source for this is the original theatrical version included on Disc 2 of the Widescreen Limited Edition DVD, 2006. Wipes were a notable scene transition device in movie serials of the 1930s and 1940s, especially in the Flash Gordon and Buck Rogers serials by Universal Pictures, which were among of the many inspirations for \"Star Wars.\"  ",
        "\nRobert Englund auditioned for the role of Luke Skywalker but was turned down. He then suggested to his roommate Mark Hamill that he should try for the part.  ",
        "\nDarth Vader, though it seems he's the movie's antagonist, only has a a screen time of 12 minutes.  ",
        "\nAccording to Roger Christian, the Millennium Falcon set was the most difficult item to build. Christian wanted the interior of the Falcon to look like that of a submarine. He found scrap airplane metal \"that no one wanted in those days and bought them\". He began his creation process by breaking down jet engines into scrap pieces, giving him the chance to \"stick it in the sets in specific ways\". It took him several weeks to finish the chess set (which he described as \"the most encrusted set\") in the hold of the Falcon.  ",
        "\nInitial research from 20th Century Fox using the title and a brief synopsis came back with the results that only males under 25 were interested in seeing the film. Fox then deliberately marketed the film with a view to attracting older and female cinemagoers by pushing images of humans (including Princess Leia) centerstage and referring to the film in more mythic tones, rather than science fiction.  ",
        "\nHan Solo and Obi-Wan Kenobi are ranked #14 and #37 respectively on the \"Heroes\" section of AFI's 100 Years... 100 Heroes and Villains, making Star Wars the only film to have more than one character on the list.  ",
        "\nBefore Alec Guinness was cast as Obi-Wan, George Lucas briefly considered using Peter Cushing, who plays Tarkin.  ",
        "\nIn the Blockade Runner scenes at the beginning of the film, with the shootout in the white hallways, only a single white hallway was built. It was filmed from multiple angles to give the impression that the \"ship\" was bigger than it really was, and so that the best parts of the battle footage could be used more than once.  ",
        "\nGerman audiences usually laugh at the scene where R2-D2 is being stunned by the Jawa. This is due to the sounds that the Jawa utters afterwards. They resemble \"Gute Idee!\" which is German for \"Good idea!\"  ",
        "\nUnlike Alec Guinness, who grew to regret appearing in this film despite it revitalizing his career and earning a considerable income from it, Peter Cushing, who was a long time star of genre films, was pleased to be a part of the film and his only regret was that he could not appear in the sequels.  ",
        "\nDavid Prowse was not the only on-screen actor to have his voice overdubbed by another. In the early rough-cut of the Cantina sequence, Wuher, the barkeeper is speaking in a very pronounced Cockney accent, one that was overdubbed by an American actor before the film's release. The same also happens with the character of Dr. Evazan (\"I have the death sentence in 12 systems!\") for much the same reason. Sheelagh Fraser who plays Luke's Aunt Beru was also dubbed, as George Lucas felt she sounded a little too English for the character.  ",
        "\nAccording to commentary tracks, Peter Diamond wishes he could have had the Lightsaber fight between Obi-Wan and Vader reshot, because they were constantly breaking the blades.  ",
        "\nThere is a rumor that Anthony Daniels (C-3PO) was having trouble timing his conversations with R2-D2, as R2-D2's dialogue was to be dubbed in later. Supposedly, Daniels asked George Lucas to make some kind of noise to help him, but when Lucas forgot, the matter was dropped.  ",
        "\nThe hologram chess game played by Chewbacca and the droids is called Dejarik. According to Star Wars canon, the Emperor is a Grand Master at Dejarik.  ",
        "\nThe name Luke derives from the Greek word for light, which fits into the film's allegorical themes of light and darkness. The Biblical Apostle Luke was an early convert to Christianity, much like Luke Skywalker converting to the ways of a Jedi. In addition, the name Luke is also a derivative of the name Lucas as in George Lucas.  ",
        "\nThe final scene, where Luke and Han receive their awards, required a much larger soundstage than was available at Elstree Studios. The scene was shot at Pinewood Studios instead.  ",
        "\nGeorge Lucas asked costume designer John Mollo to create simple, nondescript costumes without any buttons. The only exception to this last rule were some of the green rebel uniforms worn by extras during the Throne room sequence, as Mollo had to find a lot of spare uniforms at the last minute.  ",
        "\nIn its May 30, 1977 issue, Time magazine voted Star Wars \"The Year's Best Movie.\" The franchise would go on to feature on the magazine's cover six times.  ",
        "\nGeorge Lucas pitched the film to Universal, United Artists and Disney. They all passed on the film before he took it to Fox. Ironically, Disney would later acquire the franchise.  ",
        "\nGeorge Lucas started writing the screenplay in 1974.  ",
        "\nAt one point when the prospects for the movie's release seemed bleakest, the idea came up that perhaps the effects could be removed from the movie and recycled into a TV show.  ",
        "\nThe original teaser trailer was narrated by Malachi Throne. In the documentary Empire of Dreams: The Story of the 'Star Wars' Trilogy (2004), he is given a \"special thanks\" credit.  ",
        "\nThe studio was unhappy with \"Star Wars\" as a title after negative market testing. A competition was held during shooting for cast and crew to come up with a better one but nothing stuck.  ",
        "\nMel Blanc auditioned for the voice of C-3PO.  ",
        "\nFor the special edition version, in the Cantina the close-up shot of the wolfman was removed. He was replaced with a close-up shot of a CGI dinosaur-type man. However in additional frames, you can still see the wolfman in the background.  ",
        "\nThe sound of the laser blasts from the Storm Troopers' guns was made by striking the guy wire of a radio antenna tower with a hammer.  ",
        "\nIn the Italian version of the trilogy, the Death Star is called La Morte Nera (Black Death), and Darth Vader is called Lord Fener.  ",
        "\nThe rescue of the Princess - and Obi-Wan Kenobi's duel with Darth Vader - were originally intended to take place on Alderaan.  ",
        "\nThe term \"Moff\", used to describe some Imperial characters (such as Tarkin) is used to mean a regional governor of a specific sector of space. Military officers can also be Moffs - Tarkin, for example, is listed in the script as an Admiral in the Imperial fleet.  ",
        "\nThis film is ranked #2 on the AFI's top 10 science fiction films.  ",
        "\nPeter Mayhew worked as an orderly in a Yorkshire hospital prior to being cast as Chewbacca. He returned to this job between the end of shooting and the movie's release.  ",
        "\nAnthony Daniels's C-3PO suit was so noisy and clanking on the set that not only was Daniels' live-recorded dialogue unusable, but the live tracks of other actors in the scene were spoiled as well.  ",
        "\nIn the first draft, Luke was an elderly Jedi Master, rather like he appears in Star Wars: Episode VII - The Force Awakens (2015), and his apprentice was Annikin Starkiller. In subsequent drafts, Luke became Luke Starkiller, a name he kept until the last minute. In an interview at the London premiere, Mark Hamill revealed that his character's name was Luke Starkiller until partway through filming. There is in fact only one scene where he identifies himself as Luke Skywalker: the scene where he rescues Princess Leia. That scene was apparently shot once where he calls himself Luke Starkiller. It was re-shot later on when George Lucas decided to change the character's name back to Skywalker. The reasoning, according to Hamill, was that he shouldn't have the name \"kill\" in his name. The name Starkiller was later used for Starkiller Base.  ",
        "\nSome unused footage shot for the film was used in The Star Wars Holiday Special (1978).  ",
        "\nWhile George Lucas was filming in London, where additional casting took place, Kenny Baker, performing a musical comedy act with his acting partner Jack Purvis, learned that the film crew was looking for a small person to fit inside a robot suit and maneuver it; Baker, who is 3 feet 8 inches (1.12 m) tall, was cast immediately after meeting George Lucas. He said, \"He saw me come in and said 'He'll do' because I was the smallest guy they'd seen up until then.\" He initially turned down the role three times, hesitant to appear in a film where his face would not be shown and hoping to continue the success of his comedy act, which had recently started to be televised.  ",
        "\nKaren Allen, Nancy Allen, Christine Baranski, Kim Basinger, Bonnie Bedelia, Glenn Close, Geena Davis, Farrah Fawcett, Melanie Griffith, Barbara Hershey, Catherine Hicks, Anjelica Huston, Margot Kidder, Christine Lahti, Jessica Lange, Kay Lenz, Bernadette Peters, Jane Seymour, Cybill Shepherd, P.J. Soles, Sissy Spacek, Meryl Streep, Kathleen Turner, Sigourney Weaver, Dianne Wiest and Debra Winger all auditioned for the role of Princess Leia. Linda Blair, Pamela Sue Martin, Theresa Russell and Jill Clayburgh were also considered.  ",
        "\nOn opening weekend in 1977, the movie earned $1.554 million on fewer than 40 screens. In 1997, it made over $36 million on over 2,000 screens.  ",
        "\nDarth Vader was originally a rather minor character, and early drafts actually have him spending most of the movie without his iconic suit. He was even going to be killed off during the trench run at the end.  ",
        "\nMark Hamill was injured in a car crash, which restricted reshoots.  ",
        "\nObi-Wan was originally going to survive the film, until George Lucas (at the suggestion of his then-wife, Marcia, who was an accomplished editor) realised that there wasn't anything more for him to do in the story. However, Alec Guinness claimed that he suggested that his character be killed off, because \"I just didn't have the heart to go on saying these lines\".  ",
        "\nHarrison Ford was paid $1,000 a week for his role.  ",
        "\nWhen Luke is attacked by a Tusken Raider, the moment where the raider (Peter Diamond) waves his weapon over his head with both hands in an up-and-down motion was actually created from a shot of him thrusting his weapon up once, run backwards and forward several times.  ",
        "\nKenny Baker later confessed that he thought the film would be a failure. Harrison Ford found it strange that \"there's a princess with weird buns in her hair\", and he called Chewbacca a \"giant in a monkey suit\".  ",
        "\nOn the Death Star, when Han, Chewbacca and Luke arrive at the detention cell where Princess Leia is held in order to rescue her, they meet the officer in charge. He asks them \"Where are you taking this - thing?\", referring to Chewbacca. Luke responds \"Prisoner transfer from Prisoner Cell Block one-one-three-eight.\" This is a reference to Lucas's previous film THX 1138 (1971).  ",
        "\n20th Century Fox promoted the film at the San Diego Comic Con, believing the attendees of that event to be the film's main target demographic.  ",
        "\nThe original editor for the film was John Jympson. Richard Chew was Lucas' first choice of the editor but budgetary reasons did not allow him to do so. After the first assembly, which was absolutely disastrous, Lucas fired Jympson, asked his then wife Marcia (while editing New York, New York (1977)) who in turn brought in Chew and Paul Hirsch to finish. Both men gave the movie a tighter focus and much-needed faster pace, which paid off when they received an Academy Award for their work.  ",
        "\nIn the interview clips in the \"When Star Wars Ruled the World\" special, Mark Hamill explained that the concept behind the Force is, essentially, \"Religion's Greatest Hits.\"  ",
        "\nOriginally, George Lucas envisioned Tatooine as a jungle planet. Gary Kurtz travelled to the Philippines to scout locations; however, because of the idea of spending months filming in the jungle would make Lucas \"itchy\", the director refined his vision and made Tatooine a desert planet instead. Kurtz then researched all American, North African, and Middle Eastern deserts, and found Tunisia, near the Sahara desert, as the ideal location.  ",
        "\nDue to strict British working conditions adhered to on set at Elstree Studios, filming had to finish by 5:30 pm, unless George Lucas was in the middle of a scene.  ",
        "\nIronically, given later revelations, it is Han Solo who repeatedly refers to Princess Leia as 'sister'.  ",
        "\nIn some scenes that were filmed but never used, the filmmakers had to use multiple models of R2-D2, since he had a hard time keeping up with the other characters. When one could no longer keep up, a second one hidden behind a corner or wall would \"sneak\" back into the main group. As this charade wasn't very convincing, none of these scenes made the final cut.  ",
        "\nCASTLE THUNDER: Heard various times in the film whenever laser bolts or other various weapons are fired. Its most well-known use in the film is when the Death Star blows up.  ",
        "\nMules were used as the main basis for the sound that the Tusken Raiders make.  ",
        "\nThe Millennium Falcon was originally modeled after a hamburger with an olive next to it. Because the name of the ship had not been finalized at this time, storyboards refer to as the pirate ship. Some boards indicate for the first version of the pirate ship (which became the Blockade Runner) to be changed into the 'Hamburger Boogie' version.  ",
        "\nDespite the film poster showing Leia displaying her legs and red shoes her bare legs and red shoes are not shown in the film. Instead she wears white boots.  ",
        "\nC-3PO was originally scripted as a \"used car salesman\" type, and designed after the robot from Metropolis (1927).  ",
        "\nThe very first treatment of the film was originally titled \"The Journal of the Whills\". It centered around a Jedi-bendu by the name of Mace Windu (who would become the Mace Windu character in the prequel trilogy) and his apprentice, C. 2. Thorpe. George Lucas brought the thing to his agent, Jeff Berg, who was quickly confused by the massive amounts of jargon used in the treatment, and recommended he start simpler.  ",
        "\nThe movie's line \"May the force be with you.\" was voted as the #22 of \"The 100 Greatest Movie Lines\" by Premiere in 2007.  ",
        "\nWhile reading for the film, Mark Hamill found the dialogue to be extremely odd because of its universe-embedded concepts. He chose to simply read it sincerely, and he was selected instead of William Katt, who was subsequently cast in Carrie (1976) (George Lucas shared a joint casting session with Brian De Palma, a long-time friend of his)  ",
        "\nLucasfilm hired Charles Lippincott as marketing director for the film. As 20th Century Fox gave little support for marketing beyond licensing T-shirts and posters, Lippincott was forced to look elsewhere. He secured deals with Marvel Comics for a comic book adaptation, and with Del Rey Books for a novelization. A fan of science fiction, he used his contacts to promote the film at the San Diego Comic-Con and elsewhere within science fiction fandom.  ",
        "\nWhen Ben Kenobi is turning off the tractor beam, the set Alec Guinness was on was only six feet above the ground.  ",
        "\nHan Solo's blaster was manufactured from a Mauser C96 (\"Broomhandle\") pistol, a late-19th century weapon.  ",
        "\nThe piece of equipment used to fire the Death Star's weapon is actually a Grass Valley Group 1600-7K television production switcher.  ",
        "\nStunt doubles were not used for the scene in which Luke and Leia swing to safety. Carrie Fisher and Mark Hamill performed that stunt themselves, shooting it in just one take.  ",
        "\nThe briefing of the pilots and the final dogfights at the Death Star were inspired by many WWII films including Flying Tigers (1942), Flying Leathernecks (1951) and Battle of Britain (1969) amongst others.  ",
        "\nPeter Cushing completed his role in a matter of a few days (May 8-12). Shooting lasted from March-June 1976, released one year later due to the extensive special effects.  ",
        "\nPeter Mayhew and David Prowse are the two tallest out of the entire cast and crew. Mayhew at 7'3 and Prowse at 6'6.  ",
        "\nDarth Vader only has roughly 12 minutes of screen time.  ",
        "\nThe film was initially rated for adult audiences in Germany. This was largely due to depictions and terminology relating to the Empire's military and its leaders being perceived as parallels to those of Nazi Germany.  ",
        "\nPrincess Leia is held in cell 2187. One of George Lucas' early influences was a National Film Board movie called 21-87 (1964), which ends with a voiceover talking about a godlike \"Force\" present in the universe.  ",
        "\nThere is only a single scene in the entire three-episode arc (IV-V-VI) where all eight of the main characters appear together: the escape from the Death Star. While Darth Vader and Obi-Wan are dueling, Luke, Leia, Han, Chewie, C-3PO, and R2-D2 make their getaway past them into the Millennium Falcon. Although they all do not appear in the same shot, for a brief moment it will be the only time all eight characters are within sight of each other.  ",
        "\nThe model used for the rebel blockade runner (the first ship seen in the first scene of the film) has a tiny Star Wars: Episode IV - A New Hope (1977) movie poster and a tiny Playboy centerfold in its cockpit. These aren't visible on screen, though.  ",
        "\nOne of the major changes in the Special Edition version of the film is Luke meeting his old friend Biggs Darklighter at Yavin. This scene was originally filmed for the 1977 original release but didn't make it to the final cut. Earlier scenes involving Luke and Biggs on Tatooine early in the film remain cut from the finished film.  ",
        "\nGeorge Lucas hired Gilbert Taylor as cinematographer, based on his work on Dr. Strangelove or: How I Learned to Stop Worrying and Love the Bomb (1964) and A Hard Day's Night (1964). On his decision, Lucas said, \"I thought they were good, eccentrically photographed pictures with a strong documentary flavor.\"  ",
        "\nThe \"Main Title Theme\" was inspired by the theme from Kings Row (1942), scored by Erich Wolfgang Korngold, and the track \"Dune Sea of Tatooine\" drew from the soundtrack of Bicycle Thieves (1948), scored by Alessandro Cicognini.  ",
        "\nThe \"lost\" beginning of \"Star Wars\" had Luke (after having witnessed the battle over Tatooine with his macrobinoculars while fixing a vaporator) making a trip to the Tosche Station in Anchorhead to tell his friends (Fixer, Camie, Deak and Windy). Luke's nickname among his group of friends was \"Wormie\".  ",
        "\nIn 1998, the film was ranked #15 on AFI's 100 Years...100 Movies. In 2007, it moved up two places to be ranked #13 for the 10th anniversary edition of the list.  ",
        "\nThe Jawa language was based on the Zulu language. The recordings of Jawa voices you hear in the final film are a mixture of studio recordings, as well as recordings done in places like canyons to get an ambient echo effect of sorts, spliced together.  ",
        "\nAlthough the Anchorhead scenes featuring Anthony Forrest as Fixer and Koo Stark as Cammie were deleted, Forrest still appears in the finished film. He played the Stormtrooper who stops Luke and Obi-Wan in Mos Eisley and is then deluded by Obi-Wan's use of the Force.  ",
        "\nRemains one of the 50 highest grossing movies of all time (as of 2010 at #30) without adjusting dollars for inflation and is the oldest film to have such distinction.  ",
        "\nWillard Huyck and Gloria Katz, old film-school friends of George Lucas, did uncredited rewrites on the screenplay. 20th Century Fox refused to pay them a fee, insisting that Lucas pay them out of his own salary. He eventually gave them some of his own profit points as a reward. The rebel General who talks to Princess Leia on her arrival at Yavin IV is named 'Willard' after Huyck.  ",
        "\nDan O'Bannon and John C. Wash animated the Death Star schematics seen on the computer screen as R2D2 searches the Death Star's computer memory. They were influenced by similar sequences they produced for the film Dark Star (1974).  ",
        "\nGilbert Taylor said that George Lucas, who was consumed by the details of the complicated production, \"avoided all meetings and contact with me from day one, so I read the extra-long script many times and made my own decisions as to how I would shoot the picture.\" He also \"took it upon myself to experiment with photographing the lightsabers and other things onstage before we moved on to our two weeks of location work in Tunisia.\"  ",
        "\nOf all of the films in which Luke Skywalker appears as an adult, this is the only one in which his name does not appear in the opening crawl text.  ",
        "\nGeorge Lucas has the head of a Stormtrooper and an R2D2 in his office.  ",
        "\nMark Hamill got so intense filming the scene in which he gets pulled under by the dianoga in the trash compactor that he burst a blood vessel in his eye. According to Carrie Fisher, during the next scene filmed, when Luke and Han receive their medals, Hamill had to do a lot of grinning in order to keep the big red spot on his eye from being noticable.  ",
        "\nEarly audiences cheered and applauded when the Millennium Falcon made the jump to hyperspace, but according to George Lucas, this scene was never meant to be a showstopper. It was simply a matter of practicality, a means of showing how a ship like the Falcon could travel great distances across infinite space in a relatively short period of time without the need for heavy exposition.  ",
        "\n'Carrie Fisher' claimed that she warned 'Harrison Ford' in advance that her 2016 memoir The Princess Diarist would reveal their three month love affair during production. According to Fisher, Ford responded merely by cracking \"lawyer!\"  ",
        "\nGeorge Lucas's original choice for cinematographer was Geoffrey Unsworth, but Unsworth was committed to A Bridge Too Far (1977). Gilbert Taylor was hired instead, but hated working on the project. Producer Gary Kurtz became concerned that Taylor was slowing production down and attempted to replace him with Harry Waxman, but the camera crew made it clear they would not work under Waxman, and Lucas told Kurtz that replacing Taylor would probably delay the film even further.  ",
        "\nIn an early version of the screenplay, Luke Skywalker was a 60-year old general and Han Solo had green skin and gills.  ",
        "\nBefore Leia was added to the story, George Lucas was concerned that there weren't any major female characters. He considered changing Luke into a woman  ",
        "\nDuring production, George Lucas and Gilbert Taylor-whom Gary Kurtz called \"old-school\" and \"crotchety\"-had disputes over filming. With a background in independent filmmaking, Lucas was accustomed to creating most of the elements of the film himself. His lighting suggestions were rejected by an offended Taylor, who felt that Lucas was overstepping his boundaries by giving specific instructions, sometimes even moving lights and cameras himself. Taylor refused to use the soft-focus lenses and gauze Lucas wanted after Fox executives complained about the look. Kurtz stated that \"In a couple of scenes [...] rather than saying, 'It looks a bit over lit, can you fix that?', [Lucas would] say, 'turn off this light, and turn off that light.' And Gil would say, 'No, I won't do that, I've lit it the way I think it should be-tell me what's the effect that you want, and I'll make a judgment about what to do with my lights.'\"  ",
        "\nTatooine is similar to Arrakis from Frank Herbert's Dune series. Arrakis is the only known source of a longevity spice called Melange. References to \"spice\", various illegal stimulant drugs, occur throughout the last three films of the Star Wars saga. In the original film, Han Solo is a spice smuggler who has been through the spice mines of Kessel. In the conversation at Obi-Wan Kenobi's home, between Obi-Wan and Luke, Luke expresses a belief that his father was a navigator on a spice freighter. Other similarities include those between Princess Leia and Princess Alia, and between Jedi mind tricks and \"The Voice\", a controlling ability used by Bene Gesserit. In passing, Uncle Owen and Aunt Beru are \"moisture farmers\"; in Dune, dew collectors are used by Fremen to \"... provide a small but reliable source of water.\" Herbert reported that \"David Lynch, [director of Dune (1984)] had trouble with the fact that Star Wars used up so much of Dune.\" The pair found \"... sixteen points of identity ...\" and they calculated that, \"... the odds against coincidence produced a number larger than the number of stars in the universe.\"  ",
        "\nKoo Stark had a small role in the movie as Luke Skywalker's friend Cammie and was seen with Luke and Biggs witnessing the Imperial Star Destroyer attack the Blockade Runner. Her scene was cut from the theatrical release.  ",
        "\nTerri Nunn (lead singer of the band Berlin) auditioned for the part of Princess Leia Organa. Several other well-known actresses also auditioned for the role, including Cindy Williams.  ",
        "\nIn earlier versions of the script, the line \"There will be no escape for the Princess this time\" was \"There will be no escape for the Captain this time.\" (A reference to Captain Antilles, who Vader later strangles to death.)  ",
        "\nGilbert Taylor found filming in Elstree highly problematic. The sets John Barry made \"were like a coal mine\", as the cinematographer described. He said that \"they were all black and gray, with really no opportunities for lighting at all.\" To resolve the problem, he worked the lighting into the sets by chopping in its walls, ceiling and floors. This would result in \"a 'cut-out' system of panel lighting\", with quartz lamps that could be placed in the holes in the walls, ceiling and floors. His idea was supported by the Fox studio, which agreed that \"we couldn't have this 'black hole of Calcutta'\". The lighting approach Taylor devised \"allowed George to shoot in almost any direction without extensive relighting, which gave him more freedom.\"  ",
        "\nDirector George Lucas had trouble getting funding for this movie, most studios (including Universal and United Artists) thought that people wouldn't go to see it.  ",
        "\nA total of 30 sets consisting of planets, starships, caves, control rooms, cantinas, and the Death Star corridors were created; all of the nine sound stages at Elstree were used to accommodate them.  ",
        "\nAll of the dialogue by Shelagh Fraser (Aunt Beru) was dubbed.  ",
        "\nWhen Luke and his aunt and uncle are eating they are using a white set of glasses and pitcher. These are a Tupperware style.  ",
        "\nLucas has stated dictators throughout history, Greek mythology, and the rise and fall of the Roman Empire, all influenced him to create the story line, the characters and themes.  ",
        "\nThroughout production, George Lucas had several disputes with his director of photography, veteran British cinematographer Gilbert Taylor. Lucas saw the entire film as having a documentary look, while Taylor felt the desert locations required a more abstract approach, with strange angles and such. In the end a compromise was reached, with the final result being a blending of the two styles.  ",
        "\nWhen the film was released on May 25, 1977, there was no actual movie poster to advertise it. Although no one is exactly sure when the poster first appeared outside theaters, the now-familiar illustration by artist Tom Jung (known as the 'Style A' poster) was nowhere to be seen on opening day or immediately after. The advertising department at 20th Century-Fox had an extremely difficult time coming up with an ad campaign to promote \"Star Wars\" which met with everyone's approval, and so it's possible that Jung's artwork was not ready in time for the film's release, which was only in a mere 32 U.S. theaters on its first day.  ",
        "\nThe scene in Ben Kenobi's house was originally supposed to start with the viewing of Princess Leia's message. Editor Paul Hirsch felt that having Leia's plea for help be followed by a lot of talking about the past made the characters seem a bit callous. At Hirsch's suggestion the sequence was rearranged so that Ben gives Luke the lightsaber and explains the Force before watching Leia's message. (In the end, the change does create a continuity issue with Threepio, who shuts himself off just before Ben gives Luke the lightsaber, only to appear awake again when watching Leia's message, then off again afterwards.)  ",
        "\nIn March 1983, U.S. president Ronald Reagan proposed a massive, technologically complex defensive system that was intended to defend the country from nuclear attacks by intercepting intercontinental ballistic missiles using laser battle stations based both on Earth and in space. This project's official name was the \"Strategic Defense Initiative\" (SDI), but given that many aspects of the proposal were previously familiar to the public only from science fiction, it was quickly dubbed \"Star Wars,\" after the blockbuster 1977 movie. At first this nickname was used in a largely derogatory manner (for example, the day after Reagan's speech introducing SDI to the nation, Senator Ted Kennedy was quoted in the Washington Post calling the initiatives \"reckless Star Wars schemes\") and the Reagan administration's official policy was to avoid the use of the name \"Star Wars,\" but it nonetheless quickly became a neutral shorthand used by the government, the press, and the general public alike.  ",
        "\n\"Star Wars\" was re-released theatrically in the U.S. on July 21, 1978 (although this was more of an extended first run, as some theaters had never stopped showing the film since its original release), August 15, 1979 (for three weeks only, with a preview of \"The Empire Strikes Back\"), April 10, 1981 (for two weeks only, now subtitled as \"Episode IV: A New Hope\"), and August 13, 1982 (for three weeks only, with a preview for \"Revenge of the Jedi\"). It was also shown on a triple-bill with \"The Empire Strikes Back\" and \"Return of the Jedi\" for a single performance in nine U.S. cities on March 28, 1985.  ",
        "\nThe original title George Lucus intended on was The Adventures Of Starkiller Episode 1: The Star Wars.  ",
        "\nThe name Stormtroopers originated in Germany used to describe the Canadian expeditionary forces who captured Vimy Ridge during the First World War.  ",
        "\nFormer F1 world champion, Nigel Mansell, is a huge fan of Star Wars, which is why his car always carried a red 5 as its number.  ",
        "\nAlan Ladd Jr. offered George Lucas some of the only support from the studio; he dealt with scrutiny from board members over the rising budget and complex screenplay drafts. Initially, Fox approved $8 million for the project; Gary Kurtz said: \"we proceeded to pick a production plan and do a more final budget with a British art department and look for locations in North Africa, and kind of pulled together some things. Then, it was obvious that 8 million wasn't going to do it-they had approved 8 million.\" After requests from the team that \"it had to be more\", the executives \"got a bit scared\". For two weeks, Lucas and his crew \"didn't really do anything except kind of pull together new budget figures\". At the same time, after production fell behind schedule, Ladd told Lucas he had to finish production within a week or he would be forced to shut down production. Kurtz said that \"it came out to be like 9.8 or .9 or something like that, and in the end they just said, 'Yes, that's okay, we'll go ahead.'\" The crew split into three units, with those units led by Lucas, Kurtz, and production supervisor 'Robert Watts'. Under the new system, the project met the studio's deadline.  ",
        "\nIn 2013, anthologized 2014, the original 1973 draft of The Star Wars, with the old General Luke Skywalker and his young pupil the Starkiller, was adapted to comic book form by Jonathan Rinzler, Mike Mayhew, and Nick Runge, published by Dark Horse.  ",
        "\nIn the early mono mix of the film, a few lines are slightly different, or completely different vocal takes. For instance, a different actress dubbed Aunt Beru's lines in the earlier mono mix. Likewise, Luke's line \"Blast it Biggs, where are you\" in the Death Star battle was \"Blast it Wedge, where are you\" in the mono version. Although the mono mix is less common, the version of the latter line in it may seem to make more sense, since Wedge was the one who did eventually save Luke in that point of the battle. However, in the chaos of such a large-scale dogfight, either version would be acceptable, since Luke might not have known that Biggs was otherwise occupied and Wedge was free to come to his aid.  ",
        "\nRanked #2 on the American Film Institute's list of the 10 greatest films in the genre \"sci-fi\" in June 2008.  ",
        "\n20th Century Fox was so convinced that the film would bomb that they focused all their marketing on Damnation Alley (1977), a film that they hoped would be a big hit, instead.  ",
        "\nGeorge Lucas changed Luke's name from Starkiller to Skywalker, because he feared that people would associate him with Charles Manson.  ",
        "\nJawa is also the name of a motorcycle manufacturer in the Czech Republic.  ",
        "\nThe 1984 CBS broadcast of the film was introduced by Mark Hamill.  ",
        "\nIn a commentary track on the Star Wars Blu-ray release, George Lucas stated that ships in the Star Wars universe can't travel in straight lines while in hyperspace due to collisions with celestial objects. Thus, distance is an important factor in how quickly a ship can get from point A to point B. The Millennium Falcon's superior navigation computer allowed it to travel shorter distances between points and arrive faster.  ",
        "\nAs Luke, Han, Chewbacca and Obi Wan are walking into docking bay 94 a cube can be seen in the background which bears a striking resemblance to those found in Valve's Portal game series. This occurs at 54:30.  When the scanner team boards the Milennium Falcon, the object they are carrying resembles 2 Portal cubes stuck together.  ",
        "\nTerri Nunn of the band Berlin was in the running for the role of Princess Leia and had readings with Harrison Ford and Mark Hamill.  ",
        "\nThe Jawas filmed on location in Tunisia were played by Jack Purvis, some local extras and the daughters of producer Gary Kurtz: Melissa Kurtz & Tiffany Hillkurtz. The Jawas filmed in Pinewood Studios, England, for the scene where R2 and 3PO are woken inside the Sand Crawler, were played by Rusty Goffe and the sons of stunt coordinator Peter Diamond: Frazer Diamond & Warwick Diamond.  ",
        "\nAlec Guinness and Peter Cushing have both appeared in productions of Hamlet. One of Guinness's first roles, at the age of 19, was playing Osric in John Gielgud's production in 1933, which is considered to be one of the best theatrical productions of the twentieth century. Cushing played the same part in Laurence Olivier's film version of Hamlet (1948), which marked his first collaboration with future Star Wars cast member Christopher Lee.  ",
        "\nC-3PO erroneously refers to his new master as 'Sir Luke', the correct address for someone who has been knighted. Luke corrects him but will eventually become a Jedi Knight so the title is actually justified.  ",
        "\nAnthony Daniels has said that he wanted the role of C-3PO after he saw a Ralph McQuarrie drawing of the character and was struck by the vulnerability in the robot's face.  ",
        "\nFilming in Tunisia was highly problematic. George Lucas fell behind schedule in the first week of shooting due to malfunctioning props and electronic breakdowns. Moreover, a rare Tunisian rainstorm struck the country, which further disrupted filming. Gilbert Taylor said, \"you couldn't really see where the land ended and the sky began. It was all a gray mess, and the robots were just a blur.\" Given this situation, Lucas requested for heavy filtration, which confused Taylor, who said: \"I thought the look of the film should be absolutely clean ... But George saw it differently, so we tried using nets and other diffusion. He asked to set up one shot on the robots with a 300mm, and the sand and sky just mushed together. I told him it wouldn't work, but he said that was the way he wanted to do the entire film, all diffused.\" This difference was later settled by 20th Century Fox executives, who backed Taylor's suggestion.  ",
        "\nThe first film in the series to be given the U rating in the United Kingdom. The following films \"The Empire Strikes Back\" and \"Return of The Jedi\" were also rated U. But the 1999 prequel \"The Phantom Menace\" was the last film in the series to be given the U rating in the UK and was later given the PG rating when it was released on DVD. \"Attack of the Clones\" was also rated PG. \"Revenge of the Sith\" and \"The Force Awakens\" were both given the 12A rating.  ",
        "\nBefore it became the Tantive IV, the model used for Princess Leia's diplomatic cruiser had originally been constructed as an early version of the Millennium Falcon. Since it was going to be the primary spaceship seen in the film, the model was constructed approximately six feet long, and even included such details as tiny footprints on the outside hull. When it was discovered that a similar-looking ship (which even had the similar name of 'Eagle') was being featured on a new TV program called \"Space: 1999\", the model was relegated to a less important role in the film, which led to the Falcon being totally redesigned (and thus, the now-familiar \"hamburger\" configuration was born). The original model was then given a new hammerhead-shaped cockpit (the original cone-shaped one being transplanted to the new version of the Falcon, along with its round radar dish) and some of its surface details were altered (escape pods protruding from the hull were modified to become laser turrets) to suggest a larger scale spacecraft.  ",
        "\nPrincess Leia's consular ship and Darth Vader's Imperial Star Destroyer are not actually referred to by their proper names -- the Tantive IV and Devastator -- in the film itself. These names did not appear until 1981, when they were used in the NPR radio dramatization of \"Star Wars.\"  ",
        "\nThe first teaser trailer for \"Star Wars\" was narrated by the late Malachi Throne, although often mistaken for Paul Frees (who did provide the narration for the 1978 parody \"Hardware Wars\", which itself resembled a long coming attractions preview). Throne also narrated the 1980 LP, \"The Story of the Empire Strikes Back.\"  ",
        "\nThe planet Tatooine was originally going to be called Utapau. George Lucas decided to change the name while filming on location in Tunisia, inspired by a nearby city known as Tataouine. Years later, Utapau would become the name of a different planet seen in Episode III.  ",
        "\nAccording to sound designer Ben Burtt, the buzzing sound heard when Luke activates the droid calling device to bring Threepio out of hiding was actually made by an old toy ray gun Burtt loved as a child.  ",
        "\nThe krayt dragon skeleton Threepio walks past while in the Tatooine desert was actually that of a diplodocus left over from the 1975 Disney film \"One of Our Dinosaurs is Missing\", which had been made at Elstree Studios a couple years before \"Star Wars.\" Upon discovery, the bones were transported to Tunisia aboard a Lockheed Hercules, which had been chartered to deliver some forgotten equipment needed for the desert location shoot.  ",
        "\nThe T-16 skyhopper model Luke plays with in the garage is actually an early prototype model made by Colin Cantwell.  ",
        "\nLuke and C-3PO go searching for R2-D2 in the landspeeder because the Lars family skyhopper is supposed to be in the homestead garage getting overhauled. In a scene cut from the film, it was explained that Luke damaged the skyhopper during a race in Beggars Canyon (which Luke makes a reference to in the film during the Battle of Yavin). This backstory was later utilized in the 1981 NPR radio dramatization of \"Star Wars.\"  ",
        "\nThe main airlock door on the Tantive IV was actually the same prop (painted white) as the trash compactor hatch from the Death Star. Because the film's opening scenes were actually shot last, the Tantive set wasn't constructed until the end of production, by which time the budget had become so limited that a lot of things had to be reused from previous sets which had been demolished.  ",
        "\nThe way it was originally written (and happens in the novelization), Luke was supposed to make two seperate trench runs during the Battle of Yavin. On the first attempt, he used the targeting computer and missed, but during the second, going in at full throttle, he succeeded by trusting the Force. When the film was edited, it was decided to up the stakes by merging elements from both runs into a single sequence, so that Luke only has one chance to destroy the Death Star.  ",
        "\nIronically, Disney took a pass when George Lucas presented an early treatment for \"Star Wars\" to them in 1973. The studio eventually began developing a space adventure film of its own called \"Space Probe One\" -- which later became \"The Black Hole\", released in 1979 (by which time lots of science-fiction productions were being made, many of them clearly influenced by \"Star Wars\").  ",
        "\nAlthough the shot was redone for the Special Edition, the building originally seen in the background when Luke's landspeeder heads toward the outskirts of Mos Eisley was also used in the deleted Anchorhead scenes as the Tosche Station. The actual building was known locally as the Sidi Jemour, located on the island of Djerba, Tunisia.  ",
        "\nThe movie was originally rated G (\"Suitable For General Audiences\") by the MPAA, which George Lucas feared would be a kiss of death as it would brand it as merely for children. Fox arranged a second screening for the MPAA ratings board in front of a preview audience. A child screamed and burst into tears during the scene where Darth Vader kills Captain Antilles; the ratings board agreed to a PG rating.  ",
        "\nRichard LeParmentier [Conan Antonio mott-man who is force-choked by Vader] has stated that he is pleased to be remembered as Motti, and that he considers it an honor to have been part of Star Wars. LeParmentier was producing an animated fan film called Motti Now, in which Motti survives the Battle of Yavin and abandons the Empire.  ",
        "\nFirsts words from Han Solo are \"Han Solo\".  ",
        "\nCarrie Fisher confirmed in her autobiography that she disliked the \"bagel bun\" hairstyle she wore as Princess Leia. However, prior to to filming, the studio had requested that she lose some weight first, which she hadn't. Out of fear of being fired for it, she was eager to comply with everything that director George Lucas suggested, which included the hairstyle.  ",
        "\nSylvester Stallone had auditioned for Han Solo, but lost out to Harrison Ford. Harrison Ford would later work with Sylvester Stallone on The Expendables 3 (2014).  ",
        "\nStudio head Alan Ladd Jr. found himself moved to tears with the rapturous response at a preview screening of the film with the general public when he realized that his gamble supporting this film against the advice of his colleagues was likely going to become a spectacular success. However, Ladd would also be later criticized at work for imprudently largely relinquishing the merchandising and sequel rights to the film to George Lucas, with which he profited handsomely without the studio's participation.  ",
        "\nThe uncredited voice of James Earl Jones as Darth Vader caused some early confusion by fans. Several fans, who were previously unfamiliar with David Prowse, were initially taken aback when hearing the actor's voice in real life, which sounded nothing like Vader, and nor did he fit their mental image of one with such a voice.  ",
        "\nMark Hamill was a fair way through his 20s when he played a 20-year-old Luke Skywalker. By the time Star Wars: Episode VI - Return of the Jedi (1983), set four years after Star Wars: Episode IV - A New Hope (1977), came to filming, Hamill had already gotten into his 30s.  ",
        "\nCarrie Fisher was not permitted to wear a bra underneath her costume during filming. Instead, George Lucas ordered her breasts held down with gaffers tape. Fisher was informed there was no underwear in space, but a more likely explaination was that Lucas wanted the movie to be good clean fun, without the 'jiggle' action popular (especially on TV) during the sexually liberated '70s. Lucas would, of course, try making amends for attempting to de-sexualize Fisher's figure by having her wear the infamous metal bikini in \"Return of the Jedi.\"  ",
        "\nAfter the Millennium Falcon is captured by the Death Star, Darth Vader sends a scanning crew aboard to search for any passengers, and says \"I sense something... a presence I haven't felt since...\", referring to his former master Obi-Wan Kenobi. At the beginning of Episode III (which reverses Episode IV's story) Anakin says \"I sense Count Dooku\", as he and Obi-Wan land on General Grievous's ship to rescue Chancellor Palpatine.  ",
        "\nThe movie wasn't released in some markets until 1979, as a preamble to the sequel \"The Empire Strikes Back\"(1980).   It was at this point that Episode IV was added to the opening credits.  ",
        "\nIn a 2016 memoir, Carrie Fisher revealed that over the course of the movie's filming, she had an affair with Harrison Ford, married to his first wife at the time, and fifteen years Fisher's senior.  ",
        "\nAn early version featured a cast made entirely of robots.  ",
        "\nIncluded among the \"1001 Movies You Must See Before You Die,\" edited by Steven Schneider.  ",
        "\nPat Roach auditioned for the role of Darth Vader.  ",
        "\nPerry King screen-tested for the role of Han Solo. Though he lost the part to Harrison Ford for the film, he got to play Solo in the National Public Radio adaptations of the original \"Star Wars\" trilogy.  ",
        "\nFilming the scenes in England took fourteen and a half weeks.  ",
        "\nLuke doesn't appear until 17 minutes into the movie in the directors cut. In the original cut from 1977, he arrives at 16 minutes.  ",
        "\nBefore the movie's release in Germany, a German teen magazine erroneously described Chewbacca as a horse-like creature.  ",
        "\nDespite not being R-rated, the scene where Owen and Beru's skeletal remains are spotted by Luke is arguably one of the most disturbing scenes in the Star Wars series.  ",
        "\nWilliam Katt auditioned for the role of Luke Skywalker.  ",
        "\nWhen it was first released in 1977 (and again in 1978 and '79), the film was known simply as \"Star Wars.\" The episode number and subtitle were not added to the opening crawl until it was re-released again on April 10, 1981 (following the original 1980 release of \"The Empire Strikes Back\", which was the first film in the original trilogy to feature an episode number). Another change made in '81 was the word 'Rebel' being capitalized in the opening crawl, which it had not been in previous releases.  ",
        "\nOriginally Jabba was not a Hutt but a mobster boss who Han Solo worked for. A scene involving Han and a human Jabba before Luke and Obi Wan leave Tattooine was filmed but was cut.  ",
        "\nIn the final battle scene, when Gold Leader checks in as standing by, in the background are two more Y-wing snub fighters. The plan to blow-up the Death Star was out of 40 or so X-wing and Y-wing snub fighters, Gold squadron's Gold Leader would break-off with two covering wingmen and make his way to the exhaust port and fire his proton torpedo at the opening while the other two Y-wings took enemy fire from behind. Luke Skywalker's (Red Five) role was to be under the command of Red Leader and to target surface towers and power cores.  ",
        "\nAlthough not identified in the film itself, the Rebel officer strangled by Darth Vader is supposed to be Captain Raymus Antilles, whom C-3PO refers to as the droids' previous owner later in the film. Played by Peter Geddis, the officer was not given an actual name in either the script or in any of the film's official tie-in publications, such as the novelization (in which the droids' previous owner is known as Captain Colton). It was actually author Brian Daley who identified this character as Captain Antilles in the 1981 NPR radio dramatization of \"Star Wars.\" In Daley's telling of events, the role of Antilles (voiced by David Ackroyd) is greatly expanded, making it clear that he is the officer strangled by Vader.  ",
        "\nThere are actually two different actors portraying Wedge Antilles in the film. The first one is Colin Higgins, who remained uncredited. He is sitting beside Luke during the strategy meeting with the Rebel pilots before the Battle of Yavin (the one who says \"That's impossible! Even for a computer.\"). However, he was dismissed after only one day of shooting and was replaced by Denis Lawson for the filming of the cockpit scenes. Both actors' voices were later overdubbed by David Ankrum. Today, Higgins' version of the character is known among Star Wars fans as \"Fake Wedge\".  ",
        "\nOne of the instruments on board the Juno Probe was a Jovian Energetic Particle Detection Instrument, or JEDI.  ",
        "\nAfter finishing work on the film, Mark Hamill provided voice work on another 20th Century Fox production - Wizards (1977) George Lucas recommended Mark Hamill to writer and director Ralph Bakshi and Mark Hamill was cast as the voice of Sean the Fairy.  ",
        "\nGeorge Lucas and fellow friend and collaborator Brian De Palma had a joint casting session as De Palma was also having auditions for the movie Carrie [1976]. Mark Hamill was chosen over William Katt for the part of Luke Skywalker and William Katt landed the part of Tommy Ross in Carrie.  ",
        "\nIn a TV interview c. 2012, Carrie Fisher discussed the after-market royalties for the Star Wars characters and joked that \"now, every time I look in a mirror, I have to pay George (Lucas) a couple of bucks.\"  ",
        "\n16mm anamorphic prints were made of the film, which featured an especially wide aspect ratio of 2.74:1 (which is twice 1.37:1, the standard ratio of 16mm). In these prints, the lower portion of the frame was cropped away, in order to preserve the actors' headroom.  ",
        "\nWhen the film hit cinemas around the globe, it wasn't called Star Wars: Episode IV - A New Hope, but just Star Wars (1977). Lucas agreed to call the film just Star Wars, in case the film bombed at the Box Office and 20th Century Fox decided not to commission a sequel due to poor Box Office results. Years later, when the special editions were released, the film was released as Star Wars: Episode IV - A New Hope.  ",
        "\nThough the novelization of the film is credited to George Lucas, who wrote and directed the film, it was actually ghostwritten by Alan Dean Foster.  ",
        "\nMichael Elphick was offered a major featured role but could not accept.  ",
        "\nTerri Lynn and Cindy Williams auditioned for the role of Princess Leia.  ",
        "\nMalcolm Tierney's (Lt. Shann Childsen) voice was dubbed over.  ",
        "\nJames Earl Jones was not credited for the voice of Darth Vader in the original film prior to the release of the Special Edition in 1997. Jones' first screen credit for doing the voice was actually the 1978 \"Star Wars\" Holiday Special.  ",
        "\nIn order to illustrate the look he wanted for the Mos Eisley scenes, George Lucas screened for his crew C'era Una Volta Il Ouest (1968) and Fellini - Satyricon (1969). The Leone western features a scene in which a character shoots another character with a gun hidden under the table similar to how Han Solo shoots Greedo. The Fellini film features many bizarre-looking characters and inspired the cantina scene.  ",
        "\nThis film, by following the series in chronological order, marks the second time C-3PO stays with the Larrs, the first time being in Attack of the Clones. But C-3PO this time is gold instead of gray and does not remember Owen due to his memory being wiped at the end of Revenge of the Sith.  ",
        "\nAdjusted to inflation (2016), A New Hope had a budget of almost 44 million dollars. To put that in retrospect, The Force Awakens had an estimated budget of 245 million dollars!  ",
        "\nAfter seeing a rough cut of Star Wars in February 1977, Brian De Palma reportedly disliked the opening six paragraphs crawl and helped George Lucas shorten and rewrite the crawl into the three-paragraphs scene in the final release \"I told George you're out of your mind if you think people are going to sit through and read this whole entire 6 paragraph's, let me help you write this I was like\".  ",
        "\nThe film was released on VHS by CBS/Fox video in Australia and New Zealand in 1989.  ",
        "\nRevealing Mistake: In the scene where you see the Tuskin Raider ride on the Bantha for a few seconds, if you look very closely at the Bantha, you can see the elephant's trunk hanging. Of course we all know that was a trained elephant under that Bantha costume.  ",
        "\nGeorge Lucas specifically picked 20th Century Fox because they had made the \"Planet of the Apes\" movies so he figured they would have a good understanding of what he wanted to do.  ",
        "\nA mutual friend of Anthony Daniels (C-3PO) and Garrick Hagon (Biggs) during filming was Will Knightley. Knightley is the father of Keira Knightley, who would appear in Star Wars: Episode I - The Phantom Menace (1999).  ",
        "\nLuke's last name was supposed to be Starkiller instead of Skywalker. The name \"Starkiller\" was revived in Star Wars: Episode VII - The Force Awakens, as the name of The First Order's base of multi-planet destruction, dubbed \"Starkiller Base\".  ",
        "\nThe film is included on Roger Ebert's \"Great Movies\" list.  ",
        "\nDarth Vader has only twelve minutes of screen time in this film.  ",
        "\nThe original name of the main character in this film was Luke Starkiller, and that was the character's name when filming began in Tunisia. Later, when filming moved to Elstree Studios in London, George Lucas had second thoughts and changed the name to Skywalker. This did not cause a problem, as Luke's last name had not been used in the scenes already shot. The name \"Starkiller\" would later be used as the name of the Sith apprentice in Star Wars: The Force Unleashed (2008). In honour of Lucas, J.J. Abrams named The First Order base, seen in Star Wars: Episode VII - The Force Awakens (2015), \"Starkiller Base.\"  ",
        "\nMark Hamill and Carrie Fisher are of Swedish and Jewish ancestry, respectively. In the prequels, their parents would be played by Hayden Christensen and Natalie Portman, who also have Swedish and Jewish ancestry.  ",
        "\nLuke Skywalker was originally written to be a much older character. He was General Luke Skywalker, a Jedi Master described as being about 60 years old with a grey beard, and mentor to Anakin Starkiller. This version makes Luke's character much more like that of Obi-Wan Kenobi. This is very similar to how Luke appears in Star Wars: Episode VII - The Force Awakens (2015).  ",
        "\nVader,\" pronounced differently, is the Dutch word for \"father.\" In German, \"Vater\" means \"father.\"  ",
        "\nThe reunion scene between Luke and Biggs that was added to the Special Edition is slightly cut. In the uncut version, which was never edited into any version of the film, Red leader asks Luke if he can handle the X-Wing and realizes that he knew Luke's father, and tells Luke that his father was one of the best pilots he's known. This line was cut by having a new extra walking past the screen to serve as a wipe.  ",
        "\nIn earlier drafts, including the ones that were used for audition readings, the planet Alderaan was known as Organa Major. Although the name was changed, the \"Organa\" was retained and became Leia's adoptive family name.  ",
        "\nPrincess Leia is stunned by a stormtrooper in the opening scene. This is the only time an Imperial blaster is fired in stun mode in any Star Wars saga film.  ",
        "\nIn the Visual Dictionary of the film, a bit more is revealed about Han Solo's background. Han Solo was raised by space gypsies and he never knew who his family was.  ",
        "\nThis is the last time we see Darth Vader kill anyone via lightsaber (Although it could be argued that Obi Wan Kenobi sacrificed himself). All other kills by Darth in the following movies occur by means other than lightsaber; mainly force choking. Until Rogue One: A Star Wars Story (2016).  ",
        "\nHan Solo's line \"Watch your mouth, kid, or you're gonna find yourself floating home!\" is in the song \"The Flood\" by Take That. Robbie Williams is a big fan of the series and includes the lines 'That's not a moon, it's a space station' and 'Red 5 standing by!' in Viva Life On Mars from his Rudebox album.  ",
        "\nDuring the Battle of Yavin, David Prowse's eyes could be seen through the Darth Vader mask. Although this is a goof, it hints that Darth Vader was 100 percent human before becoming part robot.  ",
        "\nEpisode IV and VI bookend the opening and closing of both movies. They both start on Darth Vader's spaceship and end with joy on a planet with the characters facing the audience. The reverse happens in Episode V which doesn't open on Darth Vader's spaceship and ends in tragedy with the characters facing away from the audience in a spaceship.  ",
        "\nIn a deleted scene, Red Leader tells Luke that he knew his father. Red Leader is killed by Darth Vader in the Battle of Yavin. If the deleted scene was not taken out of the film, it could had been a foreshadowing of Darth Vader revealing to Luke who he is in Star Wars: Episode V - The Empire Strikes Back (1980).  ",
        "\nDarth Vader is first seen in Episode IV in a white interior shot with black smoke in the middle of the screen. Episode III first shows Darth Vader in a black interior shot with white smoke in the middle of the screen.  ",
        "\nEpisode III reverses the story of Episode IV. Episode III starts with a rescue mission, continues with Anakin realizing his destiny in life, and ending with the Empire taking over. Episode IV starts with the Empire having taken over, continues with Luke realizing his destiny in life, and ending with a rescue mission.  ",
        "\nThe characters appear in reverse order per episode. Episode I reverses Episode IV by having Anakin arrive at 32 minutes at an indoor location compared to Luke arriving at 16 minutes in an outdoor location. Obi-Wan appears late in Episode IV, but early in Episode I. Vice versa for C-3PO. In fact, Anakin creating C-3PO foreshadows not only the fact that he will be a talking robot later in life, but Luke has it in him to be an inventor from his father, but doesn't know how to fix anything. When we first meet Luke, he's fixing a robot that is still broken. Also, his aunt and uncle say after lunch \"He has a lot of his father in him.\" Leia is trying to escape her father Darth Vader without knowing they're related, but Anakin is taken away from his mom. He loses a dream to free the slaves, but Luke gained a dream of being a Jedi after his aunt and uncle died. Anakin blowing up the space console ending the war is a reverse of how Luke is in control of his actions when destroying the death star.  ",
        "\nThe opening action sequence of Episode IV reverses in Episode I. Notice that the opening of Episode I starts with four characters approaching the spaceship where the a female version of C-3PO greets the Jedis. Soon, an explosion occurs where white smoke in another room emerges contrasting the dark interiors of the spaceship where the Jedis do battle with robots. Queen Amidala sends a message. In Episode IV, Storm Troopers use guns leading to an explosion of black smoke contrasting the interiors of the spaceship being white. C-3PO is the first character talking and soon Darth Vader arrives after the action ends. Princess Leia sends a message and two characters (C-3PO and R2D2) leave the spaceship.  ",
        "\nThe spin-off film Rogue One (2016) which is a prequel to Star Wars (1977) details how the Rebel Alliance stole the Death Star plans and reveals how Darth Vader knew the Death Star plans were aboard Tantive IV.  ",
        "\nEpisode IV will reverse order of characters and scenarios in Episode V. Episode V doesn't open on Darth Vader's spaceship and Han Solo arrived early because he was late in IV and VI. Also, Leia isn't a slave in Episode V and VII and Han Solo was captured at the end of Episode V since that's when Leia was rescued in Episode IV. The final lightsaber duel in Episode V is a stalemate since it's the middle of the trilogy.  "
    ],
    "cameo": [],
    "spoiler": [
        "\nDarth Vader has only twelve minutes of screen time in this film.  ",
        "\nThe original name of the main character in this film was Luke Starkiller, and that was the character's name when filming began in Tunisia. Later, when filming moved to Elstree Studios in London, George Lucas had second thoughts and changed the name to Skywalker. This did not cause a problem, as Luke's last name had not been used in the scenes already shot. The name \"Starkiller\" would later be used as the name of the Sith apprentice in Star Wars: The Force Unleashed (2008). In honour of Lucas, J.J. Abrams named The First Order base, seen in Star Wars: Episode VII - The Force Awakens (2015), \"Starkiller Base.\"  ",
        "\nMark Hamill and Carrie Fisher are of Swedish and Jewish ancestry, respectively. In the prequels, their parents would be played by Hayden Christensen and Natalie Portman, who also have Swedish and Jewish ancestry.  ",
        "\nLuke Skywalker was originally written to be a much older character. He was General Luke Skywalker, a Jedi Master described as being about 60 years old with a grey beard, and mentor to Anakin Starkiller. This version makes Luke's character much more like that of Obi-Wan Kenobi. This is very similar to how Luke appears in Star Wars: Episode VII - The Force Awakens (2015).  ",
        "\nVader,\" pronounced differently, is the Dutch word for \"father.\" In German, \"Vater\" means \"father.\"  ",
        "\nThe reunion scene between Luke and Biggs that was added to the Special Edition is slightly cut. In the uncut version, which was never edited into any version of the film, Red leader asks Luke if he can handle the X-Wing and realizes that he knew Luke's father, and tells Luke that his father was one of the best pilots he's known. This line was cut by having a new extra walking past the screen to serve as a wipe.  ",
        "\nIn earlier drafts, including the ones that were used for audition readings, the planet Alderaan was known as Organa Major. Although the name was changed, the \"Organa\" was retained and became Leia's adoptive family name.  ",
        "\nPrincess Leia is stunned by a stormtrooper in the opening scene. This is the only time an Imperial blaster is fired in stun mode in any Star Wars saga film.  ",
        "\nIn the Visual Dictionary of the film, a bit more is revealed about Han Solo's background. Han Solo was raised by space gypsies and he never knew who his family was.  ",
        "\nThis is the last time we see Darth Vader kill anyone via lightsaber (Although it could be argued that Obi Wan Kenobi sacrificed himself). All other kills by Darth in the following movies occur by means other than lightsaber; mainly force choking. Until Rogue One: A Star Wars Story (2016).  ",
        "\nHan Solo's line \"Watch your mouth, kid, or you're gonna find yourself floating home!\" is in the song \"The Flood\" by Take That. Robbie Williams is a big fan of the series and includes the lines 'That's not a moon, it's a space station' and 'Red 5 standing by!' in Viva Life On Mars from his Rudebox album.  ",
        "\nDuring the Battle of Yavin, David Prowse's eyes could be seen through the Darth Vader mask. Although this is a goof, it hints that Darth Vader was 100 percent human before becoming part robot.  ",
        "\nEpisode IV and VI bookend the opening and closing of both movies. They both start on Darth Vader's spaceship and end with joy on a planet with the characters facing the audience. The reverse happens in Episode V which doesn't open on Darth Vader's spaceship and ends in tragedy with the characters facing away from the audience in a spaceship.  ",
        "\nIn a deleted scene, Red Leader tells Luke that he knew his father. Red Leader is killed by Darth Vader in the Battle of Yavin. If the deleted scene was not taken out of the film, it could had been a foreshadowing of Darth Vader revealing to Luke who he is in Star Wars: Episode V - The Empire Strikes Back (1980).  ",
        "\nDarth Vader is first seen in Episode IV in a white interior shot with black smoke in the middle of the screen. Episode III first shows Darth Vader in a black interior shot with white smoke in the middle of the screen.  ",
        "\nEpisode III reverses the story of Episode IV. Episode III starts with a rescue mission, continues with Anakin realizing his destiny in life, and ending with the Empire taking over. Episode IV starts with the Empire having taken over, continues with Luke realizing his destiny in life, and ending with a rescue mission.  ",
        "\nThe characters appear in reverse order per episode. Episode I reverses Episode IV by having Anakin arrive at 32 minutes at an indoor location compared to Luke arriving at 16 minutes in an outdoor location. Obi-Wan appears late in Episode IV, but early in Episode I. Vice versa for C-3PO. In fact, Anakin creating C-3PO foreshadows not only the fact that he will be a talking robot later in life, but Luke has it in him to be an inventor from his father, but doesn't know how to fix anything. When we first meet Luke, he's fixing a robot that is still broken. Also, his aunt and uncle say after lunch \"He has a lot of his father in him.\" Leia is trying to escape her father Darth Vader without knowing they're related, but Anakin is taken away from his mom. He loses a dream to free the slaves, but Luke gained a dream of being a Jedi after his aunt and uncle died. Anakin blowing up the space console ending the war is a reverse of how Luke is in control of his actions when destroying the death star.  ",
        "\nThe opening action sequence of Episode IV reverses in Episode I. Notice that the opening of Episode I starts with four characters approaching the spaceship where the a female version of C-3PO greets the Jedis. Soon, an explosion occurs where white smoke in another room emerges contrasting the dark interiors of the spaceship where the Jedis do battle with robots. Queen Amidala sends a message. In Episode IV, Storm Troopers use guns leading to an explosion of black smoke contrasting the interiors of the spaceship being white. C-3PO is the first character talking and soon Darth Vader arrives after the action ends. Princess Leia sends a message and two characters (C-3PO and R2D2) leave the spaceship.  ",
        "\nThe spin-off film Rogue One (2016) which is a prequel to Star Wars (1977) details how the Rebel Alliance stole the Death Star plans and reveals how Darth Vader knew the Death Star plans were aboard Tantive IV.  ",
        "\nEpisode IV will reverse order of characters and scenarios in Episode V. Episode V doesn't open on Darth Vader's spaceship and Han Solo arrived early because he was late in IV and VI. Also, Leia isn't a slave in Episode V and VII and Han Solo was captured at the end of Episode V since that's when Leia was rescued in Episode IV. The final lightsaber duel in Episode V is a stalemate since it's the middle of the trilogy.  "
    ]
}