{
    "common": [
        "\nBenicio Del Toro was announced to be playing a villain in the film. He was previously cast as Darth Maul, the primary antagonist of Star Wars: Episode I - The Phantom Menace (1999), but dropped out after George Lucas removed most of Maul's lines from the script.  ",
        "\nJoaquin Phoenix turned down the role that eventually went to Benicio Del Toro.  ",
        "\nIt was confirmed in 2016 that John Williams will compose the music for Episode VIII. This will be the 8th Star Wars film he composes.  ",
        "\nEwan McGregor has expressed his interest to reprise his role as Obi-Wan Kenobi in this film.  ",
        "\nEarly filming took place with Mark Hamill and Daisy Ridley on Skellig Michael off the coast of County Kerry, Ireland, in late September 2015. On February 15, 2016, LucasFilm posted a short production-announcement video, which included some footage and behind-the-scenes shots, and which picks up immediately after the final scene of Star Wars: Episode VII - The Force Awakens (2015). Main photography was scheduled to begin in early January 2016, but was delayed a month reportedly due to script revisions, and began on February 15.  ",
        "\nFirst film in the series in which Kenny Baker was not involved in the portrayal of R2-D2. Jimmy Vee was given the job, shortly before Baker's death.  ",
        "\nThe production name for Episode VIII was \"Space Bear\".  ",
        "\nOn December 2015 the production team of this film and Rogue One (2016) went to Mexico City looking for filming locations, specifically at Iztapalapa and Tlahuac boroughs. It was later confirmed that some scenes for both films would be filmed in Mexico City, but due to some trouble with the local government the filming was cancelled.  ",
        "\nThe film will be released over 40 years after Star Wars: Episode IV - A New Hope (1977) and will mark the 40th anniversary of the Star Wars film franchise.  ",
        "\nLawrence Kasdan initially wrote a story outline for the film, but was called away to work on Star Wars: Episode VII - The Force Awakens (2015) when problems arose with that film's initial script. When Rian Johnson signed on as director he requested to be allowed to scrap Kasdan's story and write his own script from scratch, which the producers consented to, as Kasdan's outline no longer matched up with the finished storyline of the previous film.  ",
        "\nDirector Rian Johnson has said that the film took inspiration from Twelve O'Clock High (1949), Letter Never Sent (1960), The Bridge on the River Kwai (1957) and Three Outlaw Samurai (1964).  ",
        "\nSome fans have noted that the titles of this film and its predecessor form a sentence. Namely, \"The Force awakens the last Jedi\".  ",
        "\nRian Johnson was influenced by Twelve O'Clock High (1949) and Letter Never Sent (1960) (known as \"Letter Never Sent\" in English-speaking countries) and arranged for screenings for the crew prior to filming.  ",
        "\nRian Johnson was originally considered to direct Star Wars: Episode VII - The Force Awakens (2015).  ",
        "\nThe Irish location filming in Donegal was intended to follow on from the dark Skellig ending of \"The Force Awakens\". However the weather was unseasonably good and shooting took longer than expected.  ",
        "\nThe original release date was May 26, 2017. However, in January of 2016, the film's release was rescheduled for December 15, 2017, based on how successful Star Wars: Episode VII - The Force Awakens (2015) was releasing in December..  ",
        "\nThe title of \"Star Wars VIII The Last Jedi\" was first published in Spanish and translated to \"The Last Jedis\", meaning the title is plural.  ",
        "\nThe second Star Wars film that's filmed selected sequences with IMAX cameras.  ",
        "\nNone of Carrie Fisher's scenes in the movie are cut out.  ",
        "\nKelly Marie Tran didn't tell anyone that she was doing the movie and lied that she was doing an indie movie in Canada. At one point, she actually got some maple syrup to bring back to her parents, so they actually thought she was in Canada.  ",
        "\nHayden Christensen expressed his interest in future Star Wars films.  ",
        "\nOn January 24th 2017, the title of the film was announced as Star Wars: The Last Jedi.  ",
        "\nBillie Lourd who played Lieutenant Connix is the previous film will have a bigger role in this film. Billie is also the Daughter of Carrie Fisher.  ",
        "\nCarrie Fisher was also a well-known writer, whose services were often called upon to act as script doctor for other films. She later began declining such assignments when producers would solicit her story ideas, then hire someone else to actually change the script, using her ideas without paying her. However, Rian Johnson revealed that Fisher helped with the writing of the script for this film.  ",
        "\nThe \"STAR WARS\" logo is red. Possibly meaning that \"THE LAST JEDI\" is coinciding the ruby anniversary year, celebrating 40 years of the franchise since the original movie was released in 1977.  ",
        "\nAs with Star Wars: Episode V - The Empire Strikes Back (1980), Star Wars: Episode VI - Return of the Jedi (1983) and Star Wars: Episode VII - The Force Awakens (2015), the episode number will not be included in the official marketing of the film. However, it will appear in the opening title crawl.  ",
        "\nCarrie Fisher credited Miguel Ferrer for preparing her for her original audition for the role of Leia. Ferrer later became known for playing Agent Albert Rosenfeld in 'Twin Peaks (1990)(TV)'. Like Fisher, Ferrer ended up returning to that role decades later in 'Twin Peaks (2017)(TV)', but also died before its premiere. Laura Dern appears in both Twin Peaks and The Last Jedi.  ",
        "\nCarrie Fisher's final film due to her death in December 2016.  ",
        "\nDuring the trailer, there is a shot of what appears to be several books old on a shelf. We then see a shot of a gloved hand running over a faded tome with the symbol of the jedi on it. In the Force Awakens we are told Luke was searching for the first Jedi Temple. It is possible in the caves of the planet Ahch-to, he found the ancient texts of those first force users. A parallel may be drawn in real life to the Dead Sea Scrolls, the founding documents of Christianity (through which, Lucas drew inspiration for the original Star Wars) being found in caves in Israel and the Middle East  ",
        "\nBenicio Del Toro is the fourth Academy Award winner to star in a Star Wars film, after Alec Guinness, Natalie Portman, and Lupita Nyong'o.  ",
        "\nTom Hardy, who makes a cameo appearance as a storm trooper, made one of his earliest film appearances in Star Trek: Nemesis (2002). He also appeared in Black Hawk Down (2001) with Ewan McGregor. He and Mark Hamill have also both appeared in the Batman franchise. Hardy played Bane in The Dark Knight Rises (2012), while Hamill voiced the Joker.  ",
        "\nPrince William and Prince Harry visited the set of the film.  ",
        "\nThe title of this film, \"The Last Jedi,\" was revealed on January 23, 2017. The phrase appears in the opening crawl of \"The Force Awakens\", making this the first time the title of a Star Wars film appeared in an opening crawl.  ",
        "\nOn April 4th 2016, it was rumored Adrian Edmondson would be starring in the film.  ",
        "\nAustralian actor Mahesh Jadu turned down the role of Poe Dameron (now portrayed by Oscar Isaac) in the Star Wars saga, for his role of The Spanish Soldier in Pirates of the Caribbean: Dead Men Tell No Tales (2017).  ",
        "\nThe first teaser trailer was released on April 14, 2017.  ",
        "\nFootage was shown to Disney shareholders.[March 2017]  ",
        "\nSecond Star Wars movie to take place directly after the events of the previous movie. A New Hope took place directly after the events of Rogue One - A Star Wars Story.  ",
        "\nLaura Dern has starred as Sandy Williams in David Lynch's classic thriller Blue Velvet (1986). David Lynch also directed Dune (1984) based on the science fiction fantasy novel by Frank Herbert. It had been acknowledged and speculated that Dune was one of George Lucas's influences behind the Star Wars saga and David Lynch had turned down the offer to direct Star Wars: Episode VI - Return of the Jedi (1983) to direct Dune.  ",
        "\nReleased the same day as 20th Century Fox's Ferdinand (2017), similar to how Star Wars: Episode VII - The Force Awakens (2015) released the same day as 20th Century Fox's Alvin and the Chipmunks: The Road Chip (2015).  ",
        "\nThe previous films in the series all took place at least a year after the previous film. This film takes up right where Star Wars: Episode VII - The Force Awakens (2015) left off, including a re-creation of the final scene and a funeral for Han Solo.  ",
        "\nIt is rumored that Frank Oz, Ewan McGregor, and Hayden Christensen would reprise their roles as Yoda, Obi-Wan Kenobi and Anakin Skywalker respectively.  ",
        "\nAn image of the toy box layout for Episode 8 toys leaked in early February. Poe and Finn look much the same, however Rey's hair is down, and it appears as if she has a scar above her left eye. It is unclear if the scar was a result of training, or if it is meant to be reminiscent of Anakin Skywalker's scar from episode 3.  ",
        "\nMark Hamill let it slip that it was a great experience to play Luke Skywalker once again and how emotional it was during the films wrapping. This speculated that Luke would most likely die in the film as he (Hamill) did not say he would reprise the role for Episode IX. Hamill did later comment that it was not what he meant.  ",
        "\nLiam Neeson has expressed interest in returning to the Star Wars franchise as Qui-Gon Jinn, either as a spin off solo movie, or a ghost in episode 8 or 9.  ",
        "\nThe first Star Wars film which does not take place 3 - 4 years, not even a decade after the previous film. The film is a direct continuation of Star Wars: The Force Awakens (2015) and takes place shortly after Rey arrives on the island on the oceanic planet and finds Luke Skywalker and presents to him his old lightsaber.  ",
        "\nAs with Episode VII, \"script leaks\" abound. So far the most prominent theory is that VIII will have some similarities to Episode V, the first sequel, but none as close as Episode VII had to Episode IV.  ",
        "\nDirector Rian Johnsin has said that Luke Skywalker is the last Jedi.  ",
        "\nDirector Rian Johnson admits that he moved Kylo Ren's facial injury. In Star Wars: The Force Awakens (2015), Rey slices his face with her light saber, giving him a laceration that goes across the bridge of his nose. In this film, the injury has scabbed over, but is now over his right eye. Johnson says a scab over his nose didn't look right. Ironically, the placement of the scar matches a similar injury on Ren's grandfather, Anakin Skywalker, in Star Wars: Revenge of the Sith (2005).  "
    ],
    "cameo": [],
    "spoiler": [
        "\nThe previous films in the series all took place at least a year after the previous film. This film takes up right where Star Wars: Episode VII - The Force Awakens (2015) left off, including a re-creation of the final scene and a funeral for Han Solo.  ",
        "\nIt is rumored that Frank Oz, Ewan McGregor, and Hayden Christensen would reprise their roles as Yoda, Obi-Wan Kenobi and Anakin Skywalker respectively.  ",
        "\nAn image of the toy box layout for Episode 8 toys leaked in early February. Poe and Finn look much the same, however Rey's hair is down, and it appears as if she has a scar above her left eye. It is unclear if the scar was a result of training, or if it is meant to be reminiscent of Anakin Skywalker's scar from episode 3.  ",
        "\nMark Hamill let it slip that it was a great experience to play Luke Skywalker once again and how emotional it was during the films wrapping. This speculated that Luke would most likely die in the film as he (Hamill) did not say he would reprise the role for Episode IX. Hamill did later comment that it was not what he meant.  ",
        "\nLiam Neeson has expressed interest in returning to the Star Wars franchise as Qui-Gon Jinn, either as a spin off solo movie, or a ghost in episode 8 or 9.  ",
        "\nThe first Star Wars film which does not take place 3 - 4 years, not even a decade after the previous film. The film is a direct continuation of Star Wars: The Force Awakens (2015) and takes place shortly after Rey arrives on the island on the oceanic planet and finds Luke Skywalker and presents to him his old lightsaber.  ",
        "\nAs with Episode VII, \"script leaks\" abound. So far the most prominent theory is that VIII will have some similarities to Episode V, the first sequel, but none as close as Episode VII had to Episode IV.  ",
        "\nDirector Rian Johnsin has said that Luke Skywalker is the last Jedi.  ",
        "\nDirector Rian Johnson admits that he moved Kylo Ren's facial injury. In Star Wars: The Force Awakens (2015), Rey slices his face with her light saber, giving him a laceration that goes across the bridge of his nose. In this film, the injury has scabbed over, but is now over his right eye. Johnson says a scab over his nose didn't look right. Ironically, the placement of the scar matches a similar injury on Ren's grandfather, Anakin Skywalker, in Star Wars: Revenge of the Sith (2005).  "
    ]
}