{
    "common": [
        "The shots where Luke uses his Jedi powers to retrieve his lightsaber from a distance were achieved by having Mark Hamill throw the lightsaber away and then running the film in reverse.  ",
        "In order to avoid sharing creative rights, George Lucas decided to avoid using a major studio to finance this film. Instead, he bankrolled the $18 million production himself, using a combination of his profits from Guerra nas Estrelas (1977) and a bank loan. Although the move was risky, it paid off several times over. Lucas recovered his investment within three months of the film's release. He then showed gratitude far beyond the Hollywood norm, by sharing the profits with his employees (nearly $5 million in bonuses).  ",
        "Mark Hamill had to bang his head 16 times on the ceiling of Yoda's hut before Irvin Kershner was satisfied.  ",
        "Carrie Fisher stood on a box for many of her scenes with Harrison Ford in order to make up for the height difference and have her appear in the frame with him. Carrie Fisher (5'1) is a foot shorter than Harrison Ford (6'1).  ",
        "When shooting on location in Finse, Norway, a fierce snow storm hit the hotel where the cast and crew were staying. This would have normally halted filming, but director Irvin Kershner thought these weather conditions were an excellent opportunity to film the scene where Luke wanders through the snow after escaping the Wampa cave. He did this by sending Mark Hamill outside into the cold, while he and the cameraman stayed and filmed inside the hotel's front hall.  ",
        "To preserve the dramatic opening of the Star Wars movies, George Lucas insisted on moving all the credits to the end of the film. However, although the Writers' Guild and Directors' Guild had begrudgingly allowed this on Guerra nas Estrelas (1977) (because that film wasn't expected to be very successful), they resented the trend being continued on this film. First they tried to pull Empire from release, but were unsuccessful. They then fined Lucas heavily, and tried to fine Irvin Kershner, but Lucas paid all the fines himself (nearly $250,000). Lucas then bitterly dropped his membership in the Writers' Guild, Directors' Guild, and the Motion Picture Association of America, a move that has hindered his hiring choices on later films (see also O Retorno de Jedi (1983) and Star Wars: Episódio III - A Vingança dos Sith (2005)).  ",
        "With the exception of being sucked out of a Cloud City window, Mark Hamill did all of his own stunts.  ",
        "George Lucas was so impressed by Frank Oz's performance as Yoda that he spent thousands of dollars on an advertising campaign to try and get him an Oscar nomination for Best Supporting Actor. Lucas's campaign ultimately failed because it was felt that a puppeteer wasn't an actor. Lucas felt this wasn't fair to Oz, who honestly didn't care.  ",
        "When Mark Hamill was having trouble with the Dagobah scenes with Yoda, Frank Oz brought in Miss Piggy to make him laugh.  ",
        "During the filming of the Battle of Hoth, the Echo Base troops were actually Norwegian mountain-rescue skiers. In exchange for participation in the film, Lucasfilm made a donation to the Norwegian Red Cross  ",
        "In the DVD commentary, Carrie Fisher relates that during some of the London filming, she stayed a house rented from Eric Idle. Idle and the Pythons were filming A Vida de Brian (1979) at the time. One evening, Idle had a small party, including Harrison Ford and The Rolling Stones, and served a potent liquor (which the Pythons had been distributing to extras on their film, to help boost morale) that he referred to as \"Tunisian Table Cleaner\". They stayed up most of the night drinking and having fun. The first scenes shot the next day were the arrival at Cloud City, which she says helps explain why she and Ford were so happy in those scenes. Idle is said to be pleased that he had a small hand in how the finished film turned out.  ",
        "Yoda's iconic manner of speech has the parts of speech in Object Subject Verb order. Very few languages on Earth use this and most are based in the Amazon river basin.  ",
        "Jim Henson, a friend of George Lucas, was offered the role of Yoda. Henson turned it down, as he was busy with A Grande Farra dos Muppets (1981). He recommended Frank Oz for the role.  ",
        "Originally in the asteroid scene, one of the asteroids was actually a shoe. The rumor is that George Lucas asked the SFX people to redo the scene so many times that they got annoyed and one of them threw in his or her shoe. Later remastered versions have corrected this.  ",
        "One of George Lucas' goals in doing a Star Wars sequel was to become financially independent from Hollywood, and he succeeded in this goal.  ",
        "In each Star Wars film, the line \"I have a bad feeling about this\" is spoken by one of the characters. In this film, Leia says it.  ",
        "An oft-quoted myth is that the Wampa attack on Luke was devised to explain the actual scars on Mark Hamill's face because he had been involved in a car crash and had to have reconstructive surgery. Hamill did indeed survive a serious car crash in January 1977 but did not have any visible scars by the time Empire began filming over two years later.  ",
        "Darth Vader sarcastically inviting Han to dinner is the only time in any of the \"Star Wars\" films that Vader speaks directly to Han.  ",
        "The sound of Darth Vader's shuttle door opening is reportedly a recording of a whole block of Alcatraz cell doors slamming shut.  ",
        "In an interview with Cinescape magazine, director Irvin Kershner said he had no interest in films with special effects. However, he was won over by George Lucas, although Kershner was determined to make the film more about characterizations than hardware. Kershner spent several months working on the script, pushing the writers into humanizing the characters more (something that Lucas has often been criticized for failing to do).  ",
        "In an early outtake, when Vader entered the Hoth base, he tripped over a cable and fell down face-first.  ",
        "George Lucas initially called this the worst Star Wars film, and apologized for its existence. He changed his mind after he found out some people believed it was the best Star Wars film.  ",
        "The scenes where R2-D2 is submerged in the mud pool were shot in George Lucas' unfinished swimming pool. Most of the crew were hidden under the water and the entire sequence was shot by George Lucas himself.  ",
        "This is the Star Wars film that George Lucas had the least involvement with. It is considered to be the best film in the saga.  ",
        "During principal photography it remained unclear if Sir Alec Guinness would return as Obi Wan Kenobi as he had just had an eye operation at the time. He finally did agree and worked just one day on the film (Wednesday, September 5, 1979). He arrived at 8.30am and completed his scenes by 1pm, for which he was paid a quarter of a percentage point of the film's gross which was worth millions of dollars.  ",
        "Carrie Fisher traveled to the filming location of Finse, Norway, even though she was not scheduled to take part in any outdoor scenes.  ",
        "Another of the asteroids is actually a potato. It appears just as the Millennium Falcon first enters the field. Two asteroids travel from the top left to the bottom right corner of the screen. Just after the second asteroid leaves the screen a third one appears in the top left corner. This is the potato.  ",
        "As Yoda and Obi-Wan urge Luke to stay on Dagobah to finish his training, Luke pulls a snake from his spaceship. Irvin Kershner assured Mark Hamill that the snake was harmless, though it did bite him during one take.  ",
        "George Lucas decided that a battle on an ice planet was necessary because he felt that it was easy to \"cheat\" in space, because the background was black and you could hide errors easily. With a white background, the effects crews would have to work much harder, and the effects would be much more impressive.  ",
        "Mark Hamill's wife gave birth to their first son (Nathan Hamill) early one morning, and Mark went straight from the hospital to shooting. This was the day they filmed the shots of Luke climbing out of his snowspeeder before it is crushed by the Imperial walker, and Hamill broke his thumb during the stunt.  ",
        "The entire Millennium Falcon was built life size for the first and only time for this installment (only half of the spacecraft was constructed for Guerra nas Estrelas (1977) and just part of it was used for the deleted sandstorm scene in O Retorno de Jedi (1983)). It measured 65 feet in diameter and 16 feet in height with a mandible giving it an overall length of 80 feet. The Falcon's weight was 23 tons.  ",
        "Darth Vader's meditation chamber is said to be a hyperbaric chamber which charges the interior air to greater than one atmospheric pressure, thus allowing him to remove his helmet and breathe normally for limited periods of time. This was not as originally presented in the film, however, which featured an additional breathing mask for Vader in the chamber, which was notoriously shown for only a split second and never made it into the official continuity.  ",
        "Han Solo's use of his mount's entrails to keep Luke warm is actually an American Indian trick. According to legend, a hunter named Hugh Glass had killed a bear despite being mauled severely, in the American frontier. He was abandoned by his fellow frontiermen, and had to crawl hundreds of miles to safety. On the way he became trapped by a sudden blizzard. He cut open a bisons stomach and climbed inside and stayed warm and safe until the storm had subsided. This event is dramatized in O Regresso (2015), starring Leonardo DiCaprio.  ",
        "The Dagobah set needed to be elevated to give Frank Oz and three other puppeteers room to control the Yoda puppet from below. For proper interaction, Mark Hamill was given an earpiece so he could hear Oz doing Yoda's voice. On numerous occasions, Irvin Kershner would give a direction to Yoda by mistake and Oz would have to remind him who to talk to.  ",
        "For the 2004 DVD release, the scene with Darth Vader and the Emperor was altered with Ian McDiarmid now playing the Emperor, as he does in the rest of the series (the original version of the scene had the Emperor played by a hooded old woman with superimposed chimpanzee eyes and was voiced by Clive Revill). The dialogue for the new version was expanded and completely re-recorded by Ian McDiarmid and James Earl Jones.  ",
        "Irvin Kershner initially turned down the opportunity to direct the film as he felt that it would be too difficult to top the success of Guerra nas Estrelas (1977). He took the job when his agent convinced him that he shouldn't pass on the opportunity to make a sequel to one of the most popular movies in history.  ",
        "The film premiered at a limited number of theaters, and those all in large metropolitan areas because it was first released only on 70 mm film, for which only the largest and most prosperous film theaters had projectors. It was many weeks later that the film was released on standard 35 mm film for other film theaters in North America and around the world.  ",
        "The carbon freezing chamber is the only time in the original trilogy that Darth Vader and C3PO can be seen on screen together.  ",
        "The blizzard in the Hoth scenes is a real blizzard - no effects were used. Harrison Ford could not arrive at the filming location via the regular train route as it was closed due to the bad weather - so he went to the site on a snow plow.  ",
        "The Imperial AT-AT walkers were all animated through traditional stop-motion techniques, except for the scenes where they fall (e.g. the walker which is \"tripped up\" by cables and falls on its head, or the one that Luke throws a thermal detonator into, which falls on its side). These were filmed in real-time on high-speed cameras with precision-timed mini-pyrotechnic charges.  ",
        "George Lucas had originally planned to only Executive Produce and finance the film, leaving the directorial duties in the hands of Irvin Kershner and day-to-day producing duties to Gary Kurtz. Directing the original Guerra nas Estrelas (1977) had left Lucas exhausted and sick, and he had intended to take time off to start to focus on the expansion of the Lucasfilm company and spending more time with his then-wife Marcia Lucas, so that they could start a family and finish construction on Skywalker Ranch. However, when production on this film ran overbudget and behind schedule, Lucas had to step in and take a more hands-on role, going on location to oversee filming and even directing portions of the film. A disastrous rough cut of the film proved incoherent during screenings, and facing the possibility of financial ruin, Lucas then re-edited the film himself with even worse results. Extensive reshoots and further post-production effects work put enormous strain on his health, his marriage, and his relationships with Kershner and Kurtz. Though the film proved an enormous critical and commercial success, Lucas would never work with Kurtz again, and his marriage dissolved a couple of years later.  ",
        "One of the first ideas for Lando Calrissian was to have him as a clone who survived the Clone Wars who leads legions of clones on a planet they settled on. Another idea had Lando as the descendant of survivors of the Clone Wars, born into a family who reproduced solely by cloning. Originally, his name was \"Lando Kadar\".  ",
        "Director Irvin Kershner decided that for this movie, members of the Rebel Alliance would speak with American accents, while the Imperial Officers would speak with British accents, to make the story analogous to the American Revolution. However, most of the supporting actors that appeared as Rebel personnel on Hoth were in-fact British actors. Consequently, Kershner had to re-dub several of the scenes taking place at the Hoth rebel base with American voices in post production.  ",
        "One of the bounty hunters Darth Vader hires to find Han Solo is IG-88. He is one of a series of IG-86 Sentinel Droids. Another can be seen in the Cloud City. The shell of this second droid can be seen in the smelting room next to a furnace where C-3PO is found by Chewbacca.  ",
        "This is the first film to have a 5.1 surround sound mix.  ",
        "The reason why Han and Leia act so happy when arriving on Bespin is because Carrie Fisher (Leia) and Harrison Ford (Han Solo) went out partying the night before, and they were still drunk while shooting.  ",
        "Lighting for the special effects scenes in space was so strong that several models melted.  ",
        "After an extra fell sick, Jeremy Bulloch (Boba Fett) was called in as a replacement to the Imperial Guard who escorts Princess Leia and pulls her into the elevator after she screams \"Luke! It's a trap!\". He's the same Imperial Guard who is captured by Lando Calrissian's men.  ",
        "Principal photography lasted over 180 days, the longest shoot of any of the \"Star Wars\" movies.  ",
        "There seems to be many stories behind Alec Guinness and his role as Obi-Wan Kenobi. In George Lucas's original treatment (when it was ALL one story instead of a trilogy), Obi-Wan lives throughout the whole story (a fact confirmed by Lucas in the DVD commentary). However, Obi-Wan ends up getting killed off in the first film Guerra nas Estrelas (1977). There are many stories as to why Lucas changed it. There are some stories that either Guinness demanded that Obi-Wan was killed off so he wouldn't have to appear in any sequels or Lucas did it on his own much to the bitterness of Guinness. In the New Hope DVD Commentary, Lucas says that he felt it was a waste of Guinness's talents to have him stand beside Leia in the control room during the Death Star battle (as it was scripted) and too outlandish to have the elderly Obi-Wan join the dogfight. So he killed off Obi-Wan in order to spur Luke on to going into Jedi training and defeat the Empire. In any event, when it came time to make Episode V: The Empire Strikes Back, in which Luke begins his training, Lucas drew from the \"ugly creature with mystical powers\" mythological archetype (as he did when creating Star Wars) and created Yoda as Luke's new Jedi master. Kenobi still makes appearances in the sequels as a Force spirit.  ",
        "The sound of Vader's helmet being lowered onto his body was the sound of someone putting their hand over a vacuum tube while it was still sucking in dust.  ",
        "Boba Fett is never referred to by name in the film. He is always referred to as \"the bounty hunter\" by other characters. However, a deleted scene included in the blu-ray set shows Leia tending to Luke's wounds and says \"a bounty hunter named Boba Fett\" has taken Han Solo.  ",
        "The sound effects on Mynocks were created by playing horse noises backwards.  ",
        "After the various increases in budget, the film became one of the most expensive of its day and after the bank threatened to pull his loan, George Lucas was forced to approach 20th Century Fox. Lucas made a deal with the studio to secure the loan in exchange for paying the studio more money, but without the loss of his sequel and merchandising rights. After the film's box office success, unhappiness at the studio over the deal's generosity to Lucas caused studio president Alan Ladd Jr. to quit. The departure of his longtime ally caused Lucas to take Os Caçadores da Arca Perdida (1981) to Paramount Pictures.  ",
        "The only Star Wars Original Trilogy film that does not take place on the desert planet Tatooine (although it is mentioned by name at the end of the film). Tatooine does appear, however, in Episodes I, II, and III, making it the only planet that appears five times in the entire saga.  ",
        "The AT-ATs were inspired by the walking machines in H.G. Wells's \"War of the Worlds\" and their appearance was based on gantry cranes which are used in most shipping ports in the USA. Walking patterns of elephants were studied to make the movements seem as realistic as possible.  ",
        "The lightsaber fight scenes set in the carbon freezing chamber tend to focus on Luke. This is because during many of the shots, Bob Anderson (Vader's fight double) was not wearing the Darth Vader helmet, as it made it difficult for him to breathe.  ",
        "Darth Vader was ranked #3 on the AFI's list of 50 Greatest Villains  ",
        "Boba Fett's action figure was originally to have had a rocket-firing mechanism, but after a child choked to death on a similar toy, the Colonial Viper from Galactica: Astronave de Combate (1978), Kenner dropped the mechanism and made the rocket stationary. A trace of the rocket launcher survived to the completed toy, however, as there is a rectangular area on the backpack in which the rocket launcher would have been embedded. The version with the mechanism is now considered the longest-running unobtainable action figure; contrary to popular belief, it was never sold to the public.  ",
        "When Luke is confronted by the phantom Darth Vader in the cave, in the original theatrical release, the \"FAKE\" Darth Vader has an alternate sound effect of his iconic \"Breathing\" and his lightsaber is colored in a more ORANGE tone and not his traditional RED. This was to give the audience a hint that Luke was not fighting the real Darth Vader. However, with the re-release and special editions of Empire Strikes Back that have come out since, cave Vader's lightsaber has been given a RED color to match the real Vader, though the alternate sound of his breathing has been left unaltered.  ",
        "The Yoda puppet was made of a less than optimal material, resulting in it being quite a bit heavier than what Frank Oz was used to from his time with the Muppets. The strain put on his arms meant the scenes had to be shot on a quite erratic schedule.  ",
        "Luke is separated from most of the main characters for the majority of the film. In fact, the only scene that has all of the main Rebel characters in together is the hospital bed scene.  ",
        "The only way to get to the set in the midst of a blizzard during filming in Norway was on a snowplow train, which had a giant auger on the front, pushing through the snow to deliver the actors to the set. The weather conditions were so severe that the crew put the camera in the back door of the hotel the cast and crew were staying and shot from out the door, 12 feet from the hotel out in the blizzard.  ",
        "Darth Vader's costume was more detailed in this film, including the flashing red lights on his chest box. A new Millennium Falcon (32-inches long) was built for this film and has two additional landing gear boxes on its underside. As a result, the original Guerra nas Estrelas (1977) model (5-foot long) was modified and given the extra landing gear bays and was used for all FX scenes of the Falcon in a landed position.  ",
        "The concept design for Cloud City was originally created for Guerra nas Estrelas (1977) (as a floating Imperial prison), but was never used. The design was recycled for use in this film.  ",
        "The scene where Solo was hit by the toolbox as well as hitting the control panels were improvised on the set. At first, the crew were afraid of shooting it, but Irvin Kershner finally persuaded them to do so, saying \"Come on, that's fun. Let's do it!\"  ",
        "Shortly after release, Darth Vader's name was changed to Lord Fener in Italy. This is because the word 'vader' in italian sounds like 'toilet'.  ",
        "Boba Fett has only five lines.  ",
        "Was filmed at the same studios as Stanley Kubrick's O Iluminado (1980). Author Stephen King visited the set, and many aspects of this film affected King's later work. Irvin Kershner was nicknamed \"Kersh\" on the set. King's novel It: Uma Obra Prima do Medo (1990) features a character named Mrs. Kersh, who sounds like Yoda.  ",
        "In the medical bay where Luke is recovering, when he folds his hands behind his head and contorts his mouth after being kissed by Leia, he is imitating Chewbacca on board the Millennium Falcon in Guerra nas Estrelas (1977) after Han Solo warns C-3P0 to let Chewbacca win the game.  ",
        "The bounty hunter dressed all in white is named Dengar. His backstory is that he was once a fierce rival of Han Solo's, and was badly beaten by him. He vowed revenge and has been hunting Solo for some time.  ",
        "Luke is upside-down at the beginning (Wampa cave), in the middle (training on Dagobah), and at the end (below Cloud City). He uses the Force each time.  ",
        "When Jeremy Bulloch went in for the role of Boba Fett and donned the costume, he figured that the Wookie scalp which adorned his shoulder was some sort of hairpiece and he tried to put it under his helmet.  ",
        "The name of Vader's super star destroyer is \"Executor\".  ",
        "Voted #3 On Empire's 500 Greatest Movies Of All Time (September 2008)  ",
        "In certain shots of the Rebel hangar, the filmmakers enlisted children as extras. The reason for this was that the actors' short stature would make the hangar appear larger than it actually was.  ",
        "A total of 64 sets were constructed for the movie.  ",
        "For the Dagobah scenes, Mark Hamill was the only one listed on the callsheets as an actor. Everyone else was listed as crew.  ",
        "Yoda's appearance was originally designed by British makeup artist Stuart Freeborn, who based Yoda's face partly on his own and partly on Albert Einstein's, as his eyes are supposedly inspired by the latter. Yoda is voiced by Frank Oz. In the original Star Wars trilogy, he is realized as a puppet (controlled by Oz).  ",
        "Months prior to the film's release, John Williams was named Conductor of the Boston Pops Orchestra. During Williams first televised performance with the Orchestra on PBS's Evening At Pops, he publicly premiered some of the new scoring pieces he composed for the movie.  ",
        "The highest grossing film of 1980.  ",
        "Contrary to popular opinion, Han's line \"I know\" was not improvised on the spot. Harrison Ford and Irvin Kershner had met before filming the scene and decided on the new dialogue. Carrie Fisher was upset that she had not been part of the process, and Lawrence Kasdan was disappointed that his dialogue had been changed, feeling it had been some of his best writing.  ",
        "In the Hoth command center, Han makes a reference to \"That bounty hunter we ran into on Ord Mandell\". An audio drama based on this, \"Rebel Mission to Ord Mandell\" was released in 1983 as an NPR radio drama, and later on 33 1/3 LP. It featured the voices of many of the original cast.  ",
        "Second unit director John Barry joined the film after quitting Saturno 3 (1980) following a dispute with that film's star, Kirk Douglas). Barry died of meningitis during production, after collapsing on set.  ",
        "The book \"Star Wars: The Annotated Screenplays\" reveals that, when the script for this movie was first written, the idea of it being \"Episode V\" of a 9 part serial had not yet been established, and it was at one point called Episode II.  ",
        "More scenes of the AT-ST Imperial \"chicken walkers\" were filmed, but George Lucas decided that the larger AT-ATs were more menacing and impressive. He later realized that the AT-STs would work better in close quarters, which led to using them extensively in the forest battle in O Retorno de Jedi (1983).  ",
        "Several crates of simulated snow as seen on the Hoth Hangar set were taken along to Finse, Norway, just in case there was not enough real snow lying about.  ",
        "The sound of Darth Vader's meditation chamber was actually the sound of a generator at an air force base the crew visited.  ",
        "The 2-1B Medical Droid's mouthpiece is actually an antique microphone.  ",
        "The scene in the Cloud City apartment where Han Solo enters to tell Princess Leia that the repairs on the Millennium Falcon are almost complete played out differently in the finished film than it did in the original script. There, Han Solo (Harrison Ford) is lounging around in the apartment when Princess Leia (Carrie Fisher) enters, having changed from the white combat clothes she wore on Hoth to the brown dress and having her hair done up differently. In surprised reaction to how she's dressed, Solo attempts to flatter her (\"You look beautiful. You should wear girls clothes all the time.\") and Leia teases him by mentioning Luke; the scene ended with them sharing a kiss. The film was originally shot this way, but director Irvin Kershner felt it wasn't coming out right, so he re-shot it to appear as it does in the finished film. Excerpts of how the scene was originally filmed can now be seen on the special edition DVD.  ",
        "The sound of the Tauntauns was produced by recording the sound of an Asian sea otter named Moda.  ",
        "The sound of R2-D2 moving was produced by recording the sound of a car window motor in operation.  ",
        "An earlier draft had Luke's reason for not leaving with Lando & Chewie at the end being that his Jedi training was more important. Believing that this would make Luke seem less sympathetic, Irvin Kershner had it changed to where Luke was still recovering from his injuries and that rescuing Han would be his first priority once he was fully recovered.  ",
        "Billy Dee Williams had previously auditioned for the role of Han Solo in Guerra nas Estrelas (1977). He finally landed the role of his old pal Lando three years later.  ",
        "Director Harley Cokeliss, who was a friend of Frank Oz having worked with him on O Show dos Muppets (1976), visited the set towards the end of filming when the production team were struggling to get everything in the can before they ran over schedule. Cokeliss was hired on the spot as an additional director and is credited as one of the Second Unit Directors.  ",
        "The chasm deep in the heart of Bespin in which Luke and Vader have their lightsaber duel was created using a matte painting. The same strategy was used in the original film in the scene where Luke and Leia blast Stormtroopers across an inactive bridge.  ",
        "During the same year O Império Contra-Ataca (1980) was released, R2-D2 and C-3PO appeared in 2 episodes of Vila Sésamo (1969) Season 11, as well as in an episode dedicated to Star Wars in O Show dos Muppets (1976), alongside Luke Skywalker (Mark Hamill) and Chewbacca in the latter. This was to celebrate the fact that Puppeteer Frank Oz would be starring in the new Star Wars film.  ",
        "The Millennium Falcon was constructed in a hangar at Pembroke Docks where great flying boats were made in the 1930s. It was brought to Elstree studios, London in sixteen interlocking sections by a convoy of trucks. After reassembly, the Falcon was floated into position on the then brand new Star Wars stage by means of compressed air pads similar to those used on hovercraft.  ",
        "Denis Lawson plays Wedge Antilles. Wedge was not originally scripted to appear in this film, but intense fan interest prompted George Lucas to include him. See also O Retorno de Jedi (1983).  ",
        "Ben Burtt recorded sounds of people in snow while visiting his family in upstate New York, which were used for the Hoth scenes.  ",
        "The film was such a success financially, it recovered its $18 million budget within three months of its release.  ",
        "This was the first movie in which there was a double for Darth Vader. In the commentary, Peter Diamond said that this was done because of the presence of bigger fights.  ",
        "Producer Gary Kurtz came up with the title for the movie.  ",
        "Harold Weed, an ILM staffer who assisted in designing the Wampa costume for the Special Edition, was cast as the Wampa for the film after he was used as the model for the costume. As he is 6 feet tall, the ice cave set for the re shoots was built with a height of 4 1/2 to 5 feet to create the illusion of the Wampa being closer to 8 or 9 feet in height.  ",
        "Most of the extras in the snowy battle scenes on the ice planet Hoth (shot at Finse, Norway) were Norwegians. One of the extras - Tom Egeland - would later become the chief news editor for one of Norway's largest TV networks, as well as a critically acclaimed mystery writer. Another - Arve Juritzen - would become one of Norway's best known TV-personalities (hosting eg. Vil du bli millionær? (2000), Big Brother Norge (2001)).  ",
        "Jason Wingreen was the uncredited voice of Boba Fett, a fact not confirmed until 2000. Wingreen had originally auditioned to voice Yoda. In a 2010 interview, Wingreen noted his lines were completed in only ten minutes. However, Wingreen complained he never received residuals for the role, even though audio of his voice was used for talking Boba Fett toys and collectibles. As a result, Wingreen noted he had no love for George Lucas.  ",
        "The space suit worn by the bounty hunter Bossk was previously used in The Tenth Planet, a Doctor Who serial.  ",
        "When Han Solo tricked Darth Vader by landing the Falcon on his ship, Vader's crewman says they couldn't have used a \"cloaking device\" since the ship was small. \"Cloaking device\" was a term invented on Jornada nas Estrelas (1966).  ",
        "When escaping the asteroid field a TIE fighter strikes an asteroid. As the asteroid travels down and to the right off screen, the pilot can be seen traveling down and to the left doing back flips as he travels off screen.  ",
        "For the Special Edition, Vader's \"Bring my shuttle\" line has been replaced with, \"Alert my Star Destroyer to prepare for my arrival.\" Sound designer Ben Burtt claimed this is actually a line performed by James Earl Jones that was recorded for use in Guerra nas Estrelas (1977), but never used; however, not only does the voice sound nothing like James Earl Jones, but the famous Imperial ships were NOT called Star Destroyers in the original film, but \"star cruisers\" -- even the novelization calls them such, so this one line would be an odd bit of discontinuity if Burtt's claims were true.  ",
        "Yaphet Kotto was offered the role of Lando Calrissian, but turned it down because he believed he would be killed off and it would be difficult for him to find work after that.  ",
        "According to the Dutch director Paul Verhoeven at a Q&A session in Helsinki, Finland during the 2012 Night Visions Film Festival, he was under consideration to direct The Empire Strikes Back, based on his work on his film -Soldier of Orange (1977)_. He was invited for a meeting with the producers and brought with him his newest film Sem Controle (1980), that he was proud of and wanted to screen for the producers. After the screening he never heard from them again and the film would eventually be directed by Irvin Kershner.  ",
        "The only Star Wars film not to gross $300 million domestically, not adjusting for inflation. When adjusting for inflation, it is actually the second highest grossing Star Wars film domestically with an adjusted gross of over $780 million as of 2014, and is the 12th highest grossing film of all time in North America.  ",
        "Eight R2-D2s were used in the making of O Império Contra-Ataca (1980). Kenny Baker used two that were lighter and more comfortable than the ones from Guerra nas Estrelas (1977). Three were dummy versions which could be damaged and another three were remote controlled.  ",
        "Gary Kurtz was initially reluctant for George Lucas to hand over the reins to another director. It was only because Lucas trusted Irvin Kershner, his former teacher at USC, that Kurtz agreed to the move.  ",
        "One of only two Star Wars films without English subtitles to translate alien languages, the other being Star Wars: Episódio III - A Vingança dos Sith (2005).  ",
        "The incident where R2-D2 accidentally electrocutes himself by mistaking a power outlet for a computer terminal was taken from the novelization for Guerra nas Estrelas (1977).  ",
        "A scene where Darth Vader's shuttle lands in his Star Destroyer's landing bay, after his light saber fight with Luke, was added to the Special Edition. This was actually an unused scene from O Retorno de Jedi (1983)  ",
        "Producer Gary Kurtz directed the scene in which Luke flees the Wampa ice cave. Kurtz took over John Barry's second unit duties after Barry died suddenly of meningitis in June 1979. Barry's replacement, Harley Cokeliss, was hired soon after.  ",
        "WILHELM SCREAM: Heard twice in the film. Once during the battle on Hoth as a rebel soldier and his laser gun dish explodes. And right before Han is going to frozen in the carbonite. As Chewie, in a fit of rage, throws a stormtrooper off the ledge (barely audible).  ",
        "Yoda was originally going to be called Minch Yoda.  ",
        "The voice-over line \"The first transport is away\" during the Rebel evacuation was re-recorded by Mark Hamill for the 1997 Special Edition release.  ",
        "A total of 16 sets of Luke's combat outfit (aka \"Bespin fatigues\") were made.  ",
        "Most of the rebel ground troops in the Hoth battle were Norwegian extras. Because they didn't speak any English, second unit director Peter MacDonald had to \"act out\" what he wanted them to do, by pointing in the direction of the \"enemy\" (which wasn't visible during shooting) and demonstrating the recoil motion he wanted for the blaster rifles.  ",
        "Further scenes with the Wampa were shot, and later cut. R2-D2 encountered one within the Rebel base, where it was killed by troopers. Later, the beasts were lured into a prison within the complex. In the completed film, a medical droid is seen examining the wounds of a tauntaun killed by a Wampa, and Princess Leia mentions the \"creatures\" while discussing the Imperial probe droid. A scene filmed but cut had Han, Leia and C-3PO running through a corridor. Han went to take a short-cut through a door with a sign on it, but Leia warned him \"that's where those creatures are kept\". They run off, but not before C-3PO rips off the sign, hoping that the stormtroopers will enter the room. They did. A few seconds of this last scene can be seen in the theatrical trailer on the DVD.  ",
        "Director Irvin Kershner provided the voice of Darth Vader himself in the temporary mix of the film, before James Earl Jones recorded the final version.  ",
        "Production difficulties meant that the film went over budget by more than $10 million.  ",
        "The sound of the snow swirling on Hoth was produced by recording surf sounds and then alternately increasing and decreasing the volume.  ",
        "Voted #1 on Empire magazine's top 301 movies of all time [July 2014]  ",
        "Harrison Ford was not expected to take part in the location filming in Norway which represented the scenes based on the ice planet of Hoth, so his costume was made for the stage and consequently not very well insulated. At the last minute, weather conditions were such that the schedule needed to be changed, and it was decided to shoot his scenes in Norway instead.  ",
        "The swamp creature that tries to swallow R2-D2 is never given a name in the film. It was eventually revealed, however, in the Super Star Wars: The Empire Strikes Back (1993) video game to be Hagobad (appropriately, an anagram of Dagobah, its home planet.)  ",
        "With the release of the Digital Movie Collection in 2015, the 20th Century Fox Fanfare was removed from this film and O Retorno de Jedi (1983). The ending of the track \"The Rebel Fleet/End Title\" from The Empire Strikes Back now plays over the Lucasfilm logo. Guerra nas Estrelas (1977) retained the fanfare, as 20th Century Fox owns permanent distribution rights to the film.  ",
        "Veteran screenwriter and frequent Howard Hawks collaborator Leigh Brackett succumbed to cancer shortly after completing her first draft of the script of the film. On the strength of two unsold scripts (O Guarda-Costas (1992) and Brincou com Fogo... Acabou Fisgado! (1981)) Steven Spielberg got novice author Lawrence Kasdan a twenty minute meeting with George Lucas, who engaged the young screenwriter to complete the script.  ",
        "The sounds of Luke dangling from a Cloud City weather vane were produced by the crew rattling a television antenna.  ",
        "Voted #8 in Total Film's 100 Greatest Movies Of All Time list (November 2005).  ",
        "Temuera Morrison who played Jango Fett in Star Wars: Episódio II - Ataque dos Clones (2002) re-dubbed Boba Fett's lines for the 2004 DVD.  ",
        "Part of the reason for creating Lando as a black character was that George Lucas had considered making Han Solo a black man early in his development of Guerra nas Estrelas (1977).  ",
        "The armored speeders parked at the rebel base on Hoth were built by Ogle Design Ltd. of Letchworth Heath, near London. ODL is known for manufacturing the famous/infamous three-wheeled Reliant sports car.  ",
        "The Cloud City of Bespin has an art deco design that was based on \"machine age\" designs from the 1920s-1930s.  ",
        "Originally, the scene where Han rescues Luke on Hoth was to have been filmed at Elstree Studios, and only Mark Hamill was needed on location in Norway. But when a blizzard made it impossible to film anywhere but near the hotel, Harrison Ford was summoned to Finse, anyway. Unable to travel by train, he arrived in the engine compartment of a snow clearance vehicle.  ",
        "Original start date of shooting at Elstree was slated to start in March 1979 but was delayed for three months because at that time, set 3 of the studio which was used for O Iluminado (1980) was burned down and had to be rebuilt at a higher scale  ",
        "John Hollis, who plays Lando Calrissian's aide, has a cybernetic device installed in place of his ears. Hollis would also go on to play one of Klytus's Observers in Flash Gordon (1980), who this time is fitted with a cybernetic electronic \"imager\" device in place of his eyes.  ",
        "O Império Contra-Ataca (1980) was the first film in the original trilogy to be released with an episode number, as the previous film had originally been known simply as Guerra nas Estrelas (1977) (until it was re-released after \"Empire\" in 1981, re-titled \"Episode IV: A New Hope.\")  ",
        "About twenty minutes into the movie there is a shot in the Hoth base control room in which we hear Han's voice over radio describing what's left of the probe droid. One of the background sound effects in this shot was taken from the Canadian shortwave time signal station CHU, which can be heard at 3.330 and 7.335 MHz.  ",
        "The blasters used by the stormtroopers were constructed from Sterling L2A3 Mk 4 submachine guns.  ",
        "Though TIE fighters are featured extensively throughout the film, there are no on screen appearances of TIE fighter pilots at all. Even though the figure of a TIE fighter pilot wasn't released until The Empire Strikes Back wave of figures.  ",
        "'Weird Al' Yankovic's \"Yoda,\" a parody of The Kinks \"Lola,\" was written after this movie was released but it wasn't released until his third album, 1985's \"Dare to Be Stupid,\" because of the difficulty of obtaining permission from both George Lucas and from Ray Davies, who wrote \"Lola.\"  ",
        "The opening 20th Century Fox fanfare music was specially re-recorded for the film by John Williams and the London Symphony Orchestra (unlike the first film, which used the original recorded version from 1954). George Lucas specifically requested the longer version of the fanfare for \"Star Wars\", which Fox used for its Cinemascope productions during the 1950s, even though it had been replaced by a shorter version by 1977.  ",
        "Jeremy Bulloch, who plays Boba Fett, is producer Robert Watts's half-brother.  ",
        "The only film in the original trilogy that doesn't begin with C-3PO and R2-D2's adventures.  ",
        "Wedge was not originally scripted to appear in this film, but intense fan interest prompted George Lucas to include him.  ",
        "Producer Gary Kurtz's wife Meredith organized a picnic on the Dagobah set for the wrap party on Friday, August 31 1979.  ",
        "O Império Contra-Ataca (1980) was released in the U.S. on May 21, 1980. This was in keeping with the original release date (May 25) of \"Star Wars\" in 1977, which was on the Wednesday before the Memorial Day weekend. \"Empire\" would be re-released on July 31, 1981 (following a re-release of \"Star Wars\" on April 10, 1981), and again on November 19, 1982 (following a re-release of \"Star Wars\" on August 13, 1982).  ",
        "Bruce Boa, who plays the rebel General Rieekan on Hoth, also played Mr. Hamilton, the loud American who orders a Waldorf salad in Fawlty Towers.  ",
        "A 1980 issue of the children's magazine National Geographic World featured an extensive behind the scenes look at the making of the film, and its special effects. The issue included a popular pull out poster of a still photo image showing the Millenium Falcon being chased down by a Star Destroyer.  ",
        "Irvin Kershner was very reluctant to make the film, because he felt he could never make it as anything other than \"the second one.\" His agent convinced him otherwise.  ",
        "On the New Zealand CBS/FOX videotape of the 1977 Ralph Bakshi film \"Wizards\", the trailer of this film proceeded \"Wizards\". In the late 1970s, the film's original title \"Wizards\" was changed to avoid confusion with \"Star Wars: Episode IV - A New Hope\" and George Lucas had recommended to Ralph Bakshi, the writer and director of \"Wizards\" that he use Mark Hamill (Luke Skywalker). Mark Hamill auditioned for Weehawk, which the part was given to Richard Romanus, but Bakshi cast Hamill as the voice of Sean.  ",
        "Included among the \"1001 Movies You Must See Before You Die\", edited by Steven Schneider.  ",
        "During the asteroid belt sequence, a pilot can briefly be seen bailing out in a parachute, after his TIE fighter is hit by an asteroid. In Star Wars: O Despertar da Força (2015), the fighter than Finn and Poe steal also has a parachute.  ",
        "In the ITV premiere of the film in the UK on Christmas Day 1988, some scenes were cut for time: Luke Skywalker stumbling and collapsing in the snow storm, following his escape from the Wampa cave. A Rebel commander ordering the shield doors of the Rebel base closed and R2D2 estimating Han and Luke's chances of survival. The Imperial fleet approaching Hoth, which instead cuts straight to the scene which Darth Vader force chokes Admiral Ozzel. Han and Chewbacca's reactions, after Han tells Luke to be careful, just before the Snowspeeder battle and the scene in the cave, which Han Solo tells Princess Leia to not get excited, when experiencing a quake, whilst in the Millennium Falcon.  ",
        "The two other scenes, which are the swamps of Dagobah, and the asteroid's creature (which has the Millenium Falcon), were done on the same sound stage used for the interior backgrounds of the Echo base in Hoth.  ",
        "OGLE-2005-BLG-390Lb is a real planet commonly referenced as Hoth by NASA scientists.  ",
        "According to Carrie Fisher, the carbon freezing chamber set was extremely hot - consequently, Peter Mayhew's Chewbacca costume began to stink.  ",
        "George Lucas envisioned the scene where the Millennium Falcon escapes from the giant space slug as a comedic scene, and was disappointed when audiences didn't react to it that way.  ",
        "In the film's novelization, Yoda is depicted as having blue skin.  ",
        "George Lucas has the head of a Stormtrooper and an R2-D2 in his office.  ",
        "Public Enemy titled their 1991 album \"Apocalypse 91...The Enemy Strikes Black.\"  ",
        "The film features three actors who have appeared in 007 - Somente Para Seus Olhos (1981); Jeremy Bulloch (Smithers), John Hollis (Bald man in wheelchair (unofficially Blofeld)), and Julian Glover (Kristatos). Bulloch reprised his role in 007 Contra Octopussy (1983).  ",
        "The only film in the original trilogy where a Death Star is not seen but the original one is mentioned in the opening crawl and by Ian McDiarmid's Palptaine/Lord Sidious.  ",
        "Palpatine/Darth Sidious only appears for roughly a minute in this film, making him a cameo appearance. In all other films, apart from Guerra nas Estrelas (1977) and Star Wars: O Despertar da Força (2015), he plays a larger role as the series main antagonist.  ",
        "\"There is no why\" is from a quote by Kurt Vonnegut, Jr.  ",
        "The Bespin twin-pod cloud car that intercepts the Millennium Falcon bears a resemblance to the American F-82 Twin Mustang fighter plane.  ",
        "The TIE Bomber (the small twin-fuselage ships shooting at the large asteroid that the Falcon is hiding in) is based on the World War II era German Blohm & Voss BV 141 reconnaissance bomber, which also has an asymmetric dual fuselage.  ",
        "When Luke is on Dagobah entering the cave of evil to fight Vader, an alien spiecies, known in the Star Wars universe as a \"Sleen\", can be seen crawling out of the hole Luke crawls into, this is in fact just a regular lizard, and the only real life animal to make it into all of the Star Wars movies.  ",
        "Mark Hamill got bit by a snake when they filmed the scene which Luke departs Degobah.  ",
        "Mark Hamill appeared on the BBC TV show Jim'll Fix It (1975), which a boy named Daniel visited the set of the film and met and spent the day with Mark Hamill. Mark Hamill, in character as Luke Skywalker got R2D2 to set up a picnic for him and Daniel on the Degobah set and Daniel and Mark (in character) got to know each other and asked Daniel what his favorite scenes from \"A New Hope\" and Hamill got R2D2 to show Daniel a clip from Star Wars: Episode V - The Empire Strike Back (1980) and after having the picnic and talking to each other, RD2D shown Daniel the way out of the Degobah set and in the program, Peter Mayhew appeared in character as Chewbacca and met Daniel and gave him his Jim'll Fix It badge.  ",
        "A boy named Daniel visited the Degobah set and met Mark Hamill and Mark Hamill in character as Luke Skywalker got RD2D (Kenny Baker) to set up a picnic for them and they talked to each other and RD2D showed Daniel a clip from the film and after the picnic, Mark Hamill got RD2D to show Daniel the way off the set.  ",
        "The Tauntauns were inspired by the two-legged horse-like creature rode by Necron 99/Peace in Wizards (1977).  ",
        "Joe Johnston: The director of later movies like Rocketeer (1991) and Jurassic Park III (2001), worked on visual/art effects for this movie. He has a cameo as a Rebel in Echo Base before the Rebels evacuate.  ",
        "Security surrounding this movie was so intense that George Lucas had regular reports about \"leaks\" from actors. George Lucas was so determined that the ending be kept secret that he had David Prowse (Darth Vader) say \"Obi-Wan killed your father\", and dubbed it later to be \"I am your father\". In fact, only five people eventually knew about the ending before the film's release: George Lucas (came up with the idea in his second draft, after the death of Leigh Brackett), director Irvin Kershner (informed of such during story conferences), writer Lawrence Kasdan (also informed during story and script conferences), Mark Hamill (informed shortly before the shooting of the infamous scene), and James Earl Jones (told during the recording sessions for the final dub, and who himself believed that Vader was lying).  ",
        "When Han Solo is about to be frozen, Princess Leia says, \"I love you.\" In the original script, Han Solo was supposed to say, \"Just remember that, Leia, because I'll be back,\" but at the time of filming, Harrison Ford wasn't entirely certain he did want to come back for a third film. There is a recurring legend that his line, \"I know\", was ad-libbed; however Alan Arnold's book \"Once Upon A Galaxy: A Journal of the Making of The Empire Strikes Back\" includes a transcription of the discussion between Ford and Irvin Kershner in which Ford suggested the line.  ",
        "David Prowse was unaware that Darth Vader was Luke's father until he saw the film and was quite upset with George Lucas afterwards, saying his physical acting would have been completely different if he'd known the real line.  ",
        "Having Han Solo frozen in carbonite was (at least in part) due to the fact that they were not sure that Harrison Ford would return for a third film. When the original Guerra nas Estrelas (1977) was made, Carrie Fisher and Mark Hamill were signed for a three picture deal, but Harrison Ford refused. Ford even requested George Lucas to kill off Solo, since the character had played his part already, but Lucas refused, saying that he still had a heroic part for Han Solo to play in O Retorno de Jedi (1983).  ",
        "In the original script, when Lando is about to lead Han, Leia, and Chewie into the trap set by Darth Vader, Lando offers his arm to Leia, as a gesture to lead her down the hallway and she accepts it. Harrison Ford ad-libbed Han coming up behind Leia and offering his arm to her at the exact same moment, to imply that Han was jealous.  ",
        "Leigh Brackett's first draft of the screenplay contained the revelation of Luke's sister, her existence disclosed by the ghost of Anakin Skywalker. Referred to as \"Nellith Skywalker\", Anakin explains that it was he, not Obi-Wan, who separated the twins at birth to protect them from Darth Vader, and that Nellith also underwent Jedi training in another part of the galaxy so she could join forces with Luke to defeat the Sith. This concept was dropped in the second draft of the screenplay, along with the appearance of Anakin Skywalker and replaced with a scene of Obi-Wan and Yoda discussing how they must find another Jedi apprentice in anticipation of Luke's failure. This too changed in later drafts, resulting in the more ambiguous scene in the final version where Yoda assures Obi-Wan that \"another\" exists.  ",
        "The film's most famous line is often misquoted. While many believe that Darth Vader says, \"Luke, I am your father.\" He actually says, \"No, I am your father.\" Even James Earl Jones, who provided the voice for Darth Vader, misquoted the line when referring to it on the Império dos Sonhos: A História da Trilogia Star Wars (2004) documentary.  ",
        "In Leigh Brackett's original draft of the script, Darth Vader was not Luke's father. The character of Anakin Skywalker actually appeared in the film as a Force spirit to train Luke. Anakin's characterization was later split into the characters of Yoda, and the Force spirit technique was used to allow Obi-Wan Kenobi to appear in the film.  ",
        "When Luke and Han say their goodbyes before the Battle of Hoth, it is the last time Harrison Ford and Mark Hamill are on screen together until they meet up in Jabba the Hutt's palace in O Retorno de Jedi (1983). There is one scene in Cloud City wherein Hamill shares a scene with a \"carbonized\" mannequin of Ford.  ",
        "Darth Vader's name comes from the following: \"Darth\" is a variation of the word \"Dark\" and \"Vader\" is the Dutch word for \"Father\".  ",
        "The movie's novelization was published a month before the movie was released, and not even the first editions attempted to cover up the revelation of Vader's claim to be Luke's father.  ",
        "James Earl Jones himself believed that Darth Vader was lying about being Luke's father until he read the script for the next film.  ",
        "During his battle with Vader, Luke's hand is severed and he loses his lightsaber (once used by Anakin/Vader and given to Luke by Obi-Wan). As part of the Expanded Universe, Luke's hand and lightsaber were recovered and kept by the Emperor as trophies. Later, the hand was used to create a clone of Luke that also wielded the lost saber. After the clone's death, Luke presented the lightsaber to Mara Jade, his future wife.  ",
        "The telepathic communication between Luke and Leia at the end (when Luke pleads for his rescue from the Cloud City) is the only hint that Luke and Leia share a special bond, something that is finally revealed in the next film.  ",
        "Unlike the other two films of the Original Trilogy Darth Vader does not appear until about 20 minutes into the film. In the other two films Vader first appears in less than 5 minutes after the start of the films.  ",
        "Bodycount: 67, the lowest in the saga.  ",
        "Harrison Ford wanted Han Solo to die at the end of the film, and he did not want to play the character again. But, instead of killing off the character, George Lucas had a different idea, and Lucas opted for Han Solo to be frozen in carbonite, and in case Harrison Ford had a change of heart, and agreed to return for the following film \"Star Wars: Episode VI - Return of the Jedi\", the character would be revived.  ",
        "Luke cuts off the Wampa's arm. C-3PO loses an arm when blasted by the Stormtroopers. Darth Vader cuts off Luke's hand.  ",
        "Only four people knew that Darth Vader was Luke Skywalker's father during production; George Lucas, Irvin Kershner, Mark Hamill, and Jame Earl Jones. To keep it a secret on set, David Prowse read script that instead of \"I am your father\", he said \"Obi-Wan killed your father.\"  ",
        "The sequence which Luke Skywalker engages Darth Vader in a lightsaber duel in the dark side cave was filmed in slow motion in order to make it dramatic and horrifying as it to show that Luke learns that he is not far from turning to the dark side himself.  ",
        "Episode V reverses Episode IV in order of characters from when they appear to how they behave. Han Solo arrived early in V and VII because he arrived late in Episode IV and VI. Also, Leia isn't a slave in this movie, but she was in the even numbered ones. Han Solo is captured at the end of Episode V since that's when Leia was rescued in Episode IV. Leia calls for help to Obi-Wan in Episode IV, but Obi-Wan tells Luke to see Yoda for help. Yoda is a reverse of Obi-Wan since he's also a mentor. Obi-Wan is tall, gray-haired, human and talks forwards. Yoda is short, furry green skinned and talks backwards. The final lightsaber duel is a stalemate since it's the middle of the trilogy. The final scene in V ends in tragedy with the characters away from the audience in a spaceship. Episode IV and VI end with the characters facing the audience on a planet in joy.  "
    ],
    "cameo": [
        "Joe Johnston: The director of later movies like Rocketeer (1991) and Jurassic Park III (2001), worked on visual/art effects for this movie. He has a cameo as a Rebel in Echo Base before the Rebels evacuate.  "
    ],
    "spoiler": [
        "Security surrounding this movie was so intense that George Lucas had regular reports about \"leaks\" from actors. George Lucas was so determined that the ending be kept secret that he had David Prowse (Darth Vader) say \"Obi-Wan killed your father\", and dubbed it later to be \"I am your father\". In fact, only five people eventually knew about the ending before the film's release: George Lucas (came up with the idea in his second draft, after the death of Leigh Brackett), director Irvin Kershner (informed of such during story conferences), writer Lawrence Kasdan (also informed during story and script conferences), Mark Hamill (informed shortly before the shooting of the infamous scene), and James Earl Jones (told during the recording sessions for the final dub, and who himself believed that Vader was lying).  ",
        "When Han Solo is about to be frozen, Princess Leia says, \"I love you.\" In the original script, Han Solo was supposed to say, \"Just remember that, Leia, because I'll be back,\" but at the time of filming, Harrison Ford wasn't entirely certain he did want to come back for a third film. There is a recurring legend that his line, \"I know\", was ad-libbed; however Alan Arnold's book \"Once Upon A Galaxy: A Journal of the Making of The Empire Strikes Back\" includes a transcription of the discussion between Ford and Irvin Kershner in which Ford suggested the line.  ",
        "David Prowse was unaware that Darth Vader was Luke's father until he saw the film and was quite upset with George Lucas afterwards, saying his physical acting would have been completely different if he'd known the real line.  ",
        "Having Han Solo frozen in carbonite was (at least in part) due to the fact that they were not sure that Harrison Ford would return for a third film. When the original Guerra nas Estrelas (1977) was made, Carrie Fisher and Mark Hamill were signed for a three picture deal, but Harrison Ford refused. Ford even requested George Lucas to kill off Solo, since the character had played his part already, but Lucas refused, saying that he still had a heroic part for Han Solo to play in O Retorno de Jedi (1983).  ",
        "In the original script, when Lando is about to lead Han, Leia, and Chewie into the trap set by Darth Vader, Lando offers his arm to Leia, as a gesture to lead her down the hallway and she accepts it. Harrison Ford ad-libbed Han coming up behind Leia and offering his arm to her at the exact same moment, to imply that Han was jealous.  ",
        "Leigh Brackett's first draft of the screenplay contained the revelation of Luke's sister, her existence disclosed by the ghost of Anakin Skywalker. Referred to as \"Nellith Skywalker\", Anakin explains that it was he, not Obi-Wan, who separated the twins at birth to protect them from Darth Vader, and that Nellith also underwent Jedi training in another part of the galaxy so she could join forces with Luke to defeat the Sith. This concept was dropped in the second draft of the screenplay, along with the appearance of Anakin Skywalker and replaced with a scene of Obi-Wan and Yoda discussing how they must find another Jedi apprentice in anticipation of Luke's failure. This too changed in later drafts, resulting in the more ambiguous scene in the final version where Yoda assures Obi-Wan that \"another\" exists.  ",
        "The film's most famous line is often misquoted. While many believe that Darth Vader says, \"Luke, I am your father.\" He actually says, \"No, I am your father.\" Even James Earl Jones, who provided the voice for Darth Vader, misquoted the line when referring to it on the Império dos Sonhos: A História da Trilogia Star Wars (2004) documentary.  ",
        "In Leigh Brackett's original draft of the script, Darth Vader was not Luke's father. The character of Anakin Skywalker actually appeared in the film as a Force spirit to train Luke. Anakin's characterization was later split into the characters of Yoda, and the Force spirit technique was used to allow Obi-Wan Kenobi to appear in the film.  ",
        "When Luke and Han say their goodbyes before the Battle of Hoth, it is the last time Harrison Ford and Mark Hamill are on screen together until they meet up in Jabba the Hutt's palace in O Retorno de Jedi (1983). There is one scene in Cloud City wherein Hamill shares a scene with a \"carbonized\" mannequin of Ford.  ",
        "Darth Vader's name comes from the following: \"Darth\" is a variation of the word \"Dark\" and \"Vader\" is the Dutch word for \"Father\".  ",
        "The movie's novelization was published a month before the movie was released, and not even the first editions attempted to cover up the revelation of Vader's claim to be Luke's father.  ",
        "James Earl Jones himself believed that Darth Vader was lying about being Luke's father until he read the script for the next film.  ",
        "During his battle with Vader, Luke's hand is severed and he loses his lightsaber (once used by Anakin/Vader and given to Luke by Obi-Wan). As part of the Expanded Universe, Luke's hand and lightsaber were recovered and kept by the Emperor as trophies. Later, the hand was used to create a clone of Luke that also wielded the lost saber. After the clone's death, Luke presented the lightsaber to Mara Jade, his future wife.  ",
        "The telepathic communication between Luke and Leia at the end (when Luke pleads for his rescue from the Cloud City) is the only hint that Luke and Leia share a special bond, something that is finally revealed in the next film.  ",
        "Unlike the other two films of the Original Trilogy Darth Vader does not appear until about 20 minutes into the film. In the other two films Vader first appears in less than 5 minutes after the start of the films.  ",
        "Bodycount: 67, the lowest in the saga.  ",
        "Harrison Ford wanted Han Solo to die at the end of the film, and he did not want to play the character again. But, instead of killing off the character, George Lucas had a different idea, and Lucas opted for Han Solo to be frozen in carbonite, and in case Harrison Ford had a change of heart, and agreed to return for the following film \"Star Wars: Episode VI - Return of the Jedi\", the character would be revived.  ",
        "Luke cuts off the Wampa's arm. C-3PO loses an arm when blasted by the Stormtroopers. Darth Vader cuts off Luke's hand.  ",
        "Only four people knew that Darth Vader was Luke Skywalker's father during production; George Lucas, Irvin Kershner, Mark Hamill, and Jame Earl Jones. To keep it a secret on set, David Prowse read script that instead of \"I am your father\", he said \"Obi-Wan killed your father.\"  ",
        "The sequence which Luke Skywalker engages Darth Vader in a lightsaber duel in the dark side cave was filmed in slow motion in order to make it dramatic and horrifying as it to show that Luke learns that he is not far from turning to the dark side himself.  ",
        "Episode V reverses Episode IV in order of characters from when they appear to how they behave. Han Solo arrived early in V and VII because he arrived late in Episode IV and VI. Also, Leia isn't a slave in this movie, but she was in the even numbered ones. Han Solo is captured at the end of Episode V since that's when Leia was rescued in Episode IV. Leia calls for help to Obi-Wan in Episode IV, but Obi-Wan tells Luke to see Yoda for help. Yoda is a reverse of Obi-Wan since he's also a mentor. Obi-Wan is tall, gray-haired, human and talks forwards. Yoda is short, furry green skinned and talks backwards. The final lightsaber duel is a stalemate since it's the middle of the trilogy. The final scene in V ends in tragedy with the characters away from the audience in a spaceship. Episode IV and VI end with the characters facing the audience on a planet in joy.  "
    ]
}