{
    "common": [
        "\nIn a real-life parallel to the film Fanboys (2009), Mark Hamill and John Boyega successfully lobbied director J.J. Abrams to allow Star Wars fan Daniel Fleetwood to see the film before official release, as Fleetwood had been diagnosed with terminal cancer, and was not expected to live to see the film's actual release date. Fleetwood was shown the film at a screening in his home, after Disney agreed. Fleetwood died 10 November, 2015.  ",
        "\nMark Hamill claimed George Lucas nonchalantly told him over lunch a new Star Wars trilogy was going to be made by Disney, and if he did not want to be involved, Luke Skywalker would simply be written out of the script. However, Hamill immediately agreed to reprise the role. Hamill admitted, however, that he pretended to also be nonchalant about it so it didn't seem like he was excited for the role. He also said within five seconds Carrie exclaimed she'd do it and asked if there was a part for her daughter.  ",
        "\nWhen Finn and Rey ask if he is THE Han Solo, the reply is \"I used to be...\" which is a reply Ford regularly uses when fans ask if he is Harrison Ford.  ",
        "\nThe lightsaber battles are choreographed to be distinctly different from the ones in the first and second trilogies. Rather than the flashy, Force-assisted moves in the prequels or the formalized, kendo-like movements of the original trilogy, the fights are staged to appear less rehearsed, and more brutal and realistic. According to John Boyega and others, this was a deliberate choice to reflect the characters' inexperience with lightsabers as a weapon. Kylo appears to have had little experience in formal dueling and both Finn and Rey pick up lightsabers and use them with no training at all.  ",
        "\nThe first J.J. Abrams film not to have a musical score by Michael Giacchino. Aptly enough, Giacchino stated in an interview that he would rather hear the music of John Williams in a new Star Wars film than his own. Giacchino's name shows up in Episode VII's credits as a Stormtrooper.  ",
        "\nJohn Boyega was so nervous and frightened at the prospect of not getting the role that he didn't tell his parents that he had been cast until after a cast photo was posted online by the official Star Wars twitter page.  ",
        "\nWhen the first trailer was released, there was much discussion about how it appeared to be getting back to the \"grubbiness\" (\"dirty transporters, second-hand rockets, things that broke\") of Episode IV, rather than the CGI cleanliness of Episodes I-III. British TV star Phill Jupitus revealed in an interview that he \"met an effects bloke in Essex, he drinks in my local coffee shop. He said [the makers of the new film] bought every gas-bottled air gun in England when they arrived because they wanted the Stormtroopers' guns to have a kick when they fired them. You don't have to fake it; it looks real.\"  ",
        "\nAfter he was cast, Oscar Isaac revealed to director J.J. Abrams that his uncle is a huge Star Wars fan. As a result, arrangements for Isaac's uncle to visit the film set were made. To the great surprise of both Isaac and his uncle, Abrams then asked if he would be interested in appearing in the film as an extra. Isaac's uncle quickly agreed and appears as one of the villagers during the opening sequence on Jakku.  ",
        "\nOnly time Harrison Ford has received top billing in a Star Wars film, making him the first non-Jedi character to be credited first.  ",
        "\nWhile filming in summer 2014, Harrison Ford broke his ankle on the door of the Millennium Falcon. About a year later, J.J. Abrams revealed that he hurt his back while trying to help get Ford out from under the door.  ",
        "\nKevin Smith and Benedict Cumberbatch visited the set. Smith, infamous for his open and talkative nature, was forced to sign a non-disclosure agreement, and J.J. Abrams had World War 2 style propaganda posters titled \"Loose Lips Sink Starships\" hung up around the set as a reminder to Smith not to reveal spoilers for the film to the public. True to his word, the only tidbit Smith revealed about his visit was that he cried when he stood on the Millennium Falcon set, as it reminded him of how much he loved Star Wars as a child.  ",
        "\nX-Wing Blue Squadron makes its debut in The Force Awakens. In the original Star Wars: Episode IV - A New Hope (1977), Luke Skywalker was originally supposed to fly with Blue Squadron, but the blue markings on the star fighters proved difficult to film against blue screens, so it was changed to Red Squadron.  ",
        "\nWhen he was interviewed about \"Star Wars: Episode VI - Return of the Jedi (1983)\" on TV-AM in the UK in 1983, Mark Hamill (Luke Skywalker) stated that George Lucas had considered bringing Mark Hamill back as Luke Skywalker as an Obi-wan Kenobi-like character passing Excalibur onto the next generation in Episode VII and that Episode VII would not be until 2011.  ",
        "\nMark Hamill rerecorded his monologue from Star Wars: Episode VI - Return of the Jedi (1983) (\"the Force is strong in my family\") to be used in the teaser trailer, but it was decided to mix his newly recorded lines with those originally recorded, as a reverberation, so as to subtly tease his reprisal of his role.  ",
        "\nJ.J. Abrams always wanted General Hux to be played by a young actor. He wanted the character to have a sense of tragedy and the fact that he appears to be too young to be in charge of a murderous group added to that. According to Abrams, the character's name was created after he noticed an old, abandoned grave site with the name Hux engraved on the stone.  ",
        "\nAlthough the movie (and the sale of Lucasfilm to Disney) was not announced to the public before November 2012, both Mark Hamill and Carrie Fisher said that they had discussed appearing in Episode VII and other future Star Wars films with George Lucas in the summer of 2012, months before the sale.  ",
        "\nIn summer 2013, it was revealed both Carrie Fisher and Mark Hamill had begun a vigorous regimen of diet, exercise and stunt training to prepare for their roles of Leia and Luke, respectively.  ",
        "\nThe symbols on the flags hanging outside Maz Kanata's castle include Boba Fett's Mythosaur skull, Ziro the Hutt's Black Sun tattoo, Hondo Ohnaka's pirate symbol and several Podracer's flags. There is also the symbol of the 501st Legion on one of the flags. The 501st is an international fan-based organization dedicated to the construction and wearing of screen-accurate replicas of Imperial Stormtrooper armor, Sith Lords, Clone Troopers, bounty hunters, and other villains from the Star Wars universe.  ",
        "\nAfter publicly declining to direct a new Star Wars film, J.J. Abrams was visited at his Bad Robot office by Kathleen Kennedy. Their negotiations lasted over a month, during which time, Abrams' central concern was the vast magnitude and cultural significance of the project.  ",
        "\nJohn Boyega originally played Finn in his natural English accent. But both he and J.J. Abrams felt it didn't feel right for the character. So Boyega changed to an American accent for the role.  ",
        "\nBecause of the secretive nature surrounding the film, several cast members found out that they had gotten parts in the film with very short notice. Domhnall Gleeson found out the day after he auditioned, which was only one day before the table read. Oscar Isaac found out only several hours before the table read, and was instructed to wait in a London hotel room to receive a call telling him whether he was to go downstairs and into a waiting car that would take him to the table read, or book a flight back to the United States.  ",
        "\nGeorge Lucas, while maintaining that he was at peace relinquishing his material, admitted to having mixed feelings before seeing the film, likening the experience to attending an ex-wife's wedding.  ",
        "\nWhen Finn bumps against the Dejarik (Chess) table, the game that appears is the same game played by Chewbacca and C3PO in Star Wars: Episode IV - A New Hope (1977). The small creature that was thrown to the ground by the considerably larger creature is seen getting back to its feet and then smashing his larger opponent with a mace-like weapon.  ",
        "\nAt one point, Han Solo refers to many of the iconic vocabulary from the Star Wars mythos as \"mumbo-jumbo\". This is the very same word the late Sir Alec Guinness so (in)famously used in interviews, when complaining about the dialogue he had been given for his role in Star Wars: Episode IV - A New Hope (1977).  ",
        "\nRey's outfit is inspired by early drawings from Star Wars concept artist Ralph McQuarrie for Luke Skywalker at a point when he and George Lucas were playing with the idea of making Luke a woman.  ",
        "\nJohn Williams received his 50th Oscar nomination for scoring this film.  ",
        "\nThe first Star Wars film to not have Kenny Baker cast as R2-D2. He is, however, credited as R2-D2 Consultant.  ",
        "\nDaisy Ridley and John Boyega were not allowed to tell anyone about being cast until about three months later. Boyega did, however, tell a taxi driver.  ",
        "\nHarrison Ford cried after seeing the film for the first time.  ",
        "\nBoth Brad Bird and Matthew Vaughn allegedly turned down the chance to direct. Bird had already committed to Tomorrowland (2015), forcing him to decline. Vaughn entered negotiations, even vacating the director's role on X-Men: Days of Future Past (2014) in order to helm Episode VII, but eventually declined over \"creative differences,\" reportedly disputes over the level of violence in the film and the casting of the female lead.  ",
        "\nIn a December 2015 New York Times interview, John Boyega was asked if his parents (who were both Nigerian immigrants to the UK) recognized the achievement represented by their son being a lead in a Star Wars movie, and Boyega responded, \"They're from a Nigerian culture that has no interest in spaceships and all that nonsense. My dad wants to see real-life stuff. He's a big Bruce Willis fan. But he's caught the Star Wars bug. Mum hasn't. She's just like, 'Where do you come in?'\"  ",
        "\nGary Oldman auditioned for the role that went to Max von Sydow. This is the second time he was considered for a part in a Star Wars film, as he was approached to voice General Grievous in Star Wars: Episode III - Revenge of the Sith (2005).  ",
        "\nIn an interview with Daisy Ridley during the press tour, she recounted her first day on set, where she nearly had a panic attack when her performance wasn't up to snuff. Ridley said about the first day on set, \"I was petrified. I thought I was gonna have a panic attack on the first day...J.J. Abrams ...he probably doesn't remember telling me that my performance was wooden. This was my first day! And I honestly wanted to die. I thought I was gonna cry, I couldn't breathe.\"  ",
        "\nBillie Lourd's (Carrie Fisher's daughter) film debut. She wears Princess Leia's buns.  ",
        "\nThe character of Maz Kanata was based on J.J. Abrams' former English teacher, Rose Gilbert, whose large glasses apparently also matched those of Maz. When beginning pre-production, it was revealed that production designer, Rick Carter also had Gilbert as a teacher and when coming up with the design of Maz, tried to contact Gilbert to let her know but sadly she had passed away at the age of 95.  ",
        "\nThe film had a budget of $245 million, which was the highest of a Star Wars film upon release.  ",
        "\nPoe Dameron (played by Oscar Isaac) is named after J.J. Abrams' former personal assistant, Morgan Dameron, and her daughter's stuffed polar bear named Poe. Morgan Dameron herself appears as Commodore Meta.  ",
        "\nBefore Adam Driver was cast as the villain, Michael Fassbender and Hugo Weaving were considered for the role.  ",
        "\nSimon Pegg said in an interview that while visiting the set with his daughter, she befriended the prop of the BB-8 droid that was remote controlled by crew members.  ",
        "\nThe uniform worn by General Hux (Domhnall Gleeson) is modeled after the uniforms worn by Nazis mixed with some naval influences.  ",
        "\nThis is the third movie in history to reach the $2 billion mark after Avatar (2009) and Titanic (1997).  ",
        "\nOn May 22, 2013, Conan O'Brien requested of J.J. Abrams to work the line \"Jub jub\" (first used by Conan as the name of Aunt Selma's pet iguana on The Simpsons (1989)) into the movie when Abrams was a guest on Conan's talk show. Abrams agreed, and the line \"Jub jub\" is said by Teedo as he moves away from Rey and BB-8 on his luggabeast.  ",
        "\nAlthough this is the second Star Wars film to be released in IMAX, it is the first to have IMAX cameras in use during filming.  ",
        "\nRey continues the tradition of disparaging the Millennium Falcon when she calls it \"garbage.\" In the original trilogy, Luke calls the Millennium Falcon a \"piece of junk\" and Leia refers to it as a \"bucket of bolts.\"  ",
        "\nRey is 19 years old and was born 11 years after the Battle of Endor.  ",
        "\nCreator George Lucas stated that the transition from Lucasfilm to Disney was a way to \"pass Star Wars on to a new generation of filmmakers.\"  ",
        "\nThe Millennium Falcon has a rectangular antenna. That's because it lost its original antenna in the Battle of Endor in Star Wars: Episode VI - Return of the Jedi (1983). J.J. Abrams rejected many different designs for the new radar dish before art director Kevin Jenkins came up with the idea to use the shape of the radar dish seen on the Blockade Runner in the original Star Wars: Episode IV - A New Hope (1977), a ship which design was originally created to be used as the Falcon.  ",
        "\nBB-8's design appears to have have been inspired by Ralph McQuarrie's original concept art for R2-D2, who also rolled around on a sphere-shaped bottom unit. Also, It was JJ Abrams idea to give BB-8 this name because he thought he looks like a \"B\" and an \"8\"  ",
        "\nElizabeth Olsen, Jennifer Lawrence and Shailene Woodley were considered for the role of Rey. Olsen refused the audition for the role because she already had a contract with \"Marvel Studios\" for the role of Scarlet Witch in the Avengers' franchise, and because the shoot dates for \"The Force Awakens\" overlapped with Avengers: Age of Ultron (2015). In April 2014, J.J. Abrams chose Daisy Ridley as Rey, to mimic the same type of selections made by George Lucas, with little known actors for the leading roles. In 1976, Lucas chose Carrie Fisher, Harrison Ford and Mark Hamill for their respective roles of Princess Leia, Han Solo and Luke Skywalker.  ",
        "\nPodracers from Star Wars: Episode I - The Phantom Menace (1999) can be seen in the background of several of the scenes that take place on Jakku.  ",
        "\nFinn's trooper name, FN-2187, refers to Princess Leia's cell in Star Wars, but also to the short film 21-87 (1964), an early influence on George Lucas. The montage film contains a reference to a \"Force\" that inspired Lucas's conception of The Force in the Star Wars universe.  ",
        "\nThe droid props in this film are produced by Lee Towersey and Oliver Steeples, who were members of the R2-D2 Builders Club. Their involvement began following Kathleen Kennedy coming across their work at Celebration Europe. They were subsequently contacted by executive producer Jason D. McGatlin, who contracted them into the creature effects team.  ",
        "\nCarrie Fisher and Ellen DeGeneres gave away tickets for the premiere show, dressed up as Princess Leia at the side of the road, stopping people as they were driving.  ",
        "\nThis film takes place 30 years after Star Wars: Episode VI - Return of the Jedi (1983). The film itself was released 32 years and 7 months after that film.  ",
        "\nThis sequel trilogy of Star Wars (Episodes: VII, VIII and IX) will introduce a new canon time line in Star Wars' saga with a new Expanded Universe called \"New Universe,\" with new stories in the books, comics, games, etc. The former Expanded Universe is still recognized from Lucasfilm, but it was moved from the original canonical events in an \"alternative time line\" known with the name \"Legend Universe.\" The official Star Wars' timeline is now composed of: Prequel trilogy (Episodes: I, II, III), Star Wars: The Clone Wars (2008), Star Wars Rebels (2014), Original trilogy (Episodes: IV, V, VI), and Sequel trilogy (Episodes: VII, VIII, IX). EA's Star Wars: Battlefront (2015) is not officially canon, as it features a gameplay in which characters can appear as Darth Vader and Luke Skywalker in his fully black outfit* from Return of the Jedi (1983), on Hoth, neither of which truly happen in the canon timeline. However, Darth Vader did appear on Hoth in Episode V.   * Luke's outfit has been fixed in an early 2016 update to match the clothing on hoth in The Empire Strikes Back  ",
        "\nThe new version of the X-Wing includes an element that Ralph McQuarrie and Joe Johnston originally designed for Star Wars: Episode IV - A New Hope (1977), but it was never used. Specifically, the circular engines that split into two half circles. The classic trilogy design had two cylinders on each side. A new aspect that has been added for The Force Awakens is that the wings themselves split vertically as well as horizontally, with the front of the wing pushing down and the back half up.  ",
        "\nDuring production, the working title was \"Shadow of the Empire.\"  ",
        "\nBy signing on to direct this film, J.J. Abrams became the first director to direct a Star Trek (2009) film and a Star Wars film.  ",
        "\nLuke Skywalker was meant to have a much larger role in the film, but his role was trimmed back out of fear that he would take attention away from the new characters.  ",
        "\nIn an interview for Entertainment Weekly, J.J. Abrams revealed more about Maz Kanata's backstory than is communicated in the movie: \"Her history is that she was a pirate for a long time. She's lived over a thousand years. She's had this watering hole for about a century, and it's like another bar that you'd find in a corner of the Star Wars universe.\"  ",
        "\nPanavision provided two customized, black-painted Millennium XL2 cameras specifically for the production. The \"A\" camera was nicknamed the \"Death Star,\" and the \"B\" camera, the \"Millennium Falcon.\"  ",
        "\nAfter being released, the second teaser trailer reached more than 20 million views on YouTube in less than 24 hours.  ",
        "\nLando Calrissian's co-pilot from Star Wars: Episode VI - Return of the Jedi (1983), Nien Nunb, makes an appearance as a Resistance fighter, along with the puppeteer who originally controlled the character, Mike Quinn.  ",
        "\nKylo Ren's lightsaber blade is the first whose energy blade is always shaking or crackling. It indicates the Kylo Ren's violent behavior and his feelings impregnated by the Dark Side of The Force. Also, in the Blu-ray extras it is told that his weapon is not yet finished.  ",
        "\nAccording to Star Wars The Force Awakens: The Visual Dictionary, Captain Phasma's chrome armor comes from a melted-down Naboo spacecraft.  ",
        "\nAs BB-8 flees the massacre of the Jakku village near the beginning of the film, a very obvious puppet alien pops its head out of the sand to look at him. According to J.J. Abrams, everyone knew how bad it looked but decided to keep it in anyway because they thought it was cute.The puppet alien also says \"ko ji ma\" as a reference to video game director, Hideo Kojima, the creator of the Metal Gear Solid video game series.  ",
        "\nJoel Edgerton was considered for the role of Poe Dameron, even though he had already appeared in the franchise as Luke's uncle, Owen Lars, in the prequels.  ",
        "\nKylo Ren originally would have been a dark Jedi called the Jedi Killer, who was more akin to Darth Vader and would power up by directly absorbing the energy of a star. At one point he was even going to be a straight up Vader impersonator, wearing a exact copy of his suit in order to mess with Luke.  ",
        "\nDuring a scene as Finn and Rey return to Jakku, she mentions a place called Liwa Outpost. It is a nod to the Liwa Desert where the planet Jakku is filmed in Abu Dhabi, United Arab Emirates.  ",
        "\nLike all six prior films, the phrase \"I have a bad feeling about this\" or similar is spoken, this time by Han Solo when the Rathtars are set loose. In release order, the line was also spoken by Luke Skywalker (\"I have a very bad feeling about this\") and Han (\"I got a bad feeling about this\") in Star Wars: Episode IV - A New Hope (1977), Leia in Star Wars: Episode V - The Empire Strikes Back (1980), C-3PO and Han (\"I have a really bad feeling about this\") in Star Wars: Episode VI - Return of the Jedi (1983), Obi-Wan Kenobi in Star Wars: Episode I - The Phantom Menace (1999), Anakin Skywalker in Star Wars: Episode II - Attack of the Clones (2002), and Obi-Wan in Star Wars: Episode III - Revenge of the Sith (2005).  ",
        "\nThis film had already accumulated enough IMDB user ratings (minimum 25,000) to be included in the Top 250 (coming in at #47), before the film could even be shown to the general U.S. audience starting at 7pm ET on December 17, 2015.  ",
        "\nThe quote from the trailer, \"The Force is strong in my family. I have it... My father has it... My sister has it... You have that power too,\" was originally from Star Wars: Episode VI - Return of the Jedi (1983). It has been modified slightly, with Luke originally saying, \"You have that power too,\" to his sister, Leia, just before saying, \"The Force is strong in my family.\"  ",
        "\nParts of Poe's backstory, namely him hailing from Yavin, were suggested by Oscar Isaac and then incorporated into the official canon.  ",
        "\nSimon Pegg is one of three actors to appear in both a Star Wars and Star Trek film, after actor Deep Roy. George Takei appeared in Star Trek films, but only appeared in Star Wars: The Clone Wars (2008). Also among this list is Greg Grunberg.  ",
        "\nHarrison Ford grew his hair out to play the older Han Solo.  ",
        "\nAs of November 19, 2015, the film already made $50 million just through advance ticket sales. This is double the amount that The Hunger Games (2012) received, which previously held the top spot for most money made from advance ticket sales.  ",
        "\nAt the start of her vision, Rey finds herself standing in a Cloud City corridor. In the novelization based on the original shooting script, she sees Luke and Vader duel during Star Wars: Episode V - The Empire Strikes Back (1980) but does not recognize them.  ",
        "\nThis film takes place approximately 66 years after the events of Star Wars: Episode I - The Phantom Menace (1999). \"The Phantom Menace\" took place 10 years before Star Wars: Episode II - Attack of the Clones (2002), Star Wars: Episode III - Revenge of the Sith (2005) started 3 years after that, and Star Wars: Episode IV - A New Hope (1977) takes place 19 years after \"Revenge of the Sith.\" There is a three-year gap between \"A New Hope\" and Star Wars: Episode V - The Empire Strikes Back (1980) and one year between \"Empire\" and Star Wars: Episode VI - Return of the Jedi (1983). \"The Force Awakens\" takes place 30 years after \"Return of the Jedi (and 34 years after \"A New Hope\").\"  ",
        "\nThis was the first live-action Star Wars movie to be released in December. All previous ones had been released in May.  ",
        "\nDirectors that discussed to helm the film included: Matthew Vaughn, Steven Spielberg, Guillermo del Toro, Peter Jackson, Christopher Nolan, Ben Affleck, Joss Whedon, Brad Bird, Rian Johnson and James Cameron, before J.J. Abrams was eventually selected. Johnson was later announced to write and direct Star Wars: The Last Jedi (2017) and write a treatment for Star Wars: Episode IX (2019).  ",
        "\nDaisy Ridley cried the first time she watched the trailer. She captured a video of the reaction, and posted it on her Instagram account.  ",
        "\nThe second trailer for the new movie was released during the opening panel for Star Wars Celebration VII (aka Star Wars Celebration Anaheim). Fans went crazy over it, and, as described by others, broke at that last line in the trailer. The last scene shows Han Solo and Chewbacca apparently entering the cockpit of the Millennium Falcon after a long absence. Han then says, \"Chewie, we're home.\"  ",
        "\nDuring the infiltration of Starkiller Base, a stormtrooper can be heard saying, \"We think they may be splitting up,\" on his comm system. The same line was spoken during the escape from the Death Star, when Ben Kenobi is sneaking through the station corridors.  ",
        "\nSeven different BB-8 units were used in the making of the film.  ",
        "\nIn an interview with Entertainment Weekly, J.J. Abrams explained that the ash pile that Kylo Ren places his helmet in while interrogating Rey is meant to be the ashes of his enemies that Ren has killed.  ",
        "\nJ.J. Abrams revealed in an interview published in Entertainment Weekly that he came up with the name of the Captain Phasma character after seeing its chrome design: \"It reminded me of the ball in Phantasm (1979).\"  ",
        "\nThe lightsaber props used during production are different to the ones used in the previous movies. They now have specially designed blades that light up when activated, which now allows light reflections on the surrounding area.  ",
        "\nMark Hamil reportedly received $1million for his role. Total screen time was less than a minute & he did not speak a single word.  ",
        "\nBoth J.J. Abrams and Harrison Ford started their acting careers with roles as delivery/messenger boys. Abrams' first appearance was 25 years after Ford's, but it was in Regarding Henry (1991), making a delivery to Harrison Ford's character.  ",
        "\nGeorge Lucas was initially opposed to anyone else making Star Wars movies after he did and he was personally divided on whether or not he wanted to make another trilogy. When Disney acquired Lucasfilm, they got Lucas' story treatments for Episodes VII, VIII, and IX, however, the new writing team chose not to use them. However, when he attended the film's red carpet premiere, he said he liked the film, and even received a standing ovation from the audience (despite having nothing to do with the film).  A couple of weeks later, however, Lucas seemed to change his tune, and criticized the film for being too 'retro', and compared Disney to \"white slavers\". Lucas quickly took back his comments.  ",
        "\nThis movie marks the first time in Star Wars history where a Storm Trooper uses a melee weapon on screen.  ",
        "\nThe large arch seen on the planet Jakku is a design by Ralph McQuarrie that first appeared in the 1995 book \"The Illustrated Star Wars Universe.\" It was originally pictured as part of Jabba the Hutt's palace on Tatooine, and it also appeared as part of the Teth monastery in Star Wars: The Clone Wars (2008).  ",
        "\nAnakin Skywalker's blue-bladed lightsaber is the only lightsaber to be seen in all three Star Wars trilogies, to this point.  ",
        "\nChewbacca's first meeting with BB-8 mirrors his interaction with the mouse droid in Star Wars: Episode IV - A New Hope (1977).  ",
        "\nJoonas Suotamo, credited as \"Chewbacca double,\" had no previous acting experience. He is a professional basketball player who played for Penn State from 2005 to 2008, and graduated a year early with a degree in Film and Video. The 6'10\" power forward has since appeared in the Finnish national team (nicknamed Wolfpack), and during the 2015-16 season, his team is Espoo Basket Team of the Finnish league Korisliiga. With his height listed as 209 cm, Suotamo is a good 4 inches shorter than Peter Mayhew.  ",
        "\nThe film was released 32 years after Star Wars: Episode VI - Return of the Jedi (1983), 10 years after Star Wars: Episode III - Revenge of the Sith (2005) and 16 years after Star Wars: Episode I - The Phantom Menace (1999).  ",
        "\nJ.J. Abrams came up with the name BB-8 based on the droid's resemblance to both the number 8 and a capital B.  ",
        "\nIn an interview with Daisy Ridley during the press tour, she mentions how she has not seen the film (at the time) but states Steven Spielberg had already seen the film three times. Ridley stated about the matter, \"I haven't seen the film yet. I kinda want to, and I kinda don't. Steven Spielberg has seen it three times, as he told me when I met him!\"  ",
        "\nPre-sale movie ticket selling websites reportedly crashed after starting ticket sales.  ",
        "\nIt was originally rumored that Episode VII and the following installments would follow Ben Skywalker, son of Luke Skywalker and Mara Jade, and the expanded universe would officially be a part of the Star Wars canon. The rumor was proven false, when it was announced that Episode VII would disregard the expanded universe.  ",
        "\nThe possibility of Hayden Christensen reprising his role as Anakin Skywalker/Darth Vader was considered during pre-production. Art conceptions were created before the script was finished. It is also rumored he might also reprise the role in future Star Wars films or in the anthology film Rogue One (2016).  ",
        "\nIn October 2013, cinematographer Dan Mindel announced that, unlike the prequel trilogy, he and J.J. Abrams would shoot primarily on 35mm film to more closely match the visual aesthetic of the original trilogy. Initially, Mindel had hoped to use IMAX 65mm film for most of the feature, but later said they opted for 35mm due to the cumbersome weight and noise problems with IMAX cameras. Ultimately, only one five-minute sequence (Rey and Finn's escape from Jakku in the Millennium Falcon) was shot in IMAX 65mm.  ",
        "\nAccording to the \"Star Wars: The Force Awakens Visual Dictionary,\" the helmet Rey wears belonged to an X-wing pilot named Captain Dosmit Ræh, who flew for the Tierfon Yellow Aces.  ",
        "\nMark Hamill was the same age, filming Episode VII, as Alec Guinness was filming Star Wars: Episode IV - A New Hope (1977). (63 yrs old)  ",
        "\nFirst (and to date, the only) Star Wars movie in which the planet Tatooine is neither seen on screen nor mentioned. It appeared in all other prior films sans Star Wars: Episode V - The Empire Strikes Back (1980), but was mentioned by name there.  ",
        "\nThe Stormtrooper who attacks Finn with a big electric Z6 baton on Takodana yells, \"Traitor!\" when he sees Finn. He was quickly nicknamed TR-8R by fans, which spells \"Traitor,\" but Starwars.com reveals his actual name to be FN-2199, nicknamed \"Nines.\" Writer Greg Rucka gives more background about FN-2187 and Nines' training in a short story published in the book \"Before the Awakening.\"  ",
        "\nThe original Italian release of \"Star Wars: Episode VII - The Force Awakens\" in Italian cinemas was planned for January 6, 2016 (3 weeks after the international release, last country in the world). \"Walt Disney Pictures Italia\" had decided to release the new Star Wars film after Pixar's movie The Good Dinosaur (2015) planned for the Italian cinemas for December 18, 2015. After this decision, Star Wars' Italian fandom made a petition with over 5,000 signatures to Disney Italia's staff and asked to move the date of release in their country. On April 7, 2015, Walt Disney Pictures Italia decided to change the date of the two movies: \"The Good Dinosaur\" moved to a November 25, 2015 release, and \"Star Wars: Episode VII - The Force Awakens\" two days before the international release, on December 16, 2015.  ",
        "\nInstead of the desert world of Jakku, Rey would have lived on an ocean planet where part of the Second Death Star crashed and is now partially submerged. Part of the plot would have involved her diving into the depths of the underwater wreckage to find a map of the locations of the remaining Jedi, and we would have even seen the Millennium Falcon going underwater.  ",
        "\nThe second Star Wars film to be rated PG-13, the first being Star Wars: Episode III - Revenge of the Sith (2005).  ",
        "\nMax von Sydow was the basis of the look of Governor Pre Vizla in Star Wars: The Clone Wars (2008).  ",
        "\nAhead of the recording of the score, composer/conductor John Williams invited Gustavo Dudamel, the Music Director of the Los Angeles Philharmonic and Simón Bolivar Youth Orchestra in Venezuela, to conduct the Main Title and End Credits. Dudamel and the L.A. Phil had presented a tribute to John Williams, at the start of their 2015-2016 season in their home venue of the Disney Concert Hall in Los Angeles. The Dudamel \"takes,\" reportedly, are the ones used in the film. According to Dudamel in a Facebook post, his appearance at the sessions took everybody by surprise, including Disney and the sessions musicians, as Williams had only told George Lucas.  ",
        "\nMax von Sydow is the eighth Academy Award nominated actor who has starred in at least one Star Wars movie. The first actor is James Earl Jones, second is Alec Guinness, third is Harrison Ford, fourth is Liam Neeson, the fifth is Samuel L. Jackson, the sixth is Natalie Portman, and the seventh is Lupita Nyong'o. Of those, only Guinness, Portman, and Nyong'o are Oscar winners (as of 2015).  ",
        "\nThe hairstyle of Billie Lourd's character is clearly a homage to her mother Carrie Fisher's famous Princess Leia buns from Star Wars: Episode IV - A New Hope (1977).  ",
        "\nAll three new key characters Rey, Finn, and Kylo, are all first introduced wearing either a mask, garb, or helmet shielding their faces.  ",
        "\nAllegedly, Adam Driver did not break character throughout the shoot. He even kept the mask on while the cameras were not rolling.  ",
        "\nSupreme Leader Snoke was originally going to be a female character.  ",
        "\nThis is the first American feature film for actress Daisy Ridley.  ",
        "\nChloë Grace Moretz, Saoirse Ronan, Zac Efron, Miles Teller, Michael B. Jordan, Alex Pettyfer, Sullivan Stapleton and Jack O'Connell were rumored to have auditioned for a role, while Chiwetel Ejiofor, Benedict Cumberbatch and Gary Oldman were rumored for different roles.  ",
        "\nMichael Arndt was originally hired as the screenwriter but left the production months later and was replaced by J.J. Abrams and Lawrence Kasdan.  ",
        "\nOscar Isaac was nearly forced to drop out of the film due to scheduling conflicts with theater commitments.  ",
        "\nSteven Spielberg enjoyed the film so much he saw it four times.  ",
        "\nMaz Kanata was originally supposed to accompany the heroes back to the Resistance base, which is why there is a scene in the trailer, which was cut from the film, showing her giving Anakin's lightsaber to Leia. Lupita Nyong'o filmed her scenes at the base, but they were cut after being deemed unnecessary.  ",
        "\nThis film was not filmed in native 3D. It was converted in stereoscopic 3D in post production.  ",
        "\nLike the creator of Star Wars, George Lucas, director J.J. Abrams has worked with Harrison Ford before. Ford appeared in Regarding Henry (1991), which was written by Abrams, who also appears briefly in the film as a delivery boy. Abrams also produced Morning Glory (2010), co-starring Ford. Ford also acted in the second feature film by George Lucas, American Graffiti (1973).  ",
        "\nThis film marks the first time in the franchise that the episode number matches the film's order of release. It is Episode VII, and the seventh film released.  ",
        "\nLee Pace auditioned for the role of Kylo Ren that went to Adam Driver.  ",
        "\nMax von Sydow played Emperor Ming the Merciless in the film Flash Gordon (1980). The Flash Gordon comic strip and Saturday morning serials were one of George Lucas' influences behind the \"Star Wars\" franchise.  ",
        "\nHarrison Ford was paid $25,000,000 for his appearance in the film. This is in stark contrast to the $10,000 he received for the first Star Wars film Star Wars: Episode IV - A New Hope (1977).  ",
        "\nStar Wars: The Force Awakens set the following U.S. box office records:-Highest Gross ($934 million).-Fastest to Become Highest-Grossing Film (20 Days).-Highest Thursday Preview Gross ($57 million).-Highest Opening Day Gross ($119 million).-Highest Opening Weekend Gross ($247 million).-Highest Opening Weekend Per Theater Average ($59,000).-Widest December Opening (4,134 theaters).-Highest IMAX Opening Weekend Gross ($30 million).-Highest Second Weekend Gross ($149 million).-Highest Third Weekend Gross ($90 million).-Fastest to $100 million (1 Day).-Fastest to $150 million (2 Days).-Fastest to $200 million (3 Days).-Fastest to $250 million (4 Days).-Fastest to $300 million (5 Days).-Fastest to $350 million (6 Days).-Fastest to $400 million (8 Days).-Fastest to $450 million (9 Days).-Fastest to $500 million (10 Days).-Fastest to $550 million (11 Days).-Fastest to $600 million (12 Days).-Fastest to $650 million (14 Days).-Fastest to $700 million (16 Days).-Fastest to $750 million (18 Days).-Fastest to $800 million (23 Days).-Fastest to $850 million (31 Days).-Fastest to $900 million (50 Days).-Highest 3-Day Gross ($247 million).-Highest 4-Day Gross ($288 million).-Highest 5-Day Gross ($325 million).-Highest 6-Day Gross ($363 million).-Highest 7-Day Gross ($390 million).-Highest 8-Day Gross ($440 million).-Highest 9-Day Gross ($496 million).-Highest 10-Day Gross ($540 million).-Highest Friday Gross ($119 million).-Highest Sunday Gross ($60 million).-Highest Monday Gross ($40 million).-Highest Tuesday Gross ($37 million).-Highest Opening Week Gross ($390 million).Additionally, it set the following worldwide records:-Highest Opening Weekend Gross ($528 million).-Highest IMAX Opening Weekend Gross ($48 million).-Fastest to $1 billion (12 Days).  ",
        "\nCaptain Phasma was originally going to be a man, and J.J. Abrams was allegedly looking at Benedict Cumberbatch (whom he had worked with on Star Trek Into Darkness (2013)) for the role. However, after the film drew some complaints about the lack of women in the cast, the decision was made to make Phasma into a woman, thus marking her character the first pivotal female member of the Imperial Stormtroopers in an official, live action Star Wars film.  ",
        "\nFrom May to August of 2014, Disney and Lucasfilm collaborated with UNICEF for a charity campaign called \"Force for Change.\" After raising over $4 million, the winner was announced to be independent filmmaker D.C. Barns.  ",
        "\nIn their original incarnations, Finn would have been white and Poe would have been black.  ",
        "\nIn the scene where Rey, Finn, Han, and Maz eat and talk in the cantina, a bowl of exotic alien fruit can be seen on the table they sit at. One of the alien fruits is really a kiwano melon. Orange and yellow in color and covered in spikes, the fruit is actually native to central and south Africa and can be found in some grocery stores.  ",
        "\nThe original run time of the movie was two hours and 40 minutes long before being cut down to two hours and 16 minutes, with some of the cut scenes remaining in the film until only a month before release.  ",
        "\nThis is not the first film where Mark Hamill and Carrie Fisher have appeared in together since Star Wars: Episode VI - Return of the Jedi (1983). They also appeared in Jay and Silent Bob Strike Back (2001).  ",
        "\nDespite being two of the main characters of the new trilogy, Rey and Poe never interact with each other onscreen throughout the entire first film.  ",
        "\nWith this film, Walt Disney Pictures becomes the third studio to release a Star Wars film. The original six movies were released by 20th Century Fox and Star Wars: The Clone Wars (2008) was released by Warner Bros.  ",
        "\nThe character of General Hux drapes his black leather military coat over his shoulders, resembling that of gestapo commander Major Arnold Toht in Raiders of the Lost Ark (1981). Further comparisons can be drawn when the First Order rallies to Hux's speech at Starkiller Base resembling similar striking images of Adolf Hitler and the Third Reich gathering in Triumph of the Will (1935).  ",
        "\nOriginally, what would have convinced Finn to leave the First Order would be witnessing a number of Resistance fighters being executed and thrown out of airlock. After escaping with Poe and crash landing, he would be healed by tribe a locals and be \"reborn\" into a hero.  ",
        "\nInitially the idea was just to use Anthony Daniels' voice for C3PO but the actor insisted on wearing the costume again. A new lightweight suit was designed specifically for him.  ",
        "\nHarriet Walter (Dr. Kalonia) is the niece of Christopher Lee, who played Count Dooku in Star Wars: Episode II - Attack of the Clones (2002), Star Wars: Episode III - Revenge of the Sith (2005) and Star Wars: The Clone Wars (2008).  ",
        "\nFirst J.J. Abrams film not released by Paramount Pictures.  ",
        "\nRadiohead's producer, Nigel Godrich, makes a cameo as stormtrooper FN-9330, and composer Michael Giacchino, who has composed music for many of J.J. Abrams projects, plays stormtrooper FN-3181.  ",
        "\nThere are eight actors from HBO hit show Game of Thrones (2011) who appear in this movie: Gwendoline Christie as Captain Phasma, Max von Sydow as Lor San Tekka, Thomas Brodie-Sangster as a First Order Officer, Jessica Henwick as Jess Testor, Mark Stanley as Knight of Ren, Miltos Yerolemou as a Bar Patron, Emun Elliott as Brance and Hannah John-Kamen as a First Order Officer.  ",
        "\nBritish actor Denis Lawson, who portrayed X-wing pilot Wedge Antilles in the original Star Wars trilogy, has confirmed that he turned down an invite from Disney to reprise his role in the new installments. Lawson told British press, \"I'm not going to do that. They asked me but it just would have bored me.\"  ",
        "\nThe filming process was constantly at the mercy of paparazzi and industry spies. Drones would frequently fly over the locations.  ",
        "\nJames McAvoy and Chiwetel Ejiofor were considered for the part of Poe Dameron.  ",
        "\nThe Rebel base was shot in Greenham Common which was home to the 501st Tactical Missile Wing of USAF, they maintained 96 nuclear missiles. The 501st is also the name of the fan group of star wars enthusiasts.  ",
        "\nIt was revealed on 8 September 2015 that the UK release date was to be brought forward a day and that the UK would see it before the U.S.  ",
        "\nReleased 38 years after the very first film Star Wars: Episode IV - A New Hope (1977) in 1977, and released 32 years after Star Wars: Episode VI - Return of the Jedi (1983), the same relative time frame in which the movie is set.  ",
        "\nWhen Kylo Ren insists that Rey's lightsaber belongs to him, he actually does have a measure of legitimate claim to it. Kylo's grandfather was Darth Vader (Anakin Skywalker), who had that lightsaber before losing it to Obi-Wan Kenobi on Mustafar; who then gave it to Anakin's son Luke.  ",
        "\nAll Star Wars: Episode VII - The Force Awakens products were released 4 September 2015, known as \"Force Friday.\"  ",
        "\nOscar Isaac and Domhnall Gleeson also appeared together in the Sci-Fi thriller Ex Machina (2014).  ",
        "\nThe werewolf-like creature that the camera follows as it enters Maz Kanata's castle is a Hassk. It is based in part on Ralph McQuarrie's concept art for Chewbacca, as well as a creature seen in his Cantina concept art. There are two more Hassks in The Force Awakens. All three can be glimpsed outside Maz's castle when the inhabitants come out to watch the Starkiller beam.  ",
        "\nIn July 2014, it was rumored that Irish WWE wrestling superstar Stephen Farrelly would portray Darth Vader. Sheamus had previously portrayed Vader in Star Wars promotional tours and hinted that he may very well be portraying Vader again, even though the character died in Star Wars: Episode VI - Return of the Jedi (1983).  ",
        "\nChronologically, this is the first time in the Star Wars movie timeline since Star Wars: Episode III - Revenge of the Sith (2005) that the word \"Sith\" is actually used. This term, used to describe Lords of the Dark Side of the Force, was never mentioned in the original trilogy; when Maz Kanata references it, this is the first time they are recognised as an evil entity to the protagonists of the original trilogy. Before this moment in the movie, Han even refers to 'The Dark Side' without using 'Sith' supporting the continuity of the term not being familiar to Original Trilogy characters.  ",
        "\nThe Resistance was originally going to have a massive warship called the \"Warhammer\", which would use its heavily armored prow to breach planetary shields and then deploy smaller ships to exploit the hole.  ",
        "\nIn the months following the release of the film, Erik Bauersfeld, who voiced Admiral Ackbar in Star Wars: Episode VI - Return of the Jedi (1983) as well as this film, passed away in April 2016 at the age of 93. Four months later, in August 2016, Kenny Baker, who operated R2-D2 for the first six films of the series while serving as a consultant for this one, passed away at the age of 81.  ",
        "\nThe First Order Snowtroopers wear outfits similar to Ralph McQuarrie's for Imperial Snowtroopers. The insignia on their chest armour is the same as the one used on helmets in concept art for Star Wars: Episode V - The Empire Strikes Back (1980).  ",
        "\nThis is the first movie where Han Solo appears using Chewbacca's bowcaster.  ",
        "\nWhile a guest on The Tonight Show Starring Jimmy Fallon (2014), J.J. Abrams told Jimmy Fallon that while most of the score was written by John Williams, Williams preferred not to write the music for the scene in Maz Kanata's tavern. Abrams himself started composing a piece of music for that scene, but when he attended the musical \"Hamilton\" and met its composer, Lin-Manuel Miranda, he jokingly suggested that he would love to write music for a new cantina scene. Abrams contacted him later and took him up on the offer.  ",
        "\nThe \"Starkiller,\" the weapon that the First Order built, shares its name with a character from the Star Wars Expanded Universe, Starkiller, who was a kid trained by Darth Vader himself. Starkiller was also the original last name George Lucas considered for Luke, but settled on Skywalker instead.  ",
        "\nCarrie Fisher lost 35 pounds to get back in shape as Princess Leia.  ",
        "\nThe flickering, hazy style of Kylo Ren's lightsabre may allude to the fact that, since he didn't have a real Sith master, Ren's abilities as a Sith are not as good as they could be. A clue to this is how long Finn, a non-Jedi, lasts in the lightsabre duel with him. However, when you also consider the \"blown\" quality of his voice when wearing the mask, this could be an allusion to his character traits, i.e. not in total control, prone to explosive tantrums.  ",
        "\nThe name Kylo Ren is almost exactly the same as \"Kybo Ren,\" a pirate character who was one of the main villains in Star Wars: Droids (1985). The name \"Finn\" was used for many different Star Wars characters before The Force Awakens, both male and female, including both a Weequay pirate (Finn Tegotash) and a Twi'Lek Jedi (Finn Ertay) in Star Wars: The Clone Wars (2008), Finn Galfridian, the lead character in the Dark Horse comics series \"Star Wars: Invasion,\" a Sith Master in the anthology comic book series \"Star Wars Tales,\" a Galactic Republic soldier in Star Wars: The Old Republic (2011), Finn Shallo, a non-player character in Star Wars Galaxies: An Empire Divided (2003), and various one-off characters in other young adult novels and Marvel and Dark Horse comics.  ",
        "\nGrossed $247.9 million in its opening weekend in North America, surpassing Jurassic World (2015), which previously held the record with $208.8 million. This marks the fourth occasion a Star Wars film has set the weekend gross record in North America: Star Wars: Episode IV - A New Hope (1977) set the record twice, first in its eleventh weekend in 1977 with $7.1 million and again in the first weekend of its 1978 reissue with $10.1 million, and Star Wars: Episode VI - Return of the Jedi (1983) set the record with $23 million in its opening weekend.  ",
        "\nWhen Rey is attempting to escape from Starkiller Base, a conversation can be heard between two Stormtroopers discussing the new T-17s: \"Have you checked out the new T-17s?\" \"The T-17s, as far as I can tell are a great improvement.\" \"Yeah. That's what they tell you. But believe me, they don't hold up.\" \"They don't?\" \"No.\" This is similar to the conversation two Stormtroopers have in the Death Star as Obi-Wan powers down the tractor beam in Star Wars: Episode IV - A New Hope (1977): \"You seen the new VT-16?\" \"Yeah. Some of the other guys were telling me about it.\" \"They say it's...it's quite a thing to see - \"  ",
        "\nJesse Plemons, Ed Speleers, John Boyega, Matthew James Thomas and Ray Fisher were the final candidates for one of the lead roles. The role eventually went to John Boyega.  ",
        "\nAdam Driver didn't like wearing the Kylo Ren mask because his vision was impaired while wearing it.  ",
        "\nAs of 19th December 2015, The Force Awakens has the fastest growing number of IMDb voters, with over 75,000 votes accumulated on 18th December; only its U.S. release date, and over 110,000 on 19th December, only its second day on the wide release market.  ",
        "\nMidichlorians, explained as the biological origin of the Force in the prequels (to the dismay of many hard-core fans), are not mentioned in The Force Awakens.  ",
        "\nDuring pre-production, Finn was known by the temporary name Sam, and Rey was Kira.  ",
        "\nWhen John Boyega was cast as Finn, it was rumored that he may be a son of Lando Calrissian, rebel hero played by Billy Dee Williams in Star Wars: Episode V - The Empire Strikes Back (1980) and Star Wars: Episode VI - Return of the Jedi (1983).  ",
        "\nThe first \"Star Wars\" film to have more than one producer (Kathleen Kennedy, J.J. Abrams and Bryan Burk).  ",
        "\nThe third trailer debuted during the halftime slot in the Philadelphia Eagles and New York Giants game, and generated 15.9 million viewers.  ",
        "\nJ.J. Abrams revealed to Empire Magazine that Kylo Ren is not actually a Sith. This makes sense since \"The Rule of the Two\" ends when Vader and Sidious met their demise on the Second Death Star.  ",
        "\nThe Aurebesh writing on Poe Dameron's flight uniform reads \"Pull to inflate.\"  ",
        "\nThe British government committed £25 million ($37 million) to the film because of the boost it brought to the British film industry.  ",
        "\nDuring a scene set in the forest surrounding Maz Kanata's castle, when Kylo Ren is passing through a gully in search for Rey, fog (smoke) forms on the right side of Kylo Ren in the shoot. If carefully inspected, a foggy outline of supreme leader Snoke can be seen (Snoke's \"appearance\" this time is similar to how he appears in the hologram in front of Ren in the Force Awakens).  ",
        "\nStarkiller Base was originally located on Dantooine, with the First Order converting the old Rebel base there, as mentioned in Star Wars: Episode IV - A New Hope (1977). Starkiller would have also been called the \"Doom Star\", and its cannon would have fired out of a volcano.  ",
        "\nGrossed $57 million from the Thursday previews in North America, setting a new record for preview screenings. The previous record was held by Harry Potter and the Deathly Hallows: Part 2 (2011), which grossed $43 million.  ",
        "\nThis film grossed a grand total of over $1 billion worldwide in 12 days since its box office debut, surpassing Jurassic World (2015) by only one day.  ",
        "\nThe first film of a third Star Wars trilogy. It has been confirmed that Episode VIII and Episode IX are being written.  ",
        "\nGeorge Lucas on The Daily Show (1996), promoting his film Red Tails (2012), half-jokingly said that Red Tails (2012) would be the closest thing to a Star Wars - Episode 7.  ",
        "\nThe First Order drop ship that FN-2187 rides to Jakku in strongly resembles a WW II-era Higgins LCM (Landing Craft, Mechanized) with its rectangular shape, large bow ramp, and small pilot house on top of the back of the ship.  ",
        "\nMichael Giacchino, the main composer for J.J. Abrams movies and TV series before Star Wars, has a cameo in this movie.  ",
        "\nThe Hosnian System is named after film teacher Jim Hosney.  ",
        "\nThe first trailer was released on November 28th, 2014. Although more than a year before the film's release, it was shown in select cinemas and on iTunes trailers.  ",
        "\nThe first \"Star Wars\" film to be distributed by Walt Disney Pictures.  ",
        "\nTickets went on sale on 19 October 2015, a full 59 days before the movie's release.  ",
        "\nThe X-Wing fighters have the new engine design with a half-circle intake on each wing. However, the wrecked X-Wing fighter in the sand, as Rey's tractor hovercraft passes by early in the film, has the older design with a smaller full-circle intake on each wing. This is consistent with the origin of the wreckage, presumably from the Battle of Jakku, which occurred during the Rebellion's victory over the Galactic Empire (in the era of Star Wars: Episode VI - Return of the Jedi (1983)).  ",
        "\nVoice actor James Arnold Taylor who has voiced the character \"Obi-Wan Kenobi\" in multiple Cartoons/Video Games such as Star Wars: The Clone Wars (2008) had originally recorded all the dialogue lines for \"Obi-Wan Kenobi\" featured in this film. However, at the end of post-production director J.J. Abrams decided to bring in Ewan McGregor who played this character in live-action form in Episodes I-III to deliver the lines in the finished film.  ",
        "\nThe look of Kylo Ren took the longest of all the new characters to design. Originally simply known as 'Jedi Killer', the earliest designs of his helmet resembled more grotesque versions of Ralph McQuarrie's earliest version of Darth Vader. Other helmet designs were given to minor characters such as members of the Guavian Death gang and First Order Fleet Engineers. A painting of a caped silver First Order Trooper was also originally considered for Kylo Ren instead provided the blueprints for Captain Phasma.  ",
        "\nThe \"Starkiller\" weapon is similar in design to the Galaxy Gun used in the Star Wars Dark Empire series. It was a weapon that traveled through hyperspace to destroy planets.  ",
        "\nThis film reunites Oscar Isaac with his Inside Llewyn Davis (2013) co-star Adam Driver, as well as his Ex Machina (2014) co-star Domhnall Gleeson.  ",
        "\nIn an interview with Ellen DeGeneres, Lupita Nyong'o accidentally revealed that for all her scenes in the film Chewbacca was played by Joonas Suotamo rather than Peter Mayhew, and it is unsure how much Mayhew (who has problems walking) is actually in the film at all.  ",
        "\nIt was revealed on November 6, 2014 on Disney's official Twitter page that the subtitle for Star Wars Episode VII is \"The Force Awakens.\"  ",
        "\nDisney actually allowed quite a few terminally ill people to have an early screening of the movie. Including a little 8 year old girl from Connecticut who received a special visit from a 501st Legion member dressed up as Darth Vader, accompanied by Disney representatives, bringing her the movie to watch it at home. The little girl passed away not long after.  ",
        "\nThe first paragraph of the opening crawl refers to Luke Skywalker as \"the last Jedi.\" On January 23, 2017, the title of Episode VIII was revealed to be \"The Last Jedi,\" making this the first time the title of a Star Wars movie is found in the opening crawl.  ",
        "\nStar Wars: Battlefront (2015) has some connections with the plot of this film.  ",
        "\nMax von Sydow is the second Swedish-born Star Wars cast member, and the fourth of Swedish ancestry to appear in the series. Mark Hamill and Hayden Christensen are both of Swedish descent, while Pernilla August was born in Sweden. Von Sydow and August have also frequently worked with director Ingmar Bergman. Von Sydow previously worked with Carrie Fisher in Hannah and Her Sisters (1986).  ",
        "\nFirst \"Star Wars\" movie since Star Wars: Episode VI - Return of the Jedi (1983) to not receive any Razzie Award nominations.  ",
        "\nThe first Star Wars film not to feature Anakin Skywalker/Darth Vader, although his charred melted helmet is seen.  ",
        "\nRight before Han and Finn discuss the plan to find Rey, a squad of Stormtroopers walk by. As they walk by, one says, \"We think they may be splitting up\". This is a reference to a squad of Stormtroopers from Star Wars: Episode IV - A New Hope (1977), who say the exact same thing.  ",
        "\nHarrison Ford plays Han Solo, who flies a spaceship called the Millennium Falcon. Interestingly enough, Ford is actually a licensed pilot and loves flying planes. He was once in an accident while flying, where he crashed a plane in a golf course, seriously injuring himself.  ",
        "\nDomhnall Gleeson and Warwick Davis both previously appeared in Harry Potter and the Deathly Hallows: Part 1 (2010) and Harry Potter and the Deathly Hallows: Part 2 (2011).  ",
        "\nAs story consultant, George Lucas attended initial script discussions.  ",
        "\nJohn Boyega dropped out of making Race (2016) to appear in the film.  ",
        "\nAnna Brewster, who has a brief appearance as the spy Bazine Netal, ad-libbed her line (spoken in an alien language) on the spot.  ",
        "\nPart of Rey's hairstyle closely resembles the 'top knot' of the Japanese samurai, upon whom the Jedi are partially based.  ",
        "\nIn an interview, J.J. Abrams said about internet rumors, \"Some are true. Some are false. I'm not saying which are which.\"  ",
        "\nDayo Okeniyi was considered for the role of Finn. He backed out to star in Terminator Genisys (2015) as Danny Dyson.  ",
        "\nKylo Ren's ship is a next generation variant of the Imperial Shuttle seen in Star Wars: Episode VI - Return of the Jedi (1983) which transported Darth Vader and Emperor Palpatine in separate scenes from a Star Destroyer ship to the second Death Star. This early shuttle version was also hijacked and used by the Rebel Alliance to penetrate Endor's defences.  ",
        "\nOn January 6, 2016 it surpassed Avatar (2009)'s $760 million gross to become the highest grossing film ever in North America unadjusted for inflation. This marked the first time the domestic record has been held by a sequel, every prior film to set the record was either the first film of a series or a standalone film. It is also the first domestic record holder to not receive an Academy Award nomination for Best Picture since the establishment of the award. The past record holders are The Birth of a Nation (1915), Gone with the Wind (1939), The Sound of Music (1965), The Godfather (1972), Jaws (1975), Star Wars: Episode IV - A New Hope (1977), E.T. the Extra-Terrestrial (1982), Titanic (1997), and Avatar.  ",
        "\nPoe flies an X-wing that is black with orange stripes, except for his mission on Jakku, when he uses one with a white fuselage with blue stripes. Also, his normal helmet is black with a red rebel logo, except when he is on Jakku when it is white with a blue logo. Since Kylo Ren is surprised to find him on Jakku, it is possible that he was traveling undercover there.  ",
        "\nThird J.J. Abrams film to introduce Simon Pegg into a big movie franchise. Abrams first added him to the Mission: Impossible franchise in Mission: Impossible III (2006), and then into Star Trek in Star Trek (2009).  ",
        "\nThere was a scene that was edited and cut from the Maz Kanata's castle scene which Rey runs into Unkar Plutt whom demands that Rey comes back with him to Jakku. Rey aims her blaster pistol at Plutt, but Plutt grabs her arm and Chewbacca snatches Rey's gun and gives it back to Rey and Plutt pokes Chewbacca's wounded arm. The deleted scene was in the novelization.  ",
        "\nThere was only one pre-release photo of Domhall Gleeson in the role of General Hux, and during an interview with Gleeson a writer asked him if Hux was a good or bad guy. Gleeson laughed and said \"We're all in a lot of trouble if a guy wearing THAT uniform becomes a good guy!\", referring to the fact that Hux's military outfit was purposely designed to look like a space version of a Nazi Wehrmacht uniform.  ",
        "\nMark Hamill admitted in an interview that he was terrified to play Luke Skywalker again.  ",
        "\nRey's instantly rising bread was created practically without the aid of any visual effects. According to special effects supervisor Chris Corbould his team spent months working on the effect, and accomplished it by using a suction pump to remove the liquid and an air pump to inflate the bread.  ",
        "\nThe first J.J. Abrams film not to be scored by Michael Giacchino, as the Star Wars series composer John Williams returned to score the film. Ironically, Giacchino scored Jurassic World (2015), a sequel to Jurassic Park (1993) and The Lost World: Jurassic Park (1997), which were both scored by Williams. That film credits Williams for its use of his iconic theme music.  ",
        "\nDavid Fincher was also considered as a potential director.  ",
        "\nAdam Driver's participation came about after the producers met with HBO to work around his Girls (2012) schedule.  ",
        "\nLeia speaks the final line in both this film and \"Rogue One\", the first two Star Wars films released since Disney acquired Lucasfilm in 2012.  ",
        "\nThe first time since Star Wars: Episode IV - A New Hope (1977) that the gun turret in the Millennium Falcon was used.  ",
        "\nDuring the first conversation between Rey and Solo aboard Millennium Falcon, it is established that the ship was stolen initially by Duquesne, who lost it to the 'Erwin Boys,' who finally lose the Falcon when Unkar Plutt steals it. This explains the presence of Millennium Falcon in Jakku.  ",
        "\nIf measured by ticket sales rather than dollar gross, this would rank as the eleventh most attended film of all time domestically, having sold an estimated 107 million tickets. It is the most attended film since Titanic (1997) (128 million estimated tickets) and sold more tickets than every prior Star Wars film except for the 142 million tickets Star Wars: Episode IV - A New Hope (1977) sold in its initial run.  ",
        "\nThe film's cast includes one Oscar winner: Lupita Nyong'o, and two Oscar nominees: Harrison Ford and Max von Sydow.  ",
        "\nWhen Han, Chewie and Finn are searching for Rey some comm chatter states that there is a disturbance in sector \"718\"; that is the phone area code for the New York City boroughs of Bronx, Queens, and Brooklyn. Director J.J. Abrams was born in NYC and his favorite music group, \"Beastie Boys\" hail from Brooklyn.  ",
        "\nJ.J. Abrams is the only director so far who has directed a Mission: Impossible, Star Trek and Star Wars film.  ",
        "\nLor San Tekka has 7 lines of dialogue and is never addressed by name.  ",
        "\nDomhnall Gleeson also appeared in Brooklyn (2015) the same year. In that film, two characters go to see Singin' in the Rain (1952), which starred Debbie Reynolds, mother of Carrie Fisher and grandmother of Billie Lourd.  ",
        "\nThe film features both a James Bond and a Blofeld, Max von Sydow (Blofeld in Never Say Never Again (1983)) and Daniel Craig (James Bond since 2006).  ",
        "\nChristina Chong was announced for the film but her role was deleted in post production.  ",
        "\nAs of this film, 11 actors have appeared in both Star Wars and James Bond films; Christopher Lee (appeared in Star Wars: Episode II - Attack of the Clones (2002) as Count Dooku and The Man with the Golden Gun (1974) as Scaramanga); Shane Rimmer (appeared in A New Hope (1977) as InCom Engineer, You Only Live Twice (1967) as Hawaii Radio Operator, Diamonds Are Forever (1971) as Tom, Live and Let Die (1973) as Hamilton, and The Spy Who Loved Me (1977) as Carter); Jeremy Bulloch (appeared in Star Wars: Episode V - The Empire Strikes Back (1980) and Star Wars: Episode VI - Return of the Jedi (1983) as Boba Fett, and The Spy Who Loved Me (1977) as HMS Ranger Crewman and For Your Eyes Only (1981) and Octopussy (1983) as Smithers); John Hollis (appeared in The Empire Strikes Back as Lando's Aide and For Your Eyes Only as Bald Man in wheelchair (unofficially Blofeld)); Julian Glover (appeared in The Empire Strikes Back as General Veers and For Your Eyes Only as Kristatos); Bruce Boa (appeared in The Empire Strikes Back as General Rieekan and Octopussy as U.S. General); Richard LeParmentier (appeared in Star Wars: Episode IV - A New Hope (1977) as General Motti and in Octopussy as U.S. Aide); Dermot Crowley (appeared in Return of the Jedi as General Madine and in Octopussy as Kamp); Max von Sydow (appeared in Star Wars: Episode VII - The Force Awakens (2015) as Lor San Tekka and the unofficial Never Say Never Again (1983) as Blofeld); and Daniel Craig (appeared in The Force Awakens in a cameo, and Casino Royale (2006), Quantum of Solace (2008), Skyfall (2012) and Spectre (2015) as James Bond himself), and David Prowse (appeared in Casino Royale (1967) and as Darth Vader in the Original Star Wars trilogy). Of them, 4 (Christopher Lee, John Hollis, Julian Glover, Max Von Sydow) have played Bond villains; 3 (Jeremy Bulloch, John Hollis, Julian Glover) were in For Your Eyes Only and 3 (Bruce Boa, Richard LeParmentier and Dermot Crowley) were in Octopussy. Further more, numerous stuntmen and extras appeared on screen in various parts in both franchises, but did not receive an on-screen acting credit. As a side note, Sean Connery who played James Bond himself in a few movies appeared with Harrison Ford (who plays both Han Solo & Indiana Jones) in The Last Crusade.  ",
        "\nPlans for filming some parts of a Star Wars film on location in Iceland date back to at least Return of the Jedi, but this is the first film in the canon to make good on such plans.  ",
        "\nThe only feature to be released in the IMAX 70mm format in 2015.  ",
        "\nSimon Pegg's breakthrough role was in Shaun of the Dead (2004). His flatmate in that film was played by his friend, Peter Serafinowicz, who voiced Darth Maul in Star Wars: Episode I - The Phantom Menace (1999).  ",
        "\nThis is the second movie Oscar Isaac and Adam Driver have appeared in together, the first being Inside Llewyn Davis (2013).  ",
        "\nThis film marks the fourth time that John Williams has received an Academy Award nomination for the original film score of a Star Wars film - the other three are for the original trilogy. Star Wars: Episode IV - A New Hope (1977) is the only film to receive the award.  ",
        "\nKylo Renn's actor Adam Driver was born in 1983, the same year Star Wars: Episode VI - Return of the Jedi (1983) was released.  ",
        "\nOn May 4, 2016, 'J.J. Abrams' (qc) appeared outside the 'Richard Rodgers' Theatre on Broadway with \"Hamilton\" composer and star Lin-Manuel Miranda. Miranda and Abrams performed \"Jabba Flow,\" the cantina song from Star Wars: Episode VII - The Force Awakens that the pair had composed together. This was one of the regular performances presented for the \"Ham 4 Ham\" lottery--the short events outside the Richard Rogers in conjunction with the lottery for the small number of $10.00 tickets to \"Hamilton that are made available daily; since only about twenty $10.00 tickets are available but thousands of people show up each day, Miranda instituted this performance series so that the lottery attemptees (the vast majority of whom will never win the chance to buy a ticket) would have some consolation. Before performing the song, Miranda and Abrams explained that the song's lyrics are in Huttese and they translate as \"No, lover lover: it wasn't me\"--which Miranda jokingly described as a tribute to Shaggy's 2000 reggae hit \"It Wasn't Me.\" May 4 is known as \"Star Wars Day\" because of the pun in the date (\"may the fourth be with you\").  ",
        "\nRey living on Jakku which is a desert planet was written to mirror the beginnings of the journeys of Anakin and Luke Skywalker. Anakin and Luke both lived on the desert planet Tattooine.  ",
        "\nLor San Tekka's name is not spoken by Poe Dameron and Kylo Ren.  ",
        "\nThere are three actors from BBC hit show _\"Doctor Who\" (2005)_ who appear in this movie: Warwick Davis as Wollivan and Simon Pegg as Unkar Plutt. Christina Chong has a role but her scenes were cut.  ",
        "\nMichael Arndt worked on the script for 8 months but felt he needed 18 more, such is the complexity of the Star Wars universe. J.J. Abrams and Lawrence Kasdan then took over and completed their first draft in 6 weeks.  ",
        "\nOriginal concept art for the movie showed Luke and Rey in scuba gear.  ",
        "\nIn Justin Cronin's post-apocalyptic 2010 novel \"The Passage\" two characters in a greater group surviving in a hot desert-like environment are called \"Rey and Finn\".  ",
        "\nIn Lor San Tekka's backstory: Tekka was a explorer and a member of The Church of the Force, an underground for Non Jedi that were not Force sensitive. Tekka was an ally of Luke Skywalker and Leia Organa and he also knew Ben Solo before he became Kylo Ren. When Ren wiped out the Jedi Academy, Luke gave Tekka the map.  ",
        "\nThe name of smuggler \"Maz Kanata\" is very likely a sly nod to \"Mas Que Nada\", a song popularized in the US by musical group Brasil '66 in the 1960's. In Brazilian Portuguese slang, \"mas, que nada\" (literally, \"but, that [is] nothing\") means \"no way\", \"whatever\", or \"yeah, right!\".  ",
        "\nBoth Daisy Ridley and Max von Sydow share the same birthday, April 10.  ",
        "\nMax von Sydow is the only member of the new cast to have been acting when the original Star Wars(1977) came out, let alone to have been born.  ",
        "\nThree cast members have previously worked for directors Joel Coen and Ethan Coen. Domhnall Gleeson appeared in True Grit (2010), while Adam Driver and Oscar Isaac appeared together in Inside Llewyn Davis (2013).  ",
        "\n\"Snoke\" is a word: it's a variant of Snook, a kind of fish.  ",
        "\nJust after Han, Finn, and Rey meet Maz, a large alien is seen wearing a trandoshan flight suit. Former bounty hunter Bossk was trandoshan.  ",
        "\nIn early 2016, Daisy Ridley had been announced that she was in talk to play Lara Croft in the big screen reboot of Lara Croft: Tomb Raider (2001). But, Alicia Vikander was cast. It's most likely Daisy Ridley may had passed on it due to her commitment on Star Wars: The Last Jedi (2017) and Star Wars: Episode IX (2019).  ",
        "\nCaptain Phasma never removes her helmet.  ",
        "\nCash Cow Franchise: Disney bought Lucasfilm for $4 billion because Star Wars is one of the biggest (if not the Trope Maker, the Trope Codifier). And it paid off: The Force Awakens made over $500 million in its opening weekend, and got to $1 billion in 12 days (the fastest film to hit that mark). One month later, it managed to overtake Avatar as the highest-grossing movie ever in North America, and the total there is now a staggering $930 million. Worldwide, The Force Awakens stands as the third highest of all time, as well as the biggest moneymaker not directed by James Cameron (both meaning it managed to, like Avatar and Titanic, surpass $2 billion worldwide, and, like only Avatar, do it on its initial release). Of course, that's not even getting into The Merch, or the inevitable Star Wars Land coming soon to Disney Theme Parks worldwide (which is where Disney will make back the rest of that $4 billion).  ",
        "\n\"Rey\" means \"King\" in Spanish.  ",
        "\nWhen the X-Wings swoop in to attack the First Order Stormtroopers on Takodana, Troopers are heard deploying Domino Squad into action. Domino Squad was also a squad of clones on the Clone Wars TV show which included Hevy, Cutup, Fives, and Echo- the latter two characters playing prominent repeating roles during the series.  ",
        "\nDespite being directed by an American & production costs paid by a U.S. studio, the super-majority of actors are British. Excluding the original Star Wars actors, among the main cast only Adam Driver is an American.  ",
        "\nEddie Redmayne auditioned for the role of Kylo Ren but failed to get the part.  ",
        "\nEvery Star Wars film up to this one, with the exception of Star Wars: The Clone Wars (2008), has been nominated for or won an academy award.  ",
        "\nBen Schwartz was recruited by JJ Abrams' to provide voice effects for BB-8 after the met and became friends on the short-lived NBC show \"Undercovers\", where Schwartz was a supporting actor and Abrams an executive producer. Schwartz and co-voicer Bill Hader, a friend of both men, were asked by Abrams to not disclose their involvement in the film until it had its world premiere. They agreed and Schwartz broke the news by posing for an Instagram post with him standing next to a BB-8 figure at the event.  ",
        "\nAfter the release of the teaser trailer, many fans were convinced that BB-8 was entirely computer generated, judging from a brief closeup-shot of the droid. This caused mixed reactions among fans, especially from those who disliked the extensive use of CGI in the prequel trilogy. They were proven wrong when an actual, moving prop of the BB-8 droid was presented during the Star Wars Celebration 2015 in Anaheim.  ",
        "\nRey doesn't appear until 10 minutes into the film.  ",
        "\nThe Storm Trooper whom Rey convinces to release her restraints and leave the door open is played by Daniel Craig. Fitting because it's the 007th Star Wars film.  ",
        "\nFirst Han Solo appearance in a live action Star Wars film in 32 years.  ",
        "\nMax von Sydow had played Ming the Merciless in Flash Gordon (1980) and Dr. Liet Kynes in Dune (1984). The Flash Gordon serials was one of George Lucas's influences behind Star Wars and it had been speculated \"Dune\" by Frank Herbert had also been an influence behind Star Wars.  ",
        "\nB-Team Sequel: The first full-fledged Star Wars film not to directly involve George Lucas, instead created by J.J. Abrams. A rare case of the B-Team Sequel being more anticipated because of a changing of the guard from the original creator.  ",
        "\nIn the Italian version the voice of Lor San Tekka, played by Max von Sydow, is dubbed by the actor Luciano De Ambrosis.  ",
        "\nGwendoline Christie was eager to take on the role of Captain Phasma after JJ Abrams' outlined the key aspects of the villainous character, which Christie thought were \"very progressive\". She particularly liked that a clearly female character (even with her face not shown) was going to be unapologetically evil and cold-hearted.  ",
        "\nBilly Dee-Williams doesn't appear in the film as Lando Calrissian. If Williams doesn't return for Episode 8 and 9. It will be assumed the character died prior to Episode 7.  ",
        "\nAccording to Chuck Wendig's Star Wars \"Aftermath\" book trilogy, General Hux should be about 10 years older than Kylo Ren / Ben Solo... however both actors are the exact same age.  ",
        "\nHarrison Ford's on-set injury put significant strain on the production schedule, to the point that there were discussions of pushing back the release date of the film into 2016 (vehemently opposed by Disney), and filming scenes of Han Solo with a body double and Ford's head digitally inserted. Ultimately Ford was able to recover and complete his performance.  ",
        "\nAdam Driver and Carrie Fisher play mother and son. Driver had previously appeared in the film Lincoln (2012), while Fisher's real-life mother, Debbie Reynolds, appeared in How the West Was Won (1962), which also featured Abraham Lincoln as a character.  ",
        "\nKen Leung and Max von Sydow have both appeared in the \"Rush Hour\" franchise. Ken Leung starred in Rush Hour (1998) and Max van Sydow starred in Rush Hour 3 (2007).  ",
        "\nWhen Finn first arrives at the Resistance base on D'Qar, a group of 6 Resistance troopers runs towards the camera. A moment later, they pass Finn again, this time moving away from the camera. As Poe gets out of his X-Wing, a long haired young man runs past carrying two boxes. The same man with the boxes runs past Poe once more when Dameron greets BB-8. Immediately after that, two pilots, one of whom has short white hair, run past Finn twice. Finally a group of three pilots run past Poe before he reunites with Finn and when the two of them are talking, the same three pilots casually stroll by in the same direction as before.  ",
        "\nAscended Fanon: Long before the debut of the film, the name Captain Phasma existed way before Disney registered the trademark for the name, in the fan fiction Tarkin's Fist published in 2009, Phasma was a 10 year old daughter of an Imperial Admiral. Her name was eventually adapted by Lucasfilm for the commander of the First Order Stormtroopers and was geared with a chrome Stormtrooper armor originally designed for Kylo Ren.  ",
        "\nRey living on Jakku, a desert planet was written to mirror the beginnings of the journeys of Anakin and Luke Skywalker. Both Anakin and Luke lived on the desert planet Tatooine.  ",
        "\nBefore the film was released, a 13.5 inch action figure of Finn was available in stores that featured several lines of dialogue from the picture. One of these lines was one that does not occur in the film: him shouting \"I don't know what to do!\". According to the novelization, this would have been uttered after the crashed TIE fighter disappeared into the sinking sands..  ",
        "\nHan refers to Jakku as a \"Junkyard.\" Watch carefully as Rey and Finn are running for the quad jumper. Look over Rey's left shoulder. In the background is a device that looks like the Rebel generator from Hoth in The Empire Strikes Back.  ",
        "\nGeneral Hux's first name is not mentioned on film, in the end credits nor in any related material released simultaneously with the film, but was eventually revealed in Chuck Wendig's 2016 Star Wars novel 'Aftermath: Life Debt' as being 'Armitage'.  ",
        "\nIko Uwais, Yayan Ruhian: the two martial arts stars from The Raid: Redemption (2011) and The Raid 2 (2014) play Razoo Quin-Fee and Tasu Leech, two of the mercenaries who confront Han Solo with an unpaid debt.  ",
        "\nStefan Grube: X-Wing pilot Yolo Ziff (who says, \"Black Leader, there's a brand new hole in that Oscilator\") is played by the man who edited the trailers for The Force Awakens.  ",
        "\nSimon Pegg: as the alien creature Unkar Plutt to whom Rey sells her scavenged parts.  ",
        "\nJ.J. Abrams: [Greg Grunberg] Almost every project J.J. Abrams has ever produced, directed, or been otherwise involved with has contained a substantial role for, a cameo by, or at least a reference to his childhood friend Greg Grunberg. Grunberg, who has known Abrams since the age of 4, first appeared in an Abrams project at age 10 - they made home movies together while on playdates. Grunberg plays the character \"Snap Wexley\" in this film; their previous collaborations include Lost (2004), Alias (2001), Felicity (1998), Super 8 (2011), Mission: Impossible III (2006), and Star Trek (2009). Abrams even managed to work Grunberg's name into his dialogue in Six Degrees of Separation (1993), a project in which Abrams was an actor but not writer, director, or producer.  ",
        "\nJ.J. Abrams: [Beastie Boys] Alien Resistance pilot Ello Asty is named after the 1998 Beastie Boys album \"Hello Nasty.\" His helmet features the words \"Born to Ill\" in Aurebesh lettering, which refers to their 1986 album \"Licensed to Ill\", as well as the helmet featured on the poster of Full Metal Jacket (1987). Further more, Star Wars Insider 165 magazine (released 3 May 2016) confirms that the name of the species Ello Asty belongs to, the 'Abednedo', refers to the biblical character 'Abegnego' mentioned in the Beastie Boys song 'Shadrach' and that two more aliens from the same species appearing in the film are have Beastie Boys inspired names: Ilco Munica (seen in the Jakku village at the start of the film) is named for the 1994 release 'Ill Communication', while Brassmon Kee (briefly visible on Hosnian Prime before it is destroyed) is named after the song 'Brass Monkey'.  ",
        "\nJ.J. Abrams: [Kelvin] Rey mentions \"Kelvin Ridge\" to BB-8. J.J. Abrams incorporates the name of his maternal grandfather, Henry Kelvin, into all his projects.  ",
        "\nJ.J. Abrams: [father] Gerald W. Abrams appears as an extra in many of his son J.J. Abrams' projects, this time as Resistance member Captain Cypress.  ",
        "\nJ.J. Abrams: [47] When locating the site of Starkiller Base's shields, Finn mentions \"Precinct 47.\" J.J. Abrams frequently uses the number \"47\" throughout his work, most notably Alias (2001), \"Lost\" (2004)_ and Star Trek (2009).  ",
        "\nDaniel Craig: The Stormtrooper on whom Rey performs a Jedi Mind-Trick. Fans have given him the unofficial Stormtrooper number JB-007, referring to the character James Bond 007, a role he has played four times. The Lego Star Wars: The Force Awakens (2016) game finally revealed the stormtrooper's actual designation: FN-1824.  ",
        "\nAccording to Lucasfilm president Kathleen Kennedy, when Harrison Ford and Chewbacca set foot in the Millennium Falcon set, every person on set was stunned. Kennedy claims that there must have been 200 people who were completely quiet, due to the iconic presence of Ford and Mayhew back on Han Solo's ship.  ",
        "\nContinuing the tradition of the previous six films, there is no dialogue spoken in the final scene.  ",
        "\nMark Hamill was notably absent from the marketing of the film, and his image did not appear in the trailers or on the poster to mirror his absentee role in the story. He is present in the various trailers only as a voiceover rerecording of lines from Star Wars: Episode VI - Return of the Jedi (1983) and one shot from behind showing his mechanical hand reaching for R2-D2. Though he received second billing he only appears in the aforementioned shot from the trailer in Rey's Force vision and in the final scene of the film and has no dialogue in both appearances. His screentime also amounts to a mere 30 seconds.  ",
        "\nHarrison Ford admitted that he fought for Han Solo not to survive the events of Star Wars: Episode VI - Return of the Jedi (1983). He wanted Han to sacrifice himself in order to give him a little bottom, as he does in this film. Lawrence Kasdan, screenwriter for Episode VI and now The Force Awakens, supported the idea, but George Lucas objected because he didn't want any of the main cast to die.  ",
        "\nDuring the Falcon's second flight, Finn finds the Jedi training remote from Star Wars: Episode IV - A New Hope (1977). The helmet Luke wore during the training session can be spotted hanging from the side of the engineering station in the Falcon's main hold.  ",
        "\nMichael Arndt penned a script for this film based on an outline by George Lucas for his abandoned sequel trilogy to the original Star Wars saga. Though few details of this outline have been made public, author Dave Pollack confirmed that the story would focus on the building of the New Republic after the fall of the Empire, that Luke Skywalker, Princess Leia and Han Solo would all appear, and that the children of Luke, Leia and Han would serve as the main characters of the story. However, Arndt's script was ultimately rejected and a new script was penned by J.J. Abrams and Lawrence Kasdan.  ",
        "\nFrank Oz was happy to return as Yoda for the Force sequence, saying he would happily contribute to the role if it would improve the film.  ",
        "\nKylo Ren's real name is Ben Solo. Although it is never stated, he may have been named after Obi-Wan (Ben) Kenobi.  ",
        "\nLuke Skywalkers hiding place was filmed at Skellig Michael - an island off the south west coast of Ireland. The steps Rey climbs and the stone buildings she passes are part of a Christian monastery founded sometime between the 6th and 8th centuries.  ",
        "\nThe name of the First Order's weapon is \"Starkiller\". This was Luke Skywalker's original last name when George Lucas wrote the Star Wars story. The name was given to the character Galen Marek, who was Darth Vader's secret apprentice in the video game \"Force Unleashed,\" as a code name. It's Starkiller's actions in the game that leads to the creation of the Rebel Alliance.  ",
        "\nAs of this film, C-3PO and R2-D2 are the only characters to be in all eight live-action \"Star Wars\" films.  ",
        "\nWhen Obi-Wan Kenobi's voice is heard in the Force sequence, it is done by Kenobi's actors Alec Guinness and Ewan McGregor; voice actor James Arnold Taylor, who voiced Kenobi in Star Wars cartoons, had also recorded a line, but it was cut out to make way for Guinness.  ",
        "\nThe first shots fired by stormtroopers are right on target. On average, the troopers are superior marksmen, compared to previous films.  ",
        "\nMark Hamill (Luke Skywalker), Harrison Ford (Han Solo), Carrie Fisher (Princess Leia), Anthony Daniels (C-3PO), Kenny Baker (R2-D2), Peter Mayhew (Chewbacca), Tim Rose (Ackbar), and Mike Quinn (Nien Nunb) are the only actors to reprise their roles from the original \"Star Wars\" trilogy while Daniels, Baker and Mayhew are the only actors to reprise their roles from the prequel trilogy as well.  ",
        "\nWhen Kylo Ren is reading Rey's mind in the interrogation chamber, he says he sees her dreams of an island in the middle of an ocean.    In the final scene, Rey locates Luke on an island in the middle of an ocean.  ",
        "\nWhen Rey uses the Force to recover the lightsaber, besting Kylo Ren, the Force theme usually associated with Obi-Wan and Luke, \"Binary Sunset\", is played.  ",
        "\nThe prefix of First Order's stormtroopers is \"FN\", as Finn presents himself as FN-2187 to Poe Dameron. FN is an acronym for \"Footsoldier Number\".  ",
        "\nDuring his duel with Rey, Kylo Ren receives a large facial scar similar to one Anakin Skywalker receives in Star Wars: Episode III - Revenge of the Sith (2005).  ",
        "\nFinn's storm trooper reference number FN-2187, is a reference to the cell 2187 which was the number of Princess Leia's cell on the Death Star in Star Wars: Episode IV - A New Hope (1977).  ",
        "\nIn the climax of the first film in all three trilogies a major character who is serving as a mentor to the younger cast is killed by lightsaber at the hand of the film's primary antagonist. In Star Wars: Episode I - The Phantom Menace (1999) Qui-Gon Jinn (Liam Neeson) is killed by Darth Maul, in Star Wars: Episode IV - A New Hope (1977) Obi-Wan Kenobi (Alec Guinness) is killed by Darth Vader, and in this film Han Solo (Harrison Ford) is killed by Kylo Ren. Neeson and Ford were also the top billed actors in the films they died in, and while Guinness was not Ewan McGregor received top billing playing the same character in Episodes II and III.  ",
        "\nDuring her escape on the Starkiller base, Rey overhears a conversation between two stormtroopers who discuss the new \"BT-17\", which is a reference to the first movie Star Wars: Episode IV - A New Hope (1977), where Obi-Wan Kenobi overhears two stormtroopers having a similar conversation about the new BT-16 while disabling the tractor beam on the Death Star.  ",
        "\nAt the end of their duel, Finn manages to injure Kylo Ren's shoulder much like Luke did to Darth Vader on Cloud City. Kylo Ren even performs the same disarming maneuver on Finn right after.  ",
        "\nFinn is the fourth non-Force user after General Grievous (Star Wars: Episode III - Revenge of the Sith (2005)), Pre Vizsla (Star Wars: The Clone Wars (2008)) and Han Solo (Star Wars: Episode V - The Empire Strikes Back (1980)) to wield a lightsaber.  ",
        "\nThis is the first Star Wars film without a physical appearance from Anakin Skywalker or Obi-Wan Kenobi, though Kenobi's voice can be heard saying, \"Rey, these are your first steps\" at one point in the film.  ",
        "\nHan reveals that his son's real name is Ben. Harrison Ford has a son named Ben in real life. In the Expanded Universe, Luke has a son named Ben. Also in the Expanded Universe, Han and Leia have a son who turned to the Dark Side, named Jacen Solo.  ",
        "\nWILHELM SCREAM: A shot Stormtrooper when Poe and Finn are escaping in a Tie Fighter, the same scream used in the original \"Star Wars\" films.  ",
        "\nContrary to popular belief, the segment of Rey's Force vision with Kylo Ren and the Knights of Ren surrounded by dead bodies does not take place at Luke Skywalker's Jedi academy nor are the bodies Luke's pupils. Pablo Hidalgo of Lucasfilm's story group stated the scene takes place elsewhere and the man stabbed at the beginning of the sequence by Kylo Ren is a \"clan leader\".  ",
        "\nMark Hamill grew a beard and lost 50 pounds to play the older Luke Skywalker.  ",
        "\nKylo Ren's lightsaber has the crossguard blades due to being an ancient design that requires excess energy to be vented from the main shaft. The blade has an unsteady energy beam due to his lightsaber housing a cracked kyber crystal.  ",
        "\nIn the scene where Kylo Ren killed Han Solo, Harrison Ford himself said that he wanted the character to die an honourable and noble death. Ford has been trying to do this since the release of Star Wars: Episode V - The Empire Strikes Back (1980). J.J. Abrams agreed to this because Ford believed the character has had a good enough run in the series to where Solo could not be forgotten.  ",
        "\nThe first Star Wars film where R2-D2 does not save any of the main characters, though he does help provide Luke Skywalker's location near the end of the film.  ",
        "\nDirector's Trademark]: A \"mystery box\" - the box where Rey finds Luke's lightsaber. In a childhood trip to Lou Tannen's Magic Store, J.J. Abrams bought a \"mystery magic box\" - a box that has always remained a mystery. He's never opened it believing that, unopened, \"It represents infinite possibility. It represents hope. It represents potential. What I love about this box - and what I realized I sort of do, in whatever it is that I do - is I find myself drawn to infinite possibility and that sense of potential.\" Abrams has used \"mystery boxes\" in many of his projects, including Lost (2004), Cloverfield (2008), Super 8 (2011), and Star Trek Into Darkness (2013) to name a few.  ",
        "\nPoe's fake-out \"death\" after being rescued by Finn was originally supposed to be genuine, which actually made Oscar Isaac hesitant to take the role (as he'd played a character who suffered a similar fate in The Bourne Legacy (2012)). J.J. Abrams later decided to spare Poe after coming up with a way to temporarily write him out of the plot without having to kill him off.  ",
        "\nAs shown in photos, R2D2 has gathered rust around his head to show age.  ",
        "\nWhen Finn and Rey meet Han Solo in the Millennium Falcon, she questions if he was the same man who did the Kessel Run in 14 parsecs, being corrected by Han as he did the run in 12 parsecs. In Star Wars: Episode IV - A New Hope (1977), Han Solo boasted to Luke Skywalker and Obi-Wan Kenobi about he ran Kessel Run in 12 parsecs to justify the high speed of the Millennium Falcon. Since then a parsec is an unity of space, not time (1 parsec = 3.26 light-years), in the Expanded Universe it is explained that Kessel Run was a 18 parsec route used by contrabandists to avoid Galactic Empire's controls, in a sector of space hard to navigate due to several black holes in the path, and what Han made an alternate route to short it.  ",
        "\nWhen deciding what to do with Phasma after lowering the Starkiller's shields, Han Solo asks if there is a trash compactor nearby to hold her, a reference to the escape from the Death Star in Star Wars: Episode IV - A New Hope (1977).  ",
        "\nThroughout the movie, three major times, Carrie Fisher's daughter, Billie Lourd, is seen. The first is just behind Carrie when Han and Leia reunite for the first time in this movie. The second is when the Resistance is fighting the \"Weapon Planet\" and the First Order's fleets come out. The scene cuts back to the Resistance's headquarters where Billie Lourd says \"Are you seeing this?\". The third major time is at the very end when Rey leaves in the Falcon with Chewie and R2-D2, and BB-8 and the crowd of Resistance people are waving goodbye and cheering. You can see Billie Lourd slightly to the right of Carrie Fisher and in the front row of the crowd.  ",
        "\nWhen Luke appears, it continues the tradition of at least one \"Skywalker\" character appearing in each movie's closing shot before the credits. Anakin appears in Episodes I & II. Luke appears as a baby in Episode III, later as an adult (with Leia) in Episodes IV, V and VI.  ",
        "\nThe New York Daily News generated some contoversy when an edition of their comic strip Between The Lines leaked a spoiler about Han's death. The strip was published in their December 16, 2015 issue, a day before the film's theatrical release.  ",
        "\nThere are distinctive landscapes used in this film that pay homage to episodes IV, V, and VI. On Jakku where Rey lives, there is an expansive sandy desert just like the desert young Luke grew up in on Tatooine. Then on the Starkiller base the harsh, cold, snow-covered features similar to that of Hoth. Lastly, the lush forests in which Kylo Ren confronts Rey and Finn bears a similarity to the forest moon of Endor, home of the Ewoks.  ",
        "\nDuring the final battle of the film, in which Kylo Ren tries using the Force to obtain Luke Skywalker's lightsaber and Rey manages to do so instead, a \"new\" rendition of the Force Theme is heard as Rey claims the weapon. The piece that plays here is, in fact, a track from Star Wars: Episode IV - A New Hope (1977)'s soundtrack called \"Burning Homestead\", which was originally played during the scene where Luke finds that his aunt and uncle have been murdered by the Empire. Only a fifteen second segment of the three minute track is actually used, and it is spliced in with a track from the film's official soundtrack, \"The Ways of the Force\" - which incorporates the Force theme multiple times as well.  ",
        "\nChewbacca rescues Rey and Finn at the end of the last battle. This is the only time he ever sits in the pilot's seat and unambiguously flies the Falcon as the main pilot. Prior to this, he has always sat in the co-pilot's chair with either Han, Leia or Lando at the pilot controls.  ",
        "\nWhen Starkiller base is destroyed in the explosion you can see the distinctive concave dish of the Death Star in the bottom left 'corner' and the trench line horizontal across the globe.  ",
        "\nIn an early version of the script, Leia was supposed to die instead of Han Solo.  ",
        "\nContrary to popular opinion, Harrison Ford stated in an Entertainment Weekly Nov, 2015 interview that he was happy Lucas didn't listen to his request to be martyred in Return of the Jedi. He was very glad to be back on set of a new Star Wars film. Interestingly, in the making of segments of Force Awakens, Harrison Ford is careful in admitting the characters death moves the story forward but does not confirm or deny making cameo appearances in the future films. Possibly a ghost brought back by Luke Skywalker.  ",
        "\nThere was some dissatisfaction among fans about how Leia, in response to Han's death, chooses to hug Rey (whom she has never met before) instead of Chewbacca (as they both have known Han and each other for decades). In an interview with Slashfilm, writer/director J.J. Abrams explained that his intention was for Chewbacca to be concerned with giving the injured Finn medical attention. In his absence, Leia and Rey would feel a connection with each other through the Force, and therefore, in their grief, reach out to each other. Abrams acknowledged that he made a mistake by keeping Chewbacca in the shot, making it look as if Leia was passing him by, which was never his intention.  ",
        "\nThe Millennium Falcon is actually visible very briefly before the \"the garbage will do\" quote. As Rey and Finn run out of the desert compound, the camera pans very quickly to their right, showing the Falcon in passing.  ",
        "\nThis movie marks the first time we've seen Han Solo at the controls of the Millennium Falcon since Star Wars: Episode V - The Empire Strikes Back (1980).  ",
        "\nDuring their arrival on Starkiller Base, Finn says they'll stop the First Order base by using the Force. Han Solo angrily says the Force doesn't work like that. This a reference to Star Wars Rebels (2014) where Zeb would often mock Ezra telling him to use the Force to get out of a sticky situation with Ezra replying it doesn't work like that.  ",
        "\n25 minutes into the film, Kylo Ren and General Hux argue about the First Order Stormtroopers and Ren remarks that Supreme Leader Snoke should use a clone army. That was written as a nod to the past. In the prequel trilogy, it was revealed that the Imperial Stormtroopers were clones of bounty hunter Jango Fett and that they were apart of Supreme Chancellor (Later Emperor) Palpatine's evil plot to rule the galaxy and slay the Jedi and Palpatine ordered the clone troopers to betray and eliminate the Jedi and when Palpatine reorganized the Republic and formed the evil Galactic Empire and proclaimed himself as Emperor, the clone troopers became Imperial Stormtroopers.  ",
        "\nThe third J.J. Abrams written film to show a planet being destroyed. Vulcan, in Star Trek (2009) Earth in Armageddon (1998) and The Republic's Hosnian System, as well as Starkiller Base in Star Wars: Episode VII - The Force Awakens (2015)  ",
        "\nRey (Daisy Ridley) is very much a mysterious character. We don't know much about the character or her origins. It is established in the film she had been abandoned on Jakku as a 9 year old girl and lives and works on Jakku as a desert scavenger and that she is a capable fighter and a capable pilot and she is strong in the force.  ",
        "\nThe second movie in the franchise to conclude with a moving camera shot (the circling aerial view of Rey and Luke on the island). Five of the six previous films have a stationary shot as their final scenes: The victory celebration on Naboo (Star Wars: Episode I - The Phantom Menace (1999)); Anakin & Padme's wedding (Attack of the Clones (2002)_); Uncle Owen & Aunt Beru with Luke on Tatooine (_Revenge of the Sith (2005)_); The victory ceremony on Yavin (Star Wars: Episode IV - A New Hope (1977)); Most of the cast on the forest moon (Star Wars: Episode VI - Return of the Jedi (1983)). The only earlier moving camera show was when the camera pulls back from Luke, Leia, and the droids on the medical frigate (Star Wars: Episode V - The Empire Strikes Back (1980)).  ",
        "\nDuring the assault on Starkiller Base, Poe Dameron enlists help from X-wing pilots with call signs Red 4 and Red 6. He skips Red 5 because this was Luke Skywalker's X-wing call sign.  ",
        "\nThere are actually two female Stormtroopers in this movie. Firstly, there is Captain Phasma which everyone is aware of. But there is also a second seen and heard speaking to Kylo Ren when they are searching for Rey on Starkiller Base  ",
        "\nWhen Rey and Finn are being pursued by the TIE fighters, the Falcon's lower gun turret becomes stuck in the 'forward' position, but later on it appears to be back in its regular position. However, as the Falcon flattens out of its dive after downing the last TIE, the turret can be seen clipping a piece of wreckage on the ground, which frees it.  ",
        "\nFirst Order's stormtroopers are presented as unnamed soldiers with a serial number and a prefix. In THX 1138 (1971) all the characters lack of name and surnames, but a serial number and a prefix.  ",
        "\nWhen Han Solo and Chewbacca split up to plant explosive charges on the Starkiller Base, each device is outfitted with a magnet to attach to a steel beam, a red light to indicate the charge is activated and each can be detonated by a remote switch. The exact same explosive device is used by Ethan Hunt when rescuing Lindsey Farris in Mission: Impossible III (2006), also directed by J.J. Abrams.  ",
        "\nSome people query why Han said he didn't believe in the existence of the Jedi and the force even though he was in Episodes 4-6, he is of course referring to the time before he met Luke and Obi Wan. On one of his first interactions with the old Jedi Obi Wan he says \"hokey religions and ancient weapons are no match for a good blaster at your side....\" His time with Luke has obviously changed his views and this is what he is referring to in this movie.  ",
        "\nOnly the third live-action Star Wars movie to not have the droid C-3PO in the final shot of the film. The first two were Star Wars: Episode I - The Phantom Menace (1999) and Star Wars: Episode III - Revenge of the Sith (2005). Only the second live-action Star Wars movie to not have R2-D2 in the final shot after Revenge of the Sith.  ",
        "\nEddie redmayne said in an interview that he auditioned for the role of Kylo Ren  ",
        "\nWhen R2-D2 awakes from his long dream, he shows an almost full Galaxy's map, which is completed by BB-8. This is the second time that a Star Wars' movie shows a galactic starchart after Star Wars: Episode II - Attack of the Clones (2002).  ",
        "\nWas released on Steven Spielberg's 69th birthday-12/18/15  ",
        "\nIn the final scene, Rey tracks down Luke to the real life 'Ghost Island', this is the same island that Charles flies over on his way to Paris, France in The Spirit of St. Louis (1957).  ",
        "\nBilling Displacement: Mark Hamill receives second billing despite only being in one short scene with no dialog at the very end of the film. Also, the first one after the original three stars is the villain (Adam Driver), instead of the protagonist that follows (Daisy Ridley). This is because billing is decided on star power. Mark Hamil, despite his limited screen time was the star of the original trilogy, and Adam Driver was the best known actor of the new cast. Whereas for Daisy Ridley this is her motion picture debut.  ",
        "\nStarkiller Base makes only one shot, destroying completely Hosnian System. In Star Wars: Episode IV - A New Hope (1977), Death Star makes another only one shot, completely destroying the planet Alderaan.  ",
        "\nHarrison Ford has requested that Han Solo should be killed off from the Star Wars series during the production of Star Wars: Episode V - The Empire Strikes Back (1980), because his character had already played its part. He also thought that it would give the character more depth. But George Lucas was against the idea.  ",
        "\nAdam Driver who plays Han Solo's son previously starred together with Oscar Isaac in the Coen Brothers movie Inside Llewyn Davis (2013). Another Coen Brothers alumni Alden Ehrenreich (from the movie Hail, Caesar! (2016)) is slated to play a younger Han Solo in the planned Disney Star Wars spin-off.  ",
        "\nChewbacca's reaction to seeing Han getting killed is similar to Episode I, when Obi-Wan witnesses Qui-Gon's death and Episode IV, when Luke witnesses Obi-Wan getting cut down by Darth Vader.  ",
        "\nIn their final battle Rey and Kylo Ren are struggling, as Ren feels he has won the light sabers are in a cross position and the reflection in Rens eyes form a cross which seems to calm Rey and give her the strength to beat Ren.  "
    ],
    "cameo": [
        "\nIko Uwais, Yayan Ruhian: the two martial arts stars from The Raid: Redemption (2011) and The Raid 2 (2014) play Razoo Quin-Fee and Tasu Leech, two of the mercenaries who confront Han Solo with an unpaid debt.  ",
        "\nStefan Grube: X-Wing pilot Yolo Ziff (who says, \"Black Leader, there's a brand new hole in that Oscilator\") is played by the man who edited the trailers for The Force Awakens.  ",
        "\nSimon Pegg: as the alien creature Unkar Plutt to whom Rey sells her scavenged parts.  "
    ],
    "spoiler": [
        "\nDaniel Craig: The Stormtrooper on whom Rey performs a Jedi Mind-Trick. Fans have given him the unofficial Stormtrooper number JB-007, referring to the character James Bond 007, a role he has played four times. The Lego Star Wars: The Force Awakens (2016) game finally revealed the stormtrooper's actual designation: FN-1824.  ",
        "\nAccording to Lucasfilm president Kathleen Kennedy, when Harrison Ford and Chewbacca set foot in the Millennium Falcon set, every person on set was stunned. Kennedy claims that there must have been 200 people who were completely quiet, due to the iconic presence of Ford and Mayhew back on Han Solo's ship.  ",
        "\nContinuing the tradition of the previous six films, there is no dialogue spoken in the final scene.  ",
        "\nMark Hamill was notably absent from the marketing of the film, and his image did not appear in the trailers or on the poster to mirror his absentee role in the story. He is present in the various trailers only as a voiceover rerecording of lines from Star Wars: Episode VI - Return of the Jedi (1983) and one shot from behind showing his mechanical hand reaching for R2-D2. Though he received second billing he only appears in the aforementioned shot from the trailer in Rey's Force vision and in the final scene of the film and has no dialogue in both appearances. His screentime also amounts to a mere 30 seconds.  ",
        "\nHarrison Ford admitted that he fought for Han Solo not to survive the events of Star Wars: Episode VI - Return of the Jedi (1983). He wanted Han to sacrifice himself in order to give him a little bottom, as he does in this film. Lawrence Kasdan, screenwriter for Episode VI and now The Force Awakens, supported the idea, but George Lucas objected because he didn't want any of the main cast to die.  ",
        "\nDuring the Falcon's second flight, Finn finds the Jedi training remote from Star Wars: Episode IV - A New Hope (1977). The helmet Luke wore during the training session can be spotted hanging from the side of the engineering station in the Falcon's main hold.  ",
        "\nMichael Arndt penned a script for this film based on an outline by George Lucas for his abandoned sequel trilogy to the original Star Wars saga. Though few details of this outline have been made public, author Dave Pollack confirmed that the story would focus on the building of the New Republic after the fall of the Empire, that Luke Skywalker, Princess Leia and Han Solo would all appear, and that the children of Luke, Leia and Han would serve as the main characters of the story. However, Arndt's script was ultimately rejected and a new script was penned by J.J. Abrams and Lawrence Kasdan.  ",
        "\nFrank Oz was happy to return as Yoda for the Force sequence, saying he would happily contribute to the role if it would improve the film.  ",
        "\nKylo Ren's real name is Ben Solo. Although it is never stated, he may have been named after Obi-Wan (Ben) Kenobi.  ",
        "\nLuke Skywalkers hiding place was filmed at Skellig Michael - an island off the south west coast of Ireland. The steps Rey climbs and the stone buildings she passes are part of a Christian monastery founded sometime between the 6th and 8th centuries.  ",
        "\nThe name of the First Order's weapon is \"Starkiller\". This was Luke Skywalker's original last name when George Lucas wrote the Star Wars story. The name was given to the character Galen Marek, who was Darth Vader's secret apprentice in the video game \"Force Unleashed,\" as a code name. It's Starkiller's actions in the game that leads to the creation of the Rebel Alliance.  ",
        "\nAs of this film, C-3PO and R2-D2 are the only characters to be in all eight live-action \"Star Wars\" films.  ",
        "\nWhen Obi-Wan Kenobi's voice is heard in the Force sequence, it is done by Kenobi's actors Alec Guinness and Ewan McGregor; voice actor James Arnold Taylor, who voiced Kenobi in Star Wars cartoons, had also recorded a line, but it was cut out to make way for Guinness.  ",
        "\nThe first shots fired by stormtroopers are right on target. On average, the troopers are superior marksmen, compared to previous films.  ",
        "\nMark Hamill (Luke Skywalker), Harrison Ford (Han Solo), Carrie Fisher (Princess Leia), Anthony Daniels (C-3PO), Kenny Baker (R2-D2), Peter Mayhew (Chewbacca), Tim Rose (Ackbar), and Mike Quinn (Nien Nunb) are the only actors to reprise their roles from the original \"Star Wars\" trilogy while Daniels, Baker and Mayhew are the only actors to reprise their roles from the prequel trilogy as well.  ",
        "\nWhen Kylo Ren is reading Rey's mind in the interrogation chamber, he says he sees her dreams of an island in the middle of an ocean.    In the final scene, Rey locates Luke on an island in the middle of an ocean.  ",
        "\nWhen Rey uses the Force to recover the lightsaber, besting Kylo Ren, the Force theme usually associated with Obi-Wan and Luke, \"Binary Sunset\", is played.  ",
        "\nThe prefix of First Order's stormtroopers is \"FN\", as Finn presents himself as FN-2187 to Poe Dameron. FN is an acronym for \"Footsoldier Number\".  ",
        "\nDuring his duel with Rey, Kylo Ren receives a large facial scar similar to one Anakin Skywalker receives in Star Wars: Episode III - Revenge of the Sith (2005).  ",
        "\nFinn's storm trooper reference number FN-2187, is a reference to the cell 2187 which was the number of Princess Leia's cell on the Death Star in Star Wars: Episode IV - A New Hope (1977).  ",
        "\nIn the climax of the first film in all three trilogies a major character who is serving as a mentor to the younger cast is killed by lightsaber at the hand of the film's primary antagonist. In Star Wars: Episode I - The Phantom Menace (1999) Qui-Gon Jinn (Liam Neeson) is killed by Darth Maul, in Star Wars: Episode IV - A New Hope (1977) Obi-Wan Kenobi (Alec Guinness) is killed by Darth Vader, and in this film Han Solo (Harrison Ford) is killed by Kylo Ren. Neeson and Ford were also the top billed actors in the films they died in, and while Guinness was not Ewan McGregor received top billing playing the same character in Episodes II and III.  ",
        "\nDuring her escape on the Starkiller base, Rey overhears a conversation between two stormtroopers who discuss the new \"BT-17\", which is a reference to the first movie Star Wars: Episode IV - A New Hope (1977), where Obi-Wan Kenobi overhears two stormtroopers having a similar conversation about the new BT-16 while disabling the tractor beam on the Death Star.  ",
        "\nAt the end of their duel, Finn manages to injure Kylo Ren's shoulder much like Luke did to Darth Vader on Cloud City. Kylo Ren even performs the same disarming maneuver on Finn right after.  ",
        "\nFinn is the fourth non-Force user after General Grievous (Star Wars: Episode III - Revenge of the Sith (2005)), Pre Vizsla (Star Wars: The Clone Wars (2008)) and Han Solo (Star Wars: Episode V - The Empire Strikes Back (1980)) to wield a lightsaber.  ",
        "\nThis is the first Star Wars film without a physical appearance from Anakin Skywalker or Obi-Wan Kenobi, though Kenobi's voice can be heard saying, \"Rey, these are your first steps\" at one point in the film.  ",
        "\nHan reveals that his son's real name is Ben. Harrison Ford has a son named Ben in real life. In the Expanded Universe, Luke has a son named Ben. Also in the Expanded Universe, Han and Leia have a son who turned to the Dark Side, named Jacen Solo.  ",
        "\nWILHELM SCREAM: A shot Stormtrooper when Poe and Finn are escaping in a Tie Fighter, the same scream used in the original \"Star Wars\" films.  ",
        "\nContrary to popular belief, the segment of Rey's Force vision with Kylo Ren and the Knights of Ren surrounded by dead bodies does not take place at Luke Skywalker's Jedi academy nor are the bodies Luke's pupils. Pablo Hidalgo of Lucasfilm's story group stated the scene takes place elsewhere and the man stabbed at the beginning of the sequence by Kylo Ren is a \"clan leader\".  ",
        "\nMark Hamill grew a beard and lost 50 pounds to play the older Luke Skywalker.  ",
        "\nKylo Ren's lightsaber has the crossguard blades due to being an ancient design that requires excess energy to be vented from the main shaft. The blade has an unsteady energy beam due to his lightsaber housing a cracked kyber crystal.  ",
        "\nIn the scene where Kylo Ren killed Han Solo, Harrison Ford himself said that he wanted the character to die an honourable and noble death. Ford has been trying to do this since the release of Star Wars: Episode V - The Empire Strikes Back (1980). J.J. Abrams agreed to this because Ford believed the character has had a good enough run in the series to where Solo could not be forgotten.  ",
        "\nThe first Star Wars film where R2-D2 does not save any of the main characters, though he does help provide Luke Skywalker's location near the end of the film.  ",
        "\nDirector's Trademark]: A \"mystery box\" - the box where Rey finds Luke's lightsaber. In a childhood trip to Lou Tannen's Magic Store, J.J. Abrams bought a \"mystery magic box\" - a box that has always remained a mystery. He's never opened it believing that, unopened, \"It represents infinite possibility. It represents hope. It represents potential. What I love about this box - and what I realized I sort of do, in whatever it is that I do - is I find myself drawn to infinite possibility and that sense of potential.\" Abrams has used \"mystery boxes\" in many of his projects, including Lost (2004), Cloverfield (2008), Super 8 (2011), and Star Trek Into Darkness (2013) to name a few.  ",
        "\nPoe's fake-out \"death\" after being rescued by Finn was originally supposed to be genuine, which actually made Oscar Isaac hesitant to take the role (as he'd played a character who suffered a similar fate in The Bourne Legacy (2012)). J.J. Abrams later decided to spare Poe after coming up with a way to temporarily write him out of the plot without having to kill him off.  ",
        "\nAs shown in photos, R2D2 has gathered rust around his head to show age.  ",
        "\nWhen Finn and Rey meet Han Solo in the Millennium Falcon, she questions if he was the same man who did the Kessel Run in 14 parsecs, being corrected by Han as he did the run in 12 parsecs. In Star Wars: Episode IV - A New Hope (1977), Han Solo boasted to Luke Skywalker and Obi-Wan Kenobi about he ran Kessel Run in 12 parsecs to justify the high speed of the Millennium Falcon. Since then a parsec is an unity of space, not time (1 parsec = 3.26 light-years), in the Expanded Universe it is explained that Kessel Run was a 18 parsec route used by contrabandists to avoid Galactic Empire's controls, in a sector of space hard to navigate due to several black holes in the path, and what Han made an alternate route to short it.  ",
        "\nWhen deciding what to do with Phasma after lowering the Starkiller's shields, Han Solo asks if there is a trash compactor nearby to hold her, a reference to the escape from the Death Star in Star Wars: Episode IV - A New Hope (1977).  ",
        "\nThroughout the movie, three major times, Carrie Fisher's daughter, Billie Lourd, is seen. The first is just behind Carrie when Han and Leia reunite for the first time in this movie. The second is when the Resistance is fighting the \"Weapon Planet\" and the First Order's fleets come out. The scene cuts back to the Resistance's headquarters where Billie Lourd says \"Are you seeing this?\". The third major time is at the very end when Rey leaves in the Falcon with Chewie and R2-D2, and BB-8 and the crowd of Resistance people are waving goodbye and cheering. You can see Billie Lourd slightly to the right of Carrie Fisher and in the front row of the crowd.  ",
        "\nWhen Luke appears, it continues the tradition of at least one \"Skywalker\" character appearing in each movie's closing shot before the credits. Anakin appears in Episodes I & II. Luke appears as a baby in Episode III, later as an adult (with Leia) in Episodes IV, V and VI.  ",
        "\nThe New York Daily News generated some contoversy when an edition of their comic strip Between The Lines leaked a spoiler about Han's death. The strip was published in their December 16, 2015 issue, a day before the film's theatrical release.  ",
        "\nThere are distinctive landscapes used in this film that pay homage to episodes IV, V, and VI. On Jakku where Rey lives, there is an expansive sandy desert just like the desert young Luke grew up in on Tatooine. Then on the Starkiller base the harsh, cold, snow-covered features similar to that of Hoth. Lastly, the lush forests in which Kylo Ren confronts Rey and Finn bears a similarity to the forest moon of Endor, home of the Ewoks.  ",
        "\nDuring the final battle of the film, in which Kylo Ren tries using the Force to obtain Luke Skywalker's lightsaber and Rey manages to do so instead, a \"new\" rendition of the Force Theme is heard as Rey claims the weapon. The piece that plays here is, in fact, a track from Star Wars: Episode IV - A New Hope (1977)'s soundtrack called \"Burning Homestead\", which was originally played during the scene where Luke finds that his aunt and uncle have been murdered by the Empire. Only a fifteen second segment of the three minute track is actually used, and it is spliced in with a track from the film's official soundtrack, \"The Ways of the Force\" - which incorporates the Force theme multiple times as well.  ",
        "\nChewbacca rescues Rey and Finn at the end of the last battle. This is the only time he ever sits in the pilot's seat and unambiguously flies the Falcon as the main pilot. Prior to this, he has always sat in the co-pilot's chair with either Han, Leia or Lando at the pilot controls.  ",
        "\nWhen Starkiller base is destroyed in the explosion you can see the distinctive concave dish of the Death Star in the bottom left 'corner' and the trench line horizontal across the globe.  ",
        "\nIn an early version of the script, Leia was supposed to die instead of Han Solo.  ",
        "\nContrary to popular opinion, Harrison Ford stated in an Entertainment Weekly Nov, 2015 interview that he was happy Lucas didn't listen to his request to be martyred in Return of the Jedi. He was very glad to be back on set of a new Star Wars film. Interestingly, in the making of segments of Force Awakens, Harrison Ford is careful in admitting the characters death moves the story forward but does not confirm or deny making cameo appearances in the future films. Possibly a ghost brought back by Luke Skywalker.  ",
        "\nThere was some dissatisfaction among fans about how Leia, in response to Han's death, chooses to hug Rey (whom she has never met before) instead of Chewbacca (as they both have known Han and each other for decades). In an interview with Slashfilm, writer/director J.J. Abrams explained that his intention was for Chewbacca to be concerned with giving the injured Finn medical attention. In his absence, Leia and Rey would feel a connection with each other through the Force, and therefore, in their grief, reach out to each other. Abrams acknowledged that he made a mistake by keeping Chewbacca in the shot, making it look as if Leia was passing him by, which was never his intention.  ",
        "\nThe Millennium Falcon is actually visible very briefly before the \"the garbage will do\" quote. As Rey and Finn run out of the desert compound, the camera pans very quickly to their right, showing the Falcon in passing.  ",
        "\nThis movie marks the first time we've seen Han Solo at the controls of the Millennium Falcon since Star Wars: Episode V - The Empire Strikes Back (1980).  ",
        "\nDuring their arrival on Starkiller Base, Finn says they'll stop the First Order base by using the Force. Han Solo angrily says the Force doesn't work like that. This a reference to Star Wars Rebels (2014) where Zeb would often mock Ezra telling him to use the Force to get out of a sticky situation with Ezra replying it doesn't work like that.  ",
        "\n25 minutes into the film, Kylo Ren and General Hux argue about the First Order Stormtroopers and Ren remarks that Supreme Leader Snoke should use a clone army. That was written as a nod to the past. In the prequel trilogy, it was revealed that the Imperial Stormtroopers were clones of bounty hunter Jango Fett and that they were apart of Supreme Chancellor (Later Emperor) Palpatine's evil plot to rule the galaxy and slay the Jedi and Palpatine ordered the clone troopers to betray and eliminate the Jedi and when Palpatine reorganized the Republic and formed the evil Galactic Empire and proclaimed himself as Emperor, the clone troopers became Imperial Stormtroopers.  ",
        "\nThe third J.J. Abrams written film to show a planet being destroyed. Vulcan, in Star Trek (2009) Earth in Armageddon (1998) and The Republic's Hosnian System, as well as Starkiller Base in Star Wars: Episode VII - The Force Awakens (2015)  ",
        "\nRey (Daisy Ridley) is very much a mysterious character. We don't know much about the character or her origins. It is established in the film she had been abandoned on Jakku as a 9 year old girl and lives and works on Jakku as a desert scavenger and that she is a capable fighter and a capable pilot and she is strong in the force.  ",
        "\nThe second movie in the franchise to conclude with a moving camera shot (the circling aerial view of Rey and Luke on the island). Five of the six previous films have a stationary shot as their final scenes: The victory celebration on Naboo (Star Wars: Episode I - The Phantom Menace (1999)); Anakin & Padme's wedding (Attack of the Clones (2002)_); Uncle Owen & Aunt Beru with Luke on Tatooine (_Revenge of the Sith (2005)_); The victory ceremony on Yavin (Star Wars: Episode IV - A New Hope (1977)); Most of the cast on the forest moon (Star Wars: Episode VI - Return of the Jedi (1983)). The only earlier moving camera show was when the camera pulls back from Luke, Leia, and the droids on the medical frigate (Star Wars: Episode V - The Empire Strikes Back (1980)).  ",
        "\nDuring the assault on Starkiller Base, Poe Dameron enlists help from X-wing pilots with call signs Red 4 and Red 6. He skips Red 5 because this was Luke Skywalker's X-wing call sign.  ",
        "\nThere are actually two female Stormtroopers in this movie. Firstly, there is Captain Phasma which everyone is aware of. But there is also a second seen and heard speaking to Kylo Ren when they are searching for Rey on Starkiller Base  ",
        "\nWhen Rey and Finn are being pursued by the TIE fighters, the Falcon's lower gun turret becomes stuck in the 'forward' position, but later on it appears to be back in its regular position. However, as the Falcon flattens out of its dive after downing the last TIE, the turret can be seen clipping a piece of wreckage on the ground, which frees it.  ",
        "\nFirst Order's stormtroopers are presented as unnamed soldiers with a serial number and a prefix. In THX 1138 (1971) all the characters lack of name and surnames, but a serial number and a prefix.  ",
        "\nWhen Han Solo and Chewbacca split up to plant explosive charges on the Starkiller Base, each device is outfitted with a magnet to attach to a steel beam, a red light to indicate the charge is activated and each can be detonated by a remote switch. The exact same explosive device is used by Ethan Hunt when rescuing Lindsey Farris in Mission: Impossible III (2006), also directed by J.J. Abrams.  ",
        "\nSome people query why Han said he didn't believe in the existence of the Jedi and the force even though he was in Episodes 4-6, he is of course referring to the time before he met Luke and Obi Wan. On one of his first interactions with the old Jedi Obi Wan he says \"hokey religions and ancient weapons are no match for a good blaster at your side....\" His time with Luke has obviously changed his views and this is what he is referring to in this movie.  ",
        "\nOnly the third live-action Star Wars movie to not have the droid C-3PO in the final shot of the film. The first two were Star Wars: Episode I - The Phantom Menace (1999) and Star Wars: Episode III - Revenge of the Sith (2005). Only the second live-action Star Wars movie to not have R2-D2 in the final shot after Revenge of the Sith.  ",
        "\nEddie redmayne said in an interview that he auditioned for the role of Kylo Ren  ",
        "\nWhen R2-D2 awakes from his long dream, he shows an almost full Galaxy's map, which is completed by BB-8. This is the second time that a Star Wars' movie shows a galactic starchart after Star Wars: Episode II - Attack of the Clones (2002).  ",
        "\nWas released on Steven Spielberg's 69th birthday-12/18/15  ",
        "\nIn the final scene, Rey tracks down Luke to the real life 'Ghost Island', this is the same island that Charles flies over on his way to Paris, France in The Spirit of St. Louis (1957).  ",
        "\nBilling Displacement: Mark Hamill receives second billing despite only being in one short scene with no dialog at the very end of the film. Also, the first one after the original three stars is the villain (Adam Driver), instead of the protagonist that follows (Daisy Ridley). This is because billing is decided on star power. Mark Hamil, despite his limited screen time was the star of the original trilogy, and Adam Driver was the best known actor of the new cast. Whereas for Daisy Ridley this is her motion picture debut.  ",
        "\nStarkiller Base makes only one shot, destroying completely Hosnian System. In Star Wars: Episode IV - A New Hope (1977), Death Star makes another only one shot, completely destroying the planet Alderaan.  ",
        "\nHarrison Ford has requested that Han Solo should be killed off from the Star Wars series during the production of Star Wars: Episode V - The Empire Strikes Back (1980), because his character had already played its part. He also thought that it would give the character more depth. But George Lucas was against the idea.  ",
        "\nAdam Driver who plays Han Solo's son previously starred together with Oscar Isaac in the Coen Brothers movie Inside Llewyn Davis (2013). Another Coen Brothers alumni Alden Ehrenreich (from the movie Hail, Caesar! (2016)) is slated to play a younger Han Solo in the planned Disney Star Wars spin-off.  ",
        "\nChewbacca's reaction to seeing Han getting killed is similar to Episode I, when Obi-Wan witnesses Qui-Gon's death and Episode IV, when Luke witnesses Obi-Wan getting cut down by Darth Vader.  ",
        "\nIn their final battle Rey and Kylo Ren are struggling, as Ren feels he has won the light sabers are in a cross position and the reflection in Rens eyes form a cross which seems to calm Rey and give her the strength to beat Ren.  "
    ]
}