{
    "common": [
        "The original cut of the film ran nearly four hours. The opening battle/Palpatine rescue alone ran over an hour. The extra footage of the Palpatine rescue scene is shown in the video game for this movie however.  ",
        "A ten year old Han Solo was going to appear during the Battle of Kashyyyk, as an orphan being raised by Chewbacca. He would have helped locate General Grievous, by finding part of a transmitter droid that was sending signals from Utapau, allowing Obi-Wan to find and confront the villain.  ",
        "The images of the volcanic eruption on Mustafar, was real footage of Mt. Etna in Italy, which was erupting at the time of production.  ",
        "Ewan McGregor and Hayden Christensen trained for two months in fencing and fitness, in preparation for their epic battle. As a result of their practice, the speed in which Kenobi and Vader engage the duel (in the completed film) is the speed in which it was filmed, and was not digitally accelerated.  ",
        "George Lucas allowed his friend Steven Spielberg to help design some sequences during pre-production. This was partly because Spielberg wanted the experience of using the 'pre-visualisation' techniques pioneered by ILM as he was going to use them for Guerra dos Mundos (2005). It was also because Lucas felt that his roles as Writer, Director, Executive Producer and Financier were taking up too much of his time and he needed another director to bounce ideas off. Spielberg's main contribution was in the climactic lightsaber duel between Obi-wan and Anakin.  ",
        "In the duel with Count Dooku, the imprisoned Palpatine originally had more dialogue, which he was to shout at Anakin. One of his lines pertained to Star Wars: Episódio II - Ataque dos Clones (2002), in which Palpatine exposed Dooku as paying the Tusken Raiders to kidnap, torture, and kill Shmi Skywalker.  ",
        "Liam Neeson has said that he recorded a cameo as Qui-Gon Jinn, which was to feature in a scene with Yoda, further explaining the concept of a Jedi communicating from beyond the grave. In the script, the dialogue (in which Qui-Gon is heard, not seen) appeared in the scene, in which Yoda is meditating on the secret asteroid base, just before Bail Organa informs him of Obi-Wan's return with Padmé. The scene does not appear in the deleted scenes section of the DVD, however, an unfinished version was included in the Blu-ray release box set.  ",
        "The Wookie costumes from this film, sport a new arterial system, that pumps ice cold water to help cool down the actor wearing the suit.  ",
        "The volcanic world of Mustafar was designed to look like George Lucas's vision of hell.  ",
        "The film's final shot is meant to mirror the famous shot of Luke Skywalker in Guerra nas Estrelas (1977). when he looked out on the two sunsets. It is the only shot of the film kept in widescreen format on the pan-and-scan DVD release.  ",
        "In 2007, Dr. Eric Bui, a psychiatrist in Toulouse, France, co-wrote a study that diagnosed Anakin Skywalker as having borderline personality disorder. When the authors reported their findings at the annual meeting of the American Psychiatric Association they stated that Skywalker fit the diagnosis criteria: difficulty controlling anger, stress-related breaks with reality, impulsivity, obsession with abandonment and a \"pattern of unstable and intense interpersonal relationships characterized by alternating between extremes of ideation and devaluation\".  ",
        "Ewan McGregor apparently asked if he could also play one of the Emperor's red-robed Imperial Guards. However, it's not known whether he did or not.  ",
        "In the opening sequence when the second Separatist ship is destroyed, a piece of debris flies into the clone Star Destroyer that shot it. That piece of debris is a kitchen sink. It was put in there by ILM as a joke from someone saying, \"We're throwing everything in the sequence, but the kitchen sink.\"  ",
        "For some shots during the birth scene, the infant Luke and Leia are portrayed by an animatronic puppet. As this puppet was operated by Ewan McGregor, the cast jokingly referred to it as \"Foamy-Wan Kenobi.\"  ",
        "The subtitle \"Revenge of the Sith\" is a play on the working subtitle for O Retorno de Jedi (1983), \"Revenge of the Jedi\". For episode VI, that title was abandoned because George Lucas determined that revenge was not a suitable attitude for a Jedi. Since this film, however, is about the triumph of the Sith, \"revenge\" is entirely appropriate.  ",
        "Apart from providing the voice of R2-D2, and the heavy breathing of Darth Vader, which he has done since Guerra nas Estrelas (1977), Ben Burtt provided the voices for every Battle Droid, Super Battle Droid and Buzz Droid in Revenge of the Sith.  ",
        "Every clone trooper in the film is CGI. Not a single real clone costume or helmet was featured in the film.  ",
        "Hayden Christensen gained 24 pounds for this film. He did so by eating six meals a day.  ",
        "The battle with the Wookies dates back to the earliest screenplays of Guerra nas Estrelas (1977). Originally, the Wookies were supposed to help the Rebels conquer an Imperial bunker. This idea was the basis for the Battle of Endor in O Retorno de Jedi (1983), but instead of using Wookies, George Lucas decided to use a smaller furry race, and call them Ewoks.  ",
        "One of the early concepts for General Grievous was a small child sitting on a floating chair, guarded by two IG88 droids from O Império Contra-Ataca (1980). George Lucas rejected this look, as a child would not be taken seriously as the deadliest hand-to-hand fighter the galaxy has seen, which is how he wanted Grievous to be portrayed. Instead, part of the final look for General Grievous' face was inspired by the shape of a bathroom detergent spray nozzle.  ",
        "The script, and the action figures, identify Anakin and Obi-wan as using the call-signs \"Red Five\" and \"Red Leader,\" respectively, during the opening battle. \"Red Five\" was also the call-sign for Luke Skywalker during the Death Star battle in Guerra nas Estrelas (1977). \"Red Leader\" was the call-sign of Wedge Antilles during the Death Star battle in O Retorno de Jedi (1983). Wedge was played by Ewan McGregor's uncle, Denis Lawson.  ",
        "Ewan McGregor had Lucasfilm make him a looped reel of all of Alec Guinness's scenes from the original movies so that he could study them.  ",
        "EASTER EGG: On the Options menu, press \"11 Enter 3 Enter 8 Enter\" (1138). Yoda will dance to hip-hop music.  ",
        "General Grievous's breathing problems in this film, as well as his exposed gut-sack (later exploited by Obi-wan), are caused by his brief encounter with Mace Windu in Star Wars: Clone Wars (2003). Mace Windu \"force-gripped\" Grievous as the General was making off with Palpatine, crushing the cyborg's chest panel. However, in Star Wars: The Clone Wars (2008), Grievous is seen to have always had breathing problems prior to this.  ",
        "There are over 2,200 visual effects shots in this film, more than Star Wars: Episódio I - A Ameaça Fantasma (1999) and Star Wars: Episódio II - Ataque dos Clones (2002) combined. Guerra nas Estrelas (1977) only had 350 such shots.  ",
        "The scene of Vader and Obi-wan using the \"force push\" on each other and knocking each other back originally had a force field graphic effect added, but George Lucas was not satisfied with its inclusion, thus the final shot did not have this effect added.  ",
        "Steven Spielberg, Francis Ford Coppola, Robert De Niro, Elijah Wood, Dean Devlin, and Liam Neeson are all known to have visited the set during filming.  ",
        "SERIES TRADEMARK: (dialogue) Obi-wan Kenobi says \"I have a bad feeling about this.\" during one of the first scenes of the film.  ",
        "A subscription service offered by Lucasfilm offered fans the chance to watch various stages of the production via a webcam.  ",
        "The highest-grossing movie of 2005.  ",
        "George Lucas originally intended have Peter Cushing reprise his role as Tarkin, years after his death, through the use of stock footage and digital technology. However, the idea was scrapped when the footage of Cushing was deemed unusable. Cushing's likeness would eventually be digitally inserted into Rogue One: A Star Wars Story (2016).  ",
        "All shots of C-3PO had the entire green screen set reflecting in his shiny gold armor, so digital effects artists, in post-production, had to digitally repaint C-3PO's armor frame by frame to remove any traces of the set.  ",
        "Total number of screen wipes: forty.  ",
        "This is the best received film in the Star Wars prequel trilogy.  ",
        "The Darth Vader mask for this film was rebuilt from scratch, using a new digital design to computer-lathe the base master, from which molds were made to cast the on-screen costume masks. The resulting masks are, for the first time in Star Wars history, truly symmetrical.  ",
        "The opening shot of the film lasts 76 seconds after the disappearance of the opening crawl, the longest of any Star Wars film.  ",
        "When Obi-wan finds General Grievous on Utapau, his first words are, \"Hello, there.\" In Guerra nas Estrelas (1977), when Obi-wan is first introduced, his words to R2-D2 are, \"Hello, there.\"  ",
        "Gary Oldman had agreed to be the voice of General Grievous, but pulled out of the film because it was being made using actors who are not part of the Screen Actor's Guild, of which Oldman is a member. The role was read by Duncan Young on set, and finally voiced by Matthew Wood, who, being a Lucasfilm employee, submitted his reading under the name of Alan Smithee.  ",
        "Ian McDiarmid has likened Palpatine in this film to Iago in William Shakespeare's play Othello, in the way he manipulates other characters to turn against each other, to their own destruction. McDiarmid has in fact played Iago on stage, as has Ewan McGregor. James Earl Jones has played Othello himself.  ",
        "Ian McDiarmid is doubled by a trained stuntman for his light-saber battles and more physically demanding shots, such as when Palpatine scrambles away from Mace Windu. As with Christopher Lee, computer effects were used to put the actor's face over the face of the stunt double. McDiarmid stated in numerous interviews that he was pleased that his character, even if not himself personally, was finally involved in some action sequences. For the sword fight between Windu and Sidious, however, the demands for camera angles and close-ups meant that stunt coordinator Nick Gillard had to teach the two actors the entire fight sequence, which was then shot partly with the stunt performers, and partly with Jackson and McDiarmid.  ",
        "Count Dooku speaks a total of four lines.  ",
        "The opera house dialogue between Anakin and Palpatine was originally going to be set in Palpatine's office. This idea was aborted, because the crew felt the characters had spent too much time there already.  ",
        "The final \"Star Wars\" film to be distributed by 20th Century Fox, which permanently holds the rights to the original Guerra nas Estrelas (1977) and hands over rights to the prequel trilogy and the final two installments of the original trilogy to Walt Disney Studios after May 2020, due to the Walt Disney Company's acquisition of Lucasfilm in 2012.  ",
        "After the opening battle, as the transport lands at the Senate building, in the bottom right-hand corner of the screen the Millennium Falcon (or a ship of similar model, Corellian Engineering Corporation YT series YT-1300 Transport) can be seen landing. In the Expanded Universe Star Wars story outside the movies, the YT-1300 has been confirmed as the Millenium Falcon, then named Stellar Envoy, long before Han Solo owned it.  ",
        "In Star Wars: Episódio II - Ataque dos Clones (2002), The look of the Clone troopers was a cross between the Mandalorian armour worn by Jango Fett and the storm troopers of Guerra nas Estrelas (1977), O Império Contra-Ataca (1980) and O Retorno de Jedi (1983). In this movie, the look of the clone troopers edges a bit more towards the look of the stormtroopers, but still retains a few elements of the Mandalorian armour.  ",
        "This is the only Star Wars movie that did not receive an Academy Award nomination for Best Visual Effects. The film's only nomination was for its make-up, which it lost to As Crônicas de Nárnia: O Leão, a Feiticeira e o Guarda-Roupa (2005)  ",
        "George Lucas initially said that no characters from the original movies would appear in Star Wars: Episódio III - A Vingança dos Sith (2005) apart from a baby Luke and Leia. However, the final movie also has Yoda, Obi-wan, Darth Vader, Palpatine, Chewbacca, Grand Moff Tarkin, Mon Mothma, R2-D2, C-3PO, Owen Lars, and Beru Whitesun/Lars, all of whom had appearances in Guerra nas Estrelas (1977), O Império Contra-Ataca (1980), or O Retorno de Jedi (1983).  ",
        "Hayden Christensen's cockpit shots were filmed from just outside the front window of his Jedi fighter. When he put his feet in the proper position for operating the fighter, his knees covered up his face, so he actually had to stick his legs out the end of the fighter to get the proper shot.  ",
        "Anthony Daniels (C-3PO) and Kenny Baker (R2-D2) are the only actors to appear in all of the original and prequel trilogy of \"Star Wars\" films. In second place is Frank Oz (Yoda) who appeared in five of the films, and in third place are James Earl Jones (voice of Darth Vader), Peter Mayhew (Chewbacca) and Ian McDiarmid (Supreme Chancellor Palpatine/Darth Sidious) who all appear in four of the films (unless one counts McDiarmid appearing in the 2004 DVD Special Edition of O Império Contra-Ataca (1980), in which he replaces Clive Revill, and reprises his role as Palpatine). The character of Obi-wan Kenobi also appeared in all six films, but was played by two different actors, Sir Alec Guinness and Ewan McGregor.  ",
        "Bail Organa's ship at the end is a real set. No blue screen work was used for those scenes.  ",
        "Ian McDiarmid recorded his scenes in the opera box on Coruscant, while suffering with a case of laryngitis.  ",
        "Anthony Daniels (without C-3PO costume), George Lucas and his daughters Katie Lucas and Amanda Lucas all have cameo appearances in the Opera scene, as well as several members of the special effects team (Rob Coleman and John Knoll amongst others) and a number of characters from earlier Star Wars movies.  ",
        "Christopher Lee filmed all of his scenes in two days. His filming schedule was moved up, to follow pick-up shots for O Senhor dos Anéis: O Retorno do Rei (2003) in New Zealand. All of his scenes were shot in front of a bluescreen, because the General's Quarters set had not yet been built.  ",
        "In the Wookie Army scene, there are only ten men in Wookie suits. They were repositioned multiple times, so the various shots could be combined with computer duplicated Wookies.  ",
        "According to Ahmed Best, there was a deleted scene where, before he crowned himself Emperor, Palpatine mockingly thanked Jar Jar Binks for granting him the emergency powers that allowed him to take over the Galaxy.  ",
        "Bai Ling had filmed several scenes for the movie that were later cut. There was a rumor that George Lucas cut these scenes after Bai Ling posed for Playboy. He has, however, denied this rumor, and has said that her scenes were cut eight months before she posed for Playboy, and the photos had nothing to do with his decision.  ",
        "The squadron of blue-striped clone troopers that Darth Vader leads into the Jedi Temple is called the 501st Legion, named after an organization of costume fans, also known as Vader's Fist. It's members include Mike Johansen and Jeffrey M. Miller.  ",
        "Francis Ford Coppola suggested Christopher Neil to George Lucas to be the dialogue coach. Lucas said that, given the emotional intensity of Star Wars: Episódio III - A Vingança dos Sith (2005), and the fact that he rarely has time to converse with the actors, it would be ideal for someone else to be there to get the strongest performances possible. Neil is in fact Coppola's nephew, and his father, Bill Neil (brother to Eleanor Coppola) worked for ILM during the production of the original trilogy.  ",
        "Christopher Lee was not initially available when the set for Palpatine's prison room on the Invisible Hand was first available to crew. Lee had to be digitally inserted to portions of the scene.  ",
        "The planet name \"Utapau\" appears in the early drafts of two previous Star Wars films. In Lucas's first draft of the very first movie, Utapau was the home planet of Kane, Anakin, and Deak Starkiller. The planet's desert terrain eventually became the planet Tatooine. Utapau was also the original name for Naboo, in the first draft of the screenplay for Star Wars: Episódio I - A Ameaça Fantasma (1999).  ",
        "Bail Organa's Corellian Corvette (the one with the white interior walls), the Tantive IV, then a CR70 model, was later retrofitted into a CR90 model and repainted. It was given to Princess Leia, and is the same ship that was captured at the beginning of Guerra nas Estrelas (1977).  ",
        "Aiden Barton, the toddler who portrayed the infant Luke Skywalker and Leia Organa, is the son of crew member Roger Barton.  ",
        "When Vader is being fitted with the helmet and subsequently breaks free of the shackles, George Lucas decided at the last minute to change the position of Vader's arms from up to down by his side (the original shot can be seen in the trailers). This is why, after breaking free from the bonds, Vader appears to raise his arms, when in fact it is the necessary transition from computer-generated arms to live action arms.  ",
        "As Yoda has been created digitally since Star Wars: Episódio II - Ataque dos Clones (2002), one of the puppets of Yoda created for the filming of Star Wars: Episódio I - A Ameaça Fantasma (1999) was used as a reference point for the ease of actors on-set during re-shoots in late summer 2004. Time in the Lucasfilm archives had not been kind to the puppet, which had acquired an incidentally comically contorted look on its face.  ",
        "This film marks Peter Mayhew's first return to the big screen since O Retorno de Jedi (1983). Between the two films, the only other movie he has done was Doragon bôru GT: Gokû gaiden! Yûki no akashi wa sû-shin-chû (1997), made for television, in which he voices one of the characters.  ",
        "A process of applying chrome to rubber was developed during production, allowing lightsaber hilts to be made of rubber, and used in stunts, without hurting the actors.  ",
        "The color palette of the movie was inspired by the paintings of Mark Rothko. George Lucas is a big fan of the painter.  ",
        "During production, the Mon Calamari opera was nicknamed \"Squid Lake\".  ",
        "One of only two Star Wars films without English subtitles to translate alien languages, the other being O Império Contra-Ataca (1980).  ",
        "The first time that we see two lightsabers of the same color fight and hit each other.  ",
        "According to the extra material, the climactic fight between Vader and Kenobi took upwards of 70,000 man hours to create - doing the math, this constitutes the work of one man for more than 25 years, given roughly normal hours per day (which probably no one ever did working on this production).  ",
        "This film more or less backs up Leia's claim in O Retorno de Jedi (1983) that she vaguely remembers her biological mother Padmé. Though her face is not seen before Padmé dies, she is seen with her eyes wide open when she is adopted by Bail Organa and his wife, implying Leia did see her mother's face. Luke's claim he has no memories of their mother is also supported as his eyes were closed after he was born, and was seen fast asleep when Kenobi hands him over to Beru Larrs at the end of the film.  ",
        "During the production of this film, Lucas also filmed a scene for O Império Contra-Ataca (1980). Ian McDiarmid, who first played Emperor Palpatine in O Retorno de Jedi (1983), was filmed in prosthetic make-up for use in the character's first appearance as a hologram in Empire, replacing the unknown woman and the voice of Clive Revill.  ",
        "The sequence in which Palpatine announces the Empire, while Anakin kills the Separatist leaders, was modeled after the famous \"Baptism Sequence\" in O Poderoso Chefão (1972). George Lucas was an Assistant Editor on that film, and the infant in that sequence was Sofia Coppola, who directed Hayden Christensen in As Virgens Suicidas (1999), and appeared in Star Wars: Episódio I - A Ameaça Fantasma (1999).  ",
        "Prior to the official announcement of this movie's subtitle to be \"Revenge of the Sith\", several rumors had circled about as to speculation of the final prequel's subtitle. Such speculations included possible subtitles as \"Rise of the Empire\" and \"The Creeping Fear\".  ",
        "Many viewers were surprised that Grievous could be trained in Jedi arts, much less wield a lightsaber. The answer is that when Grievous was constructed, he was given the blood of Jedi Master Sifo-Dyas who had a high midichlorian count. With this connection to the Force, Grievous had no difficulty learning Jedi ways. (This idea was dropped when Disney took over the canon; it is now accepted that even non-Force-sensitives can learn to wield lightsabers like Jedi with enough time and effort.)  ",
        "At the end of the film, Owen and Beru Larrs are seen looking at the twin suns of Tatooine before the closing credits. This scene is very similar to the scene in Star Wars: Episode IV - A New Hope (1977), where a fed up Luke Skywalker does the same thing, after he is refused by Owen to join the Academy.  ",
        "The role of Captain Antilles was originally offered to Denis Lawson, who played Wedge Antilles in the original trilogy.  ",
        "Anakin Skywalker is depicted three times on the film's official poster, more than any other character ever in a Star Wars feature: once portrayed by Hayden Christensen between Padmé and Obi-wan Kenobi (Ewan McGregor); once in a lightsaber fight with Obi-Wan, and once in the background, wearing his iconic Darth Vader helmet. Obi-Wan Kenobi is thus the runner-up with two depictions on the same movie poster.  ",
        "The scene of Anakin and Padmé at her Coruscant apartment, following his return to the planet early in the film, was added long after principal photography. The scene was intended to lighten the mood of an often \"dark\" film, and helped with pacing in the film.  ",
        "Hayden Christensen and Ewan McGregor began rehearsing their climactic lightsaber duel long before it was shot. They trained extensively with Stunt Coordinator Nick Gillard to memorize and perform their duel together.  ",
        "Clone Trooper Commander Cody was named in honor of the old comic hero Commando Cody.  ",
        "The name of the Varactyl that Obi-wan rides, is Boga. Boga is the name of a popular soft drink in Tunisia, in which George Lucas has filmed scenes. He even named Tatooine after a city in this country.  ",
        "Members of starwars.com's \"Hyperspace\" determined the look of Obi-wan Kenobi's new astromech droid R4-G9 by entering a poll on starwars.com between July and August of 2003. Presented with four different color schemes, they picked the bronze and copper design (not unlike the red domed R4-P17 from Star Wars: Episódio II - Ataque dos Clones (2002)). Naturally, this droid became one of the earliest action figures released for Star Wars: Episódio III - A Vingança dos Sith (2005).  ",
        "While sitting with Senator Organa in the Senate, listening to Palpatine declaring the new Empire, Padmé is wearing a circular hair decoration with an embossed wing pattern. This hair decoration is very similar to the rebel symbol, which Luke Skywalker is wearing on his helmet in the original trilogy.  ",
        "Although, all but one of her scenes were deleted from this film, Genevieve O'Reilly would later reprise her role as Mon Mothma in Rogue One: Uma História Star Wars (2016).  ",
        "Although no live-action location filming was done during principal photography, post-production filming was done in Thailand, Switzerland, and China to represent background plates for the Wookie planet of Kashyyyk.  ",
        "The medical droid (FX-7) that had repaired Luke Skywalker's hand in O Império Contra-Ataca (1980) is very similar to the droid (FX-9) shown working on Darth Vader in the Imperial rehabilitation center.  ",
        "Contrary to some belief, General Grievous, while trained in lightsaber combat by Dooku, knows nothing about the Force and is not Force-sensitive. By saying \"trained in the Jedi arts,\" he meant lightsaber combat only.  ",
        "When Vader has his life support suit put on for the first time his eyes are open and looks up as his mask is put on for the first time. But in the novelization, Vader is in a coma.  ",
        "The entire movie was shot on the Sony HDC-F950 High Definition camera, using Sony's HDCAM SR digital video format. The Camera itself retails for about 150,000 dollars. George Lucas has said that he plans to never shoot a movie on film again.  ",
        "Palpatine's line to Yoda, \"I have waited a long time for this moment.\", was a paraphrasing of what Greedo says to Han Solo in Episode IV, just before Han kills him.  ",
        "Tom Stoppard did a \"script polish\" for the film. Something that he's done on many Lucasfilm productions.  ",
        "The cans containing reels of the film were falsely marked with the title \"The Bridge\" for at least one pre-release screening.  ",
        "WILHELM SCREAM: Early on in the film during the dogfight, as a laser cannon is destroyed, one of the clone troopers running by is sent flying from the explosion and the Wilhelm Scream is heard. In the original showings in theaters a Wilhelm Scream was also heard when a clone is shot out of his fighter in the dogfight (as the camera makes the long shot watching him float through space) - while the shot remains; the scream was removed.  ",
        "George Lucas had previously promised fans that he would explain the mystery behind the erasure of the planet Kamino from the Jedi Archives in the previous film. However, Lucas abandoned this plot thread in order to devote more time to Anakin's story, leaving the matter unresolved on film. As a compromise, Lucas permitted author James Luceno to explain the mystery of Kamino's erasure and the origins of the Clone army in his expanded universe novel Labyrinth of Evil.  ",
        "The post-production department began work during filming and continued until a few weeks before the film was released.  ",
        "General Grievous has six minutes of screen time.  ",
        "This is the only film in the prequel trilogy, where C-3PO has gold-painted armor, like in the original trilogy, which he would've received sometime between the events of Episodes II and III.  ",
        "The fire trail when General Grievous' ship enters the Coruscant atmosphere was based on the fire trail during the ill-fated reentry of the Space Shuttle Columbia.  ",
        "John Williams passed on scoring Harry Potter e o Cálice de Fogo (2005) in favor of this movie and Memórias de uma Gueixa (2005).  ",
        "James Earl Jones (voice of Darth Vader), Anthony Daniels (C-3PO), Kenny Baker (R2-D2), Peter Mayhew (Chewbacca), Frank Oz (voice of Yoda), and Ian McDiarmid (Palpatine) are the only actors to reprise their roles from the original trilogy.  ",
        "The first teaser trailer, released on November 5, 2004, was code-named \"Sand Dogs\".  ",
        "Julius Caesar was a major influence behind Supreme Chancellor/Emperor Palpatine.  ",
        "Natalie Portman considers this film her favorite of the three Star Wars films she was in.  ",
        "The speed at which Anakin and Obi-Wan engage in their duel is mostly the speed at which it was filmed, although there are instances where single frames were removed to increase the velocity of particular strikes. An example of this occurs as Obi-Wan strikes down on Anakin after applying an armlock in the duel's first half.  ",
        "The Clone Trooper vehicles featured during the battle on Kashyyyk, are the ten-wheeled HV6 Juggernaut armored personnel carriers, while the mini two-legged AT-RT light walkers, and the AT-AP pod walkers are forerunners to the Imperial AT-ST mini walkers featured in O Império Contra-Ataca (1980) and O Retorno de Jedi (1983). In fact, the Juggernaut (also known as the Turbo Tank) is based on designs for the AT-AT Joe Johnston made for Star Wars: Episode V - The Empire Strikes Back (1980).  ",
        "As Anakin settles into Palpatine's viewing box, take a look at box adjacent to the Chancellor's. It is filled with notable names from Industrial Light & Magic. Seated from left to right (first row) are Visual Effects Producer Jill Brooks, Animation Supervisor Rob Coleman, Visual Effects Producer Janet Lewin, (and back row) Visual Effects Supervisor Roger Guyett, Visual Effects Producer Denise Ream, and Visual Effects Supervisor John Knoll. If you look at the shots that favor Palpatine during his wistful retelling of the Darth Plagueis yarn, you'll see Knoll sitting over his shoulder.  ",
        "The hot rod speeder car driven by Senator Bail Organa (Jimmy Smits), is based on the front of a Tucker, that is parked at Skywalker Ranch.  ",
        "George Lucas originally wanted Sammo Kam-Bo Hung to be the lightsaber fight choreographer.  ",
        "The character Mas Amedda is played by two actors in this film: Jerome St. John Blake and David Bowers. Blake played the role previously in Star Wars: Episódio I - A Ameaça Fantasma (1999). Likewise, Bowers played the role previously in Star Wars: Episódio II - Ataque dos Clones (2002). In this film, For the scenes shot in Australia during principal photography, Bowers played the part. For new scenes/pickups shot in England, Blake reprised the role.  ",
        "When specifically asked if he had supplied the voice of Darth Vader, either newly, or from a previous recording, James Earl Jones answered, \"You'd have to ask Lucas about that. I don't know.\"  ",
        "In the german dubbed version, the Super Battle Droid that gets electrified by R2-D2 has added dialogue. Right before he kicks R2-D2, he utters the line \"Du spinnst wohl!\" (\"Are you crazy?\"), making the scene more humorous and child-friendly.  ",
        "This film was originally going to be the final Star Wars film, until Star Wars: Episode VII - The Force Awakens (2015), since George Lucas at the time didn't have any plans for a sequel trilogy. But, it is the last live-action Star Wars film to be made by 20th Century Fox.  ",
        "While sitting together with Senator Organa in the Senate, listening to Palpatine declaring the new Empire, Padmé is wearing a circular hair decoration with an embossed wing pattern. This hair decoration is very similar to the Rebel symbol, which Luke Skywalker is wearing on his helmet in the original trilogy. This could be a visual reference to her being the first rebel, together with her comment about the death of liberty, as Palpatine seizes power as Emperor. Padmé is also giving birth to the two people who will play a significant role in overthrowing the Empire years later; her being the mother of the Rebel Alliance, is therefore further emphasized by her wearing this hair decoration.  ",
        "This is the only Star Wars film in which C-3PO has full, complete golden armor. In Star Wars: Episode I - The Phantom Menace (1999), he has no armor at all, in Star Wars: Episode II - Attack of the Clones (2002) he has dirty metal armor, in all of the original films he has a silver leg, and in Star Wars: Episode VII - The Force Awakens (2015), he has a red arm.  ",
        "The only film in the Guerra nas Estrelas (1977) canon not to have been released on NTSC VHS. It was, however, released on VHS in PAL regions.  ",
        "Star Wars: Episódio III - A Vingança dos Sith (2005) is a noticeably much darker film than the rest of the franchise, and the first one to be rated PG-13, instead of PG (PG-13 was a New MPAA Rating which had been introduced one year after the last film in the original trilogy, O Retorno de Jedi (1983) was released). Notably, this is likely due to the scene towards the end of the film, where Anakin's body is badly burned by lava, reducing his body to a crispy state without any hair, while he is hanging towards the edge with no legs, after losing the climatic duel against Obi-Wan, which was able to explain why he needed a strong mask to help him breathe, and robotic body parts.  ",
        "This film marks only the second appearance of Tantive IV, the ship, from which R2-D2 and C-3PO escaped, in an escape pod, at the beginning of Star Wars: Episode IV - A New Hope (1977).  ",
        "There exists concept art of a teenage Boba Fett killing Mace Windu during Order 66. Windu's killer was changed to Palpatine, as George Lucas felt Boba was far too young to believably pose a challenge to a Jedi Master.  ",
        "For the Kashyyyk environment, the art department turned to the much derided The Star Wars Holiday Special (1978) for inspiration.  ",
        "When Emperor Palpatine places his hand on the head of the defeated Anakin on Mustafar, it is directly reminiscent of when Obi -Wan came to Luke's aid after he was attacked by the Tusken raiders in \"A New Hope\".  ",
        "There is a rumor that 20th Century Fox is legally fighting Disney, to obtain the permanent rights to this film, and its predecessors, in spite of the fact that George Lucas sold the rights to the Star Wars name, concepts, and characters. This rumour is fuelled by the fact that the Star Wars films are 20th Century Fox's highest grossing franchise.  ",
        "After principal photography was complete in 2003, George Lucas made even more changes in Anakin's character, sharpening Anakin's motivations for turning to the dark side. Lucas accomplished this \"rewrite\" through editing the principal footage and filming new scenes during pick-ups in London in 2004. In the previous versions, Anakin had a myriad of reasons for turning to the dark side, one of which was his sincere belief that the Jedi were plotting to take over the Republic. Although this is still intact in the finished film, by revising and refilming many scenes, Lucas emphasized Anakin's desire to save Padmé from death. Thus, in the version that made it to theatres, Anakin falls to the dark side primarily to save Padmé.  ",
        "The newest addition to the Separatist Army, are the Crab Droids seen at the battle on Utapau, as well as the flying droid gunships, and the NR-N199 Tank Battle droids at the battle on Kashyyyk, which are in fact amphibious versions of the Corporate Alliance Tank Battle droids first mentioned in Star Wars: Episódio II - Ataque dos Clones (2002).  ",
        "The color pallette of the movie, was inspired by the paintings of Mark Rothko. George Lucas is a big fan of the painter.  ",
        "Over a period of several months, George Lucas would approve hundreds of designs that would eventually appear in the film. He would later rewrite entire scenes and action sequences to correspond to certain designs he had chosen. The designs were then shipped to \"pre-visualization\" to create moving CGI versions known as \"animatics\". Ben Burtt would edit these scenes with Lucas, in order to previsualize what the film would look like, before the scenes were even filmed. The pre-visualization footage featured a basic raw CGI environment with equally unprocessed CGI characters performing a scene (typically an action sequence). Steven Spielberg was also allowed to assist both the art and pre-visualization department's designs for several action sequences in the film. Later, the pre-visualization and art department designs were sent to the production department to begin \"bringing the film out of the concept phase\" by building the various sets, props, and costumes. To determine the required sets, Lucas analyzed each scene with the staff to see which moments the actors would come in most contact with the set, warranting the set to be constructed.  ",
        "John DiMaggio was rumored to be a candidate to voice General Grievous, because he had already voiced the character in the Star Wars: Clone Wars (2003) micro series.  ",
        "At the time it was filmed, the prop representing Bail Organa's speeder was built from the windshield to the rear. It wasn't until post-production that the front of the vehicle's design was chosen. Lucas based the hood and front of the speeder on the design of the Tucker automobile. Unlike the Tucker, Bail's speeder only has the 'cyclop's eye' headlamp, and not the outer two headlamps.  ",
        "The sequence of Anakin killing the Separatist leaders while Palpatine declares himself Emperor was modeled after the Baptism sequence from O Poderoso Chefão (1972). George Lucas was an uncredited assistant editor on that film, and cast members Roman Coppola and Sofia Coppola later appeared in Star Wars: Episódio I - A Ameaça Fantasma (1999). Sophia Coppola, who played the baby in that sequence, also directed Hayden Christensen in As Virgens Suicidas (1999). Corrado Gaipa, who played Don Tommasino, was also the voice of Obi-Wan Kenobi in the Italian dubbed version of the original films.  ",
        "A similar ascending table shot to introduce Darth Vader in the famous black suit was used with the monster in \"Horror Of Frankenstein\" (1970), in which the creature was played by David Prowse - the actor who wore the Vader outfit in the original trilogy.  ",
        "General Grievous has six fingers, including two opposable thumbs on each hand. He was designed this way so he could still wield a lightsaber once his arms split in two (leaving three fingers including a thumb on each of his four hands).  ",
        "The scene where Anakin turns to the dark side mirrors his redemption in O Retorno de Jedi (1983). Here, Mace Windu is being attacked by Papaltine with force lightning. Anakin, after some consideration, sides with Papaltine. In Return of the Jedi, Luke Skywalker is being attacked by Papaltine with force lightning. Anakin (now Darth Vader), after some consideration, sides with Luke. In both instances, this results in the other character falling to their death.  ",
        "Obi-Wan tells Anakin to \"Get out of here, there's nothing more you can do.\" In Guerra nas Estrelas (1977), Luke tells Wedge to \"Get clear, Wedge, you can't do any more good back there.\"  ",
        "In Czech dubbing, both Darth Sidious' apprentices have the same voice. Bohumil Svarc dubbed Darth Vader in the original trilogy, and in Revenge of the Sith as well. He was also the regular dubber for Christopher Lee, including Count Dooku.  ",
        "While shooting key dramatic scenes, George Lucas would often use an \"A camera\" and \"B camera\", or the \"V technique\", a process that involves shooting with two or more cameras at the same time in order to gain several angles of the same performance.[16] Using the HD technology developed for the film, the filmmakers were able to send footage to the editors the same day it was shot, a process that would require a full 24 hours had it been shot on film. Footage featuring the planet Mustafar was given to editor Roger Barton, who was on location in Sydney, Australia cutting the climactic duel. All other footage was forwarded to lead editor Ben Burtt at Skywalker Ranch in California.  ",
        "In the O Retorno de Jedi (1983) novelization, Anakin fell into a pool of lava. In this movie, he technically doesn't touch the lava, but still gets burned.  ",
        "A glimpse at the original backstory as seen in the novelization of O Retorno de Jedi (1983) (as well as strongly implied by Leia's lines in said film) shows us that her mother, who is now known to be Padmé, was originally meant to survive Anakin's turn.  ",
        "During the final battle between Anakin and Obi-wan, Obi-wan tells Anakin that he has the advantage because he is on higher ground. During a special episode, the Os Caçadores de Mitos (2003) learned to use surrogate light sabers and re-staged the battle. They concluded that there is little or no advantage to having the higher ground.  ",
        "The first shot of Pollis Massa, where there are two men in astronaut outfits looking over a base is a reference to 2001: a Space Odyssey (1968) where two astronauts are looking over a moon base.  ",
        "Christopher Lee's voice in the Italian version, was dubbed by Omero Antonutti.  ",
        "An internet hoax said John Rhys-Davies was considered for the role of General Grievous.  ",
        "Towards the end of Episode IV when Luke enters Vader's spaceship, Vader says \"I sense something. I haven't sensed something since...\" It was not revealed what he last sensed, but in the beginning of Episode III (which reverses Episode IV's story) Anakin says \"I sense Count Dooku.\" This is when both he and Obi-Wan arrive on the spaceship.  ",
        "A significant number of fans speculated online about the film's subtitle; rumored titles included Rise of the Empire, The Creeping Fear (which was also named as the film's title on the official website on April Fool's 2004), and Birth of the Empire.  ",
        "\"Unlimited Power\" is the name of a self-help book by Anthony Robbins.  ",
        "Padmé dies shortly after giving birth to Princess Leia, played in adulthood by Carrie Fisher. Fisher's real-life mother, Debbie Reynolds, died just a day after her.  ",
        "This is the only Star Wars movie in which C-3PO has complete golden armor. In The Phantom Menace (1999) he had no coverings at all, in Attack of the Clones (2002) he had grungy tin coverings, in all three original films and likely also including Rogue One (2016) he had one silver leg, and in The Force Awakens (2015) he had a red arm - although, the final shot he's in depicts him with a normal arm.  ",
        "During the Invasion of Kashyyyk, the sound of the Boga lizard that Obi-Wan rode on Utapau, can be heard when the wookies are charging into battle, if you listen very carefully.  ",
        "In his first appearance in the trilogy, Anakin Skywalker uses his piloting abilities to help stranded Jedi Qui-Gon Jinn and Obi-Wan Kenobi get off of Tattooine. In his second appearance, he falls in love with Padmé. In this, his final appearance, he uses the line \"Here's where the fun begins\", and is carried into surgery on a floating medical capsule. In the original trilogy, it is Han Solo who helps Obi-Wan and Luke escape Tattooine, who falls in love with Leia, and who is captured by Boba Fett and taken away on a floating carbonite block. Luke rescues them both from their fates in O Retorno de Jedi (1983). The similarities don't end there. Anakin turns to the Dark Side and becomes Darth Vader. While Han does not suffer that fate, his son later turns to the Dark Side and becomes Kylo Ren.  ",
        "Star Wars: Episódio III - A Vingança dos Sith (2005) is about Anakin Skywalker, a committed Jedi Knight succumbing to the Dark Side, when Supreme Chancellor Palpatine/Darth Sidious manipulates Anakin into pledging himself to the Dark Side, becoming Darth Vader. Natalie Portman (Padmé) would later star in the 2010 film Cisne Negro (2010) as a committed ballerina, who succumbs to her dark side when she is selected to play lead in a new production of Swan Lake. Portman won an Oscar for her performance in the film.  ",
        "Temuera Morrison and Rena Owen previously featured together in O Amor e a Fúria (1994) and its sequel What Becomes of the Broken Hearted? (1999).  ",
        "Anakin kills Count Dooku (Christopher Lee) with the light saber that is later given to his son, Luke (Mark Hamill). Hamill and Lee appeared together in Missão Águia - O Último Ataque (1989).  ",
        "Jett Lucas: The young Jedi that rushes from the Temple towards Bail Organa's speeder during the Jedi Purge is played by George Lucas' son.  ",
        "Nick Gillard: Stunt Coordinator as Cin Drallig, a Jedi Anakin kills in the video recording Obi-wan watched.  ",
        "George Lucas: The sound of General Grievous' coughing is George Lucas's own coughing. After developing a bad cough during production, Lucas had it recorded and used as Grievous' own cough.  ",
        "George Lucas: The blue skinned Baron Papanoida who appears just outside the entrance to Palpatine's private box at the Galaxies Opera House.  ",
        "George Lucas deliberately made the Darth Vader suit top-heavy (for instance adding weight on the helmet) to make Hayden Christensen not appear \"too accustomed\" to it in the movie.  ",
        "After their climactic duel, Obi-Wan can be seen picking up Anakin's lightsaber, which he later gives to Luke in Guerra nas Estrelas (1977).  ",
        "C-3PO has the last words in this movie (\"Oh, no!\") and the first words in Guerra nas Estrelas (1977) (\"Did you hear that? They've shut down the main reactor.\")  ",
        "Samuel L. Jackson (Mace Windu) said he knew that he must die in this film, so he told George Lucas he would only do the film, if Mace Windu goes out in a blaze of glory, and not \"like some sucka\". On an American late-night talk show, he confirmed that he did indeed have a meaningful death scene; and he does not go out like \"some punk\".  ",
        "This and Star Wars: O Despertar da Força (2015) are the only Star Wars films that does not contain R2-D2 in the final shot.  ",
        "Palpatine's lightsaber fight with the other Jedi reveals a completely different technique than has been seen before. The chancellor uses his weapon like a fencing foil, striking with the tip. Since the beam cuts through any substance, this makes even a small strike a killing blow. Except for Mace Windu, all the other Jedi use the edge, which requires a wide space to deliver a stroke. This explains why Palpatine was able to kill so many Jedi in such a short amount of time.  ",
        "The first draft of the script also explained the mystery surrounding Anakin's conception. In the confrontation scene between Anakin and Palpatine (where Palpatine confesses to Anakin he is Darth Sidious), he would also explain that his Master, Darth Plagueis, used the power of the Force to will the midichlorians to start the cell divisions that created Anakin. This explanation was later deemed unnecessary by George Lucas, and subsequently cut.  ",
        "Anakin was originally supposed to just watch the entire fight between Palpatine and the other Jedi Masters, with Palpatine even having stolen Anakin's lightsaber to do so. The entire fight would have had Anakin debating on which side he was going to choose. They even filmed it, but they figured that Anakin simply watching the fight meant that he had already made his choice, so it was refilmed to the current one. Further, the final fight between Windu and Palpatine was supposed to be an all-over-the-place masterpiece, but due to George Lucas wanting Ian McDiarmid to do as many of his own stunts as possible, it was reduced to, largely, Windu forcing Palpatine down the hallway and then a bit of a scrap in the office before Anakin showed up and both started talking to him.  ",
        "A short clip of Yoda arriving with his ship on the planet Dagobah for his self-chosen exile, was filmed, but not included in the final scene. According to producer Rick McCallum, he liked the shot very much, and he practically begged George Lucas to include it. However, Lucas preferred to keep the focus of the epilogue on the members of the Skywalker family (in order: Padmé, Anakin, Leia and Luke). Yoda's deleted scene is included as a bonus on the DVD release of the movie.  ",
        "Chancellor Palpatine's strategy for maintaining power is known to political scientists, and is called Perpetual War. He comes to power through conflict with the Trade Federation, gains greater privileges through the Clone War, and solidifies his position through war on the Jedi.  ",
        "The final scene on Tatooine, where Obi-Wan Kenobi delivers the infant Luke to his aunt and uncle, is often referred to as the \"Harry Potter scene\". Composer John Williams included a small 11-tone musical cue in the scene reminiscent of his score for Harry Potter e a Pedra Filosofal (2001). It can be heard when Obi-Wan arrives at Owen and Beru's house.  ",
        "In the scene where Darth Vader asks the Emperor about Padmé, the background music is the same music that was played during Qui-Gon Jinn's ceremonial cremation.  ",
        "During the lightsaber duel with General Grievous, it is briefly shown that the second hand that Obi-Wan cuts off is holding a duplicate of Obi-Wan's lightsaber. This is, in fact, the lightsaber belonging to Jedi master Shaak Ti, who is seen being killed by Grievous in a deleted scene set aboard the Invisible Hand during the Chancellor's rescue.  ",
        "In the first draft of George Lucas' screenplay, the movie was to open with a huge montage sequence showing the end of various battles of the Clone Wars on seven different planets across the Galaxy. Each planet was to be distinctly different from the other and was described as \"Bridge world\", '\"Ring World\", \"Crystal world\" and \"Kelp world\" amongst others. This idea evolved into the sequence where we see various Jedi dying at the hands of the Clones on different planets. Four planets made it into this montage: Mygeeto (Crystal world), Felucia, Saleucami and Cato Neimoidia (Bridge World).  ",
        "As the Darth Vader mask is being lowered onto Anakin's face at the end, there is a shot from his P.O.V. of the inside of the mask. There is a triangular silver item between the eyes of the mask. This item is the actuator (read-write mechanism) from a computer hard-disk drive.  ",
        "Body count: 171, the highest of any Star Wars film. This only counts bodies that are seen. If implied deaths are counted, the highest would be Star Wars: O Despertar da Força (2015) for its destruction of the Hosnian system and Starkiller Base.  ",
        "When Obi-Wan, Anakin, and Palpatine are landing near the politicians in the transport ship, in the shot where they fly to the landing pad, you can see the Millenium Falcon docking into the bay at the bottom left side of the shot.  ",
        "Near the end of the film, C-3PO is to get his memory wiped by Captain Antilles. This is most likely why C-3PO does not know Kenobi in Guerra nas Estrelas (1977) as well as not being familiar with his home planet Tatooine, or the Larrs who took him, and Shimi Skywalker in the previous film, in addition to not knowing much about Darth Vader and the Empire, prior to him joining the Dark Side.  ",
        "Silas Carson has two death scenes in this movie. One as Ki-Adi Mundi and the other as Nute Gunray. This is the third time he's died in a Star Wars movie. He was killed at the beginning of Star Wars: Episódio I - A Ameaça Fantasma (1999) where he played the pilot blown up in the Trade Federation hanger.  ",
        "On the Rebel Force Radio Facebook page, Pablo Hidalgo of Lucasfilm offered up a very interesting tidbit of information. He indicated that in the sound design of Padmé's death and Anakin's rebirth, there was a conscious effort to work with the heartbeats of the two star-crossed lovers. Both of their heartbeats stopped roughly at the same time. Both Padmé and Anakin actually died to bring Darth Vader to life. Once Vader's mask is put on and sealed up, his heartbeat is clearly heard again. The heartbeat stops for a moment, just too much of a moment to be considered natural. In this way, the death of Anakin and the birth Darth Vader are no longer figurative terms. This is an actual procedure that took place, with Padmé being collateral damage in Sidious's plan.  ",
        "This is the only film in the saga in which Darth Sidious uses a lightsaber.  ",
        "When Obi-Wan is leaving for Utapau, he turns to Anakin and says 'Goodbye, old friend. '. This seems appropriate as, not only is he saying goodbye for his mission, it is also the final time he sees Anakin before his turn to the Dark Side.  ",
        "Despite prominent billing as part of the cast, Christopher Lee is only in the film for three minutes.  ",
        "Anakins' neck-length hair and scar on his face are later copied by his grandson, Ben Solo/Kylo Ren, in Star Wars: O Despertar da Força (2015).  ",
        "Despite Anakin trying to prevent his wife Padmé from dying, he ironically causes her death, as it is implied Padmé died of a broken heart, due to Anakin becoming Darth Vader.  ",
        "The planet Mustafar's similarity to the Arabic name 'Mustafa' roughly translates to, 'the Chosen One.\"  ",
        "Leia being adopted, and raised by Senator Bail Organa explains why she has that surname, instead of Skywalker (though her surname had never been mentioned at anytime in the original trilogy). This was done to hide the fact that she and Luke are siblings.  ",
        "The Duels between Anakin and Count Dooku in Episodes II and III has a slight similarity between the Duels between Luke and Darth Vader in Episodes V and VI. In O Império Contra-Ataca (1980), Darth Vader severs Luke's arm during their duel, which Luke manages to do back in O Retorno de Jedi (1983). In Star Wars: Episódio II - Ataque dos Clones (2002), Count Dooku severs Anakin's arm (who receives a Robotic Arm after the Incident instead of getting his Flesh Arm reattached), which Anakin manages to do back in Star Wars: Episódio III - A Vingança dos Sith (2005) (severing both of Counbt Dooku's arms, and decapitating him soon afterwards).  ",
        "When Darth Vader is first revealed in his infamous black metal uniform, everything around it is black except white smoke in the middle of the scene. This reverses when the audience first sees Darth Vader in Episode IV, where everything around him is white, except black smoke in the middle of the scene.  ",
        "Episode III's story is in reverse order from Episode IV. The first act of Episode III starts with a rescue mission, continues with Anakin realizing his destiny in life, and ending with the Empire taking over. Episode IV opens with the Empire having taken over, continues with Luke realizing his destiny in life, and ending with a rescue mission.  ",
        "In the original screenplay, when Anakin joins the Dark Side, he is no longer referred to as \"Anakin\", only as \"Vader\".  ",
        "Padme's appearance in her funeral procession strongly mirrors Sir John Everett Millais's famous 'Ophelia' painting.  ",
        "During his climactic duel with Anakin, Obi-Wan states that the duel is over, implying that he won because he has the high ground. However, in Star Wars: Episode I - The Phantom Menace (1999), Obi-Wan defeats Darth Maul, while Maul had the high ground.  ",
        "When lightning comes out of Count Dooku's fingers towards the end of Episode II, Obi-Wan uses his lightsaber as a shield upwards where the lightning absorbs into the lightsaber. In Episode III, lightning comes out of Palpatine's fingers and Mace Windu uses his lightsaber as a shield sideways rather than straight up. This bounced the lightning back onto Palpatine.  "
    ],
    "cameo": [
        "Jett Lucas: The young Jedi that rushes from the Temple towards Bail Organa's speeder during the Jedi Purge is played by George Lucas' son.  ",
        "Nick Gillard: Stunt Coordinator as Cin Drallig, a Jedi Anakin kills in the video recording Obi-wan watched.  "
    ],
    "spoiler": [
        "George Lucas deliberately made the Darth Vader suit top-heavy (for instance adding weight on the helmet) to make Hayden Christensen not appear \"too accustomed\" to it in the movie.  ",
        "After their climactic duel, Obi-Wan can be seen picking up Anakin's lightsaber, which he later gives to Luke in Guerra nas Estrelas (1977).  ",
        "C-3PO has the last words in this movie (\"Oh, no!\") and the first words in Guerra nas Estrelas (1977) (\"Did you hear that? They've shut down the main reactor.\")  ",
        "Samuel L. Jackson (Mace Windu) said he knew that he must die in this film, so he told George Lucas he would only do the film, if Mace Windu goes out in a blaze of glory, and not \"like some sucka\". On an American late-night talk show, he confirmed that he did indeed have a meaningful death scene; and he does not go out like \"some punk\".  ",
        "This and Star Wars: O Despertar da Força (2015) are the only Star Wars films that does not contain R2-D2 in the final shot.  ",
        "Palpatine's lightsaber fight with the other Jedi reveals a completely different technique than has been seen before. The chancellor uses his weapon like a fencing foil, striking with the tip. Since the beam cuts through any substance, this makes even a small strike a killing blow. Except for Mace Windu, all the other Jedi use the edge, which requires a wide space to deliver a stroke. This explains why Palpatine was able to kill so many Jedi in such a short amount of time.  ",
        "The first draft of the script also explained the mystery surrounding Anakin's conception. In the confrontation scene between Anakin and Palpatine (where Palpatine confesses to Anakin he is Darth Sidious), he would also explain that his Master, Darth Plagueis, used the power of the Force to will the midichlorians to start the cell divisions that created Anakin. This explanation was later deemed unnecessary by George Lucas, and subsequently cut.  ",
        "Anakin was originally supposed to just watch the entire fight between Palpatine and the other Jedi Masters, with Palpatine even having stolen Anakin's lightsaber to do so. The entire fight would have had Anakin debating on which side he was going to choose. They even filmed it, but they figured that Anakin simply watching the fight meant that he had already made his choice, so it was refilmed to the current one. Further, the final fight between Windu and Palpatine was supposed to be an all-over-the-place masterpiece, but due to George Lucas wanting Ian McDiarmid to do as many of his own stunts as possible, it was reduced to, largely, Windu forcing Palpatine down the hallway and then a bit of a scrap in the office before Anakin showed up and both started talking to him.  ",
        "A short clip of Yoda arriving with his ship on the planet Dagobah for his self-chosen exile, was filmed, but not included in the final scene. According to producer Rick McCallum, he liked the shot very much, and he practically begged George Lucas to include it. However, Lucas preferred to keep the focus of the epilogue on the members of the Skywalker family (in order: Padmé, Anakin, Leia and Luke). Yoda's deleted scene is included as a bonus on the DVD release of the movie.  ",
        "Chancellor Palpatine's strategy for maintaining power is known to political scientists, and is called Perpetual War. He comes to power through conflict with the Trade Federation, gains greater privileges through the Clone War, and solidifies his position through war on the Jedi.  ",
        "The final scene on Tatooine, where Obi-Wan Kenobi delivers the infant Luke to his aunt and uncle, is often referred to as the \"Harry Potter scene\". Composer John Williams included a small 11-tone musical cue in the scene reminiscent of his score for Harry Potter e a Pedra Filosofal (2001). It can be heard when Obi-Wan arrives at Owen and Beru's house.  ",
        "In the scene where Darth Vader asks the Emperor about Padmé, the background music is the same music that was played during Qui-Gon Jinn's ceremonial cremation.  ",
        "During the lightsaber duel with General Grievous, it is briefly shown that the second hand that Obi-Wan cuts off is holding a duplicate of Obi-Wan's lightsaber. This is, in fact, the lightsaber belonging to Jedi master Shaak Ti, who is seen being killed by Grievous in a deleted scene set aboard the Invisible Hand during the Chancellor's rescue.  ",
        "In the first draft of George Lucas' screenplay, the movie was to open with a huge montage sequence showing the end of various battles of the Clone Wars on seven different planets across the Galaxy. Each planet was to be distinctly different from the other and was described as \"Bridge world\", '\"Ring World\", \"Crystal world\" and \"Kelp world\" amongst others. This idea evolved into the sequence where we see various Jedi dying at the hands of the Clones on different planets. Four planets made it into this montage: Mygeeto (Crystal world), Felucia, Saleucami and Cato Neimoidia (Bridge World).  ",
        "As the Darth Vader mask is being lowered onto Anakin's face at the end, there is a shot from his P.O.V. of the inside of the mask. There is a triangular silver item between the eyes of the mask. This item is the actuator (read-write mechanism) from a computer hard-disk drive.  ",
        "Body count: 171, the highest of any Star Wars film. This only counts bodies that are seen. If implied deaths are counted, the highest would be Star Wars: O Despertar da Força (2015) for its destruction of the Hosnian system and Starkiller Base.  ",
        "When Obi-Wan, Anakin, and Palpatine are landing near the politicians in the transport ship, in the shot where they fly to the landing pad, you can see the Millenium Falcon docking into the bay at the bottom left side of the shot.  ",
        "Near the end of the film, C-3PO is to get his memory wiped by Captain Antilles. This is most likely why C-3PO does not know Kenobi in Guerra nas Estrelas (1977) as well as not being familiar with his home planet Tatooine, or the Larrs who took him, and Shimi Skywalker in the previous film, in addition to not knowing much about Darth Vader and the Empire, prior to him joining the Dark Side.  ",
        "Silas Carson has two death scenes in this movie. One as Ki-Adi Mundi and the other as Nute Gunray. This is the third time he's died in a Star Wars movie. He was killed at the beginning of Star Wars: Episódio I - A Ameaça Fantasma (1999) where he played the pilot blown up in the Trade Federation hanger.  ",
        "On the Rebel Force Radio Facebook page, Pablo Hidalgo of Lucasfilm offered up a very interesting tidbit of information. He indicated that in the sound design of Padmé's death and Anakin's rebirth, there was a conscious effort to work with the heartbeats of the two star-crossed lovers. Both of their heartbeats stopped roughly at the same time. Both Padmé and Anakin actually died to bring Darth Vader to life. Once Vader's mask is put on and sealed up, his heartbeat is clearly heard again. The heartbeat stops for a moment, just too much of a moment to be considered natural. In this way, the death of Anakin and the birth Darth Vader are no longer figurative terms. This is an actual procedure that took place, with Padmé being collateral damage in Sidious's plan.  ",
        "This is the only film in the saga in which Darth Sidious uses a lightsaber.  ",
        "When Obi-Wan is leaving for Utapau, he turns to Anakin and says 'Goodbye, old friend. '. This seems appropriate as, not only is he saying goodbye for his mission, it is also the final time he sees Anakin before his turn to the Dark Side.  ",
        "Despite prominent billing as part of the cast, Christopher Lee is only in the film for three minutes.  ",
        "Anakins' neck-length hair and scar on his face are later copied by his grandson, Ben Solo/Kylo Ren, in Star Wars: O Despertar da Força (2015).  ",
        "Despite Anakin trying to prevent his wife Padmé from dying, he ironically causes her death, as it is implied Padmé died of a broken heart, due to Anakin becoming Darth Vader.  ",
        "The planet Mustafar's similarity to the Arabic name 'Mustafa' roughly translates to, 'the Chosen One.\"  ",
        "Leia being adopted, and raised by Senator Bail Organa explains why she has that surname, instead of Skywalker (though her surname had never been mentioned at anytime in the original trilogy). This was done to hide the fact that she and Luke are siblings.  ",
        "The Duels between Anakin and Count Dooku in Episodes II and III has a slight similarity between the Duels between Luke and Darth Vader in Episodes V and VI. In O Império Contra-Ataca (1980), Darth Vader severs Luke's arm during their duel, which Luke manages to do back in O Retorno de Jedi (1983). In Star Wars: Episódio II - Ataque dos Clones (2002), Count Dooku severs Anakin's arm (who receives a Robotic Arm after the Incident instead of getting his Flesh Arm reattached), which Anakin manages to do back in Star Wars: Episódio III - A Vingança dos Sith (2005) (severing both of Counbt Dooku's arms, and decapitating him soon afterwards).  ",
        "When Darth Vader is first revealed in his infamous black metal uniform, everything around it is black except white smoke in the middle of the scene. This reverses when the audience first sees Darth Vader in Episode IV, where everything around him is white, except black smoke in the middle of the scene.  ",
        "Episode III's story is in reverse order from Episode IV. The first act of Episode III starts with a rescue mission, continues with Anakin realizing his destiny in life, and ending with the Empire taking over. Episode IV opens with the Empire having taken over, continues with Luke realizing his destiny in life, and ending with a rescue mission.  ",
        "In the original screenplay, when Anakin joins the Dark Side, he is no longer referred to as \"Anakin\", only as \"Vader\".  ",
        "Padme's appearance in her funeral procession strongly mirrors Sir John Everett Millais's famous 'Ophelia' painting.  ",
        "During his climactic duel with Anakin, Obi-Wan states that the duel is over, implying that he won because he has the high ground. However, in Star Wars: Episode I - The Phantom Menace (1999), Obi-Wan defeats Darth Maul, while Maul had the high ground.  ",
        "When lightning comes out of Count Dooku's fingers towards the end of Episode II, Obi-Wan uses his lightsaber as a shield upwards where the lightning absorbs into the lightsaber. In Episode III, lightning comes out of Palpatine's fingers and Mace Windu uses his lightsaber as a shield sideways rather than straight up. This bounced the lightning back onto Palpatine.  "
    ]
}