{
    "common": [
        "Just before Anakin goes to search for his mother on Tatooine, he has a conversation with Senator Amidala. The camera pans to their shadows as they talk, and Anakin's resembles that of Darth Vader. According to the DVD commentary, the Vader-like shadow that Anakin casts was not a special effect but a coincidence.  ",
        "When Anakin is slaughtering the Tusken Raiders, Qui-Gon's voice can be heard in the background. This is no accident. According to Star Wars canon, Qui-Gon's Force-Ghost tried to stop Anakin's rage, but failed.  ",
        "According to George Lucas, Obi-Wan's hiding in Geonosis' asteroid field teaches young Boba Fett a lesson that he uses to his advantage during adulthood. Having learned how Obi-Wan hid from him and his father, Boba Fett knows the trick Han Solo is using to hide in O Império Contra-Ataca (1980) and is able to find him.  ",
        "According to Star Wars canon, the Tusken Raiders who kidnapped Shmi Skywalker were paid to do so by Count Dooku. Dooku had done this on orders from his Master, Darth Sidious.  ",
        "Hayden Christensen claimed to have greatly enjoyed filming the bar scene, because it was all a real set, and not just a blue screen.  ",
        "Samuel L. Jackson has said that the words \"Bad mother-f*cker\" are engraved on the hilt of his lightsaber.  ",
        "When Jango Fett gets into his ship after his fight with Obi-Wan, he bangs his head on the partially open door. This was intentional, and is a reference to a famous goof from Guerra nas Estrelas (1977), where a stormtrooper accidentally bangs his head on a door.  ",
        "The Senate votes to give the Supreme Chancellor sweeping emergency powers to go to war against the Separatist forces. This is the same ploy Adolf Hitler used to gain similar dictatorial power in mid-1930s Germany.  ",
        "During rehearsals and filming of Count Dooku's lightsaber battle scenes, a small model of Yoda was used as a reference point for Christopher Lee. The model however was slightly altered to have vampire fangs, to which Lee's amused response was \"I will not comment on that. I didn't think you would do this to me, George!\" The fangs were likely a joke at Lee's expense for his performance as Count Dracula in O Vampiro da Noite (1958) and several other Hammer Studios horror films.  ",
        "Like Ewan McGregor did in Star Wars: Episódio I - A Ameaça Fantasma (1999), Hayden Christensen made \"lightsaber noises\" the first time he was handed one in rehearsal. After chuckling at the young star's antics, George Lucas informed him that they probably had people in Sound Effects, who could do a better job in post-production.  ",
        "Due to much of the animosity aimed towards Jar-Jar Binks in Star Wars: Episódio I - A Ameaça Fantasma (1999), the working title of Episode II was \"Jar-Jar's Big Adventure\".  ",
        "The only Star Wars film that was not the top grossing film of the year in North America. It placed third after Homem-Aranha (2002) and O Senhor dos Anéis: As Duas Torres (2002).  ",
        "This movie and Rogue One are the only Star Wars movies where the camera shot tilts up after the opening scroll to start the scene. In all other Star Wars movies, the camera shot tilts down after the scroll.  ",
        "The fight between Yoda and Dooku was envisioned quite differently. Originally, Yoda was to come in and immediately have the fight with Dooku, but many of the creative team felt that was too quick a transition for Yoda, and the audience needed to feel the power of good and evil going against each other, so George Lucas added in the preamble to the fight with the blue lightning and rock falls, because it showed how powerful Yoda was. The light saber battle was a culmination of all that energy. There was also footage shot of Dooku using either Obi-Wan's or Anakin's light saber in addition to his own against Yoda, but these moves did not make the final cut.  ",
        "With an estimated budget of 120 million dollars, this was the most expensive Star Wars film until Episode VII: The Force Awakens (2015) with an estimated budget of 200 million dollars.  ",
        "EASTER EGG: In the \"Options\" menu, key in \"11\" enter, \"3\" enter, \"8\" enter, and you will see bloopers, mostly of Hayden Christensen falling during various takes of the film.  ",
        "Running at 142 minutes; this is the longest of the \"Star Wars\" films.  ",
        "The character Aayla Secura, played by Amy Allen, was not created by George Lucas. Aayla Secura first appeared in the nineteenth issue of Dark Horse Comics' \"Star Wars: Republic\" series (part one of \"Star Wars: Twilight\"). Lucas was so impressed with the character, that he decided to have her in the film.  ",
        "In DVD commentaries, the crew claims that the fight between Jango Fett and Obi-Wan Kenobi was intentionally made different from the other fights in the films, in that it focused more on physical and hand-to-hand combat, something not done in the films often.  ",
        "When Obi-Wan (Ewan McGregor) and Anakin (Hayden Christensen) enter the sports bar on Coruscant to search for the assassin Zam Wesell (Leeanna Walsman), several actors and crew members from the \"Star Wars\" movies can be spotted, including Ahmed Best, (voice of Jar Jar Binks) and Anthony Daniels (C-3P0). Also visible in the crowd are R2D2 handler Don Bies and his Droid team consisting of Zeynep Selcuk, Justin Dix and Trevor Tighe.  ",
        "The Jedi Archives are modeled on the Trinity College library in Dublin, Ireland.  ",
        "Although Count Dooku (Christopher Lee) is the main villain and is mentioned in the opening crawl, he does not make his first appearance until 76 minutes into the film.  ",
        "When Watto is seen on Tatooine, flies are buzzing around him. The crew had recorded sound effects of flies buzzing around horse dung at Skywalker Ranch, and they were happy to finally be able to use the sound they had recorded.  ",
        "This is the first \"Star Wars\" film in which Yoda (Frank Oz) is entirely computer-generated. After tests to see if a CGI Yoda was possible, failed during pre-production of Star Wars: Episódio I - A Ameaça Fantasma (1999), Rob Coleman and his team came back three years later, and presented a reel to George Lucas showing him a CGI Yoda performing the scene in O Império Contra-Ataca (1980) where he explains the nature of the Force to Luke Skywalker. Lucas was impressed and decided the technology was right for a CGI Yoda.  ",
        "Several subtle visual clues were incorporated into the design of the shots to help audiences keep track of who's who. The good guys - the Republic Clones Troopers - always move from screen right to screen left, while the Separatist Battle Droids moved from screen left to screen right. The sun is behind the clones, resulting in a gloomier sky behind the Separatists. Finally, the missile contrails were color-coded to denote allegiance: the Republic rockets leave clean white trails, while the villains launch missiles that leave noxious black/purplish exhaust.  ",
        "During the Speeder chase on Coruscant, when Zam heads straight down the cityscape you can see an X-Wing being chased by three Tie Fighters in the bottom left of the shot.  ",
        "Actors auditioning for the part of Anakin included Ryan Phillippe, Paul Walker, Colin Hanks, and Jonathan Brandis. In the end Hayden Christensen got the part, primarily because he and Natalie Portman \"looked good together\".  ",
        "The final shot of Padmé and Anakin looking out on the lake in Naboo with R2-D2 and C-3PO to their right is a reproduction of the final shot of O Império Contra-Ataca (1980), where Luke and Leia are looking out into space from the ship with R2-D2 and C-3PO to their right.  ",
        "Anthony Daniels (C-3PO), Kenny Baker (R2-D2), Frank Oz (Yoda), and Ian McDiarmid (Palpatine) are the only actors to reprise their roles from the original trilogy.  ",
        "After making this film, Ewan McGregor appeared in Falcão Negro em Perigo (2001), which required him to be clean-shaved and to have an extremely close buzz cut. New scenes with Obi-Wan Kenobi were then added to this film in post-production. Since McGregor had not had enough time to regrow his hair or a full beard, he had to be fitted with a hairpiece and prosthetic beard, which is often easily distinguished from his natural hair, as it appears in the rest of the film. These scenes include the conversation between Obi-Wan and Anakin in the elevator; the exchange concerning the 'changeling' in the Outlander club; the Jedi temple talk between Obi-Wan, Mace, and Yoda, and his interrogation by Count Dooku.  ",
        "George Lucas's daughter Katie Lucas appears as a purple Twi'lek in the nightclub scene. Her older sister Amanda Lucas can also be spotted in the background when Obi-Wan and Anakin discuss the 'changeling' Youngest sibling Jett Lucas appears as a young Jedi in the Jedi Archive scene with Obi Wan Kenobi and the librarian Jocasta Nu.  ",
        "George Lucas is thought to have chosen the name \"Jango\" as a reference to the titular character of the movie Django (1966). Like Django, Jango is also a loner mercenary with a harsh past.  ",
        "This film marks the first time Yoda uses a lightsaber. Previously the puppet had problems grasping his own lightsaber and making it look realistic.  ",
        "Dex's backstory was that he was a former mercenary and explorer. He and Obi-Wan had served together on a couple of missions.  ",
        "DIRECTOR_TRADEMARK(George Lucas): [1138]: The LEDs on the back of the clone trooper helmets display a serial number. Although illegible, they all read \"THX 1138\".  ",
        "Hugh Quarshie was originally slated to reprise his role as Captain Panaka from Star Wars: Episódio I - A Ameaça Fantasma (1999). However, he turned down the offer after Lucasfilm refused to let him read the whole script, so his character was written out, and replaced with a newly created chief of Security Captain Typho, portrayed by Jay Laga'aia.  ",
        "Cans (containing reels) were shipped to theaters under the code name \"Cue Ball\".  ",
        "The death-sticks that the pusher tries to sell Obi-Wan were a hallucinogenic drug. The drug's name is an obvious reference to cigarettes. According to George Lucas, much like with cigarettes, with each dose: the user's life was shortened, the successive dosages took away larger chunks from their lifespan, and the desire for a more intense reaction increased. Lucas inserted this personally into the film, due to his strict views concerning smoking.  ",
        "According to Rick McCallum, a scene was shot with Obi-Wan and Amidala swinging from one area to another, much like Luke and Leia in Guerra nas Estrelas (1977), but the scene was cut.  ",
        "Instead of creating a new C-3PO suit for the film, the designers repainted and \"aged\" one used in the original trilogy.  ",
        "According to Animation Director Rob Coleman, not a single clone trooper suit was ever built. Every clone trooper seen in the film is computer-generated, with motion capture performed by ILM employees, wearing only the helmet and sometimes the footwear of the suit. The rest is completely computer-generated.  ",
        "Terence Stamp declined to reprise his role as Chancellor Valorum, saying that \"Actors prefer to work with actors\".  ",
        "According to visual-effects supervisor John Knoll, a big cow-like creature that Anakin and Padmé frolic around in the fields with, can be seen in the asteroid belt that Obi-Wan flies through. One asteroid has legs.  ",
        "Most of the clone troopers wear plain white armor; some of the more senior troops' armor has added colored trim on the helmet and arms. The colors denote rank as follows: Green = sergeants, Blue = lieutenants, Red = captains, Yellow = commanders (the Jedi serve as the Clones' generals). Note that pilots also wear yellow trim, but their armor design differs from other Clones.  ",
        "Many of the explosions of the final ground battle were real ones rather than digital fireballs. They were shot in the backlot at ILM. Explosions were such in demand that the compositors dipped into the library of explosions built for the Naboo plains battle from Star Wars: Episódio I - A Ameaça Fantasma (1999) to fill out the shots.  ",
        "Although both Nute Gunray (Silas Carson) and Shmi Skywalker (Pernilla August) were both major supporting characters in Star Wars: Episódio I - A Ameaça Fantasma (1999), neither character's name was given in dialogue until this film.  ",
        "The entire Aggressive Negotiations conversation during the dinner scene between Anakin and Padme was ad-libbed by Hayden Christensen and Natalie Portman at George Lucas' request, due to his not being happy with the romantic dialogue he wrote for that scene.  ",
        "Since the special effects model of Boba Fett's Slave I was on loan to the Smithsonian at the time of filming, a computer-generated version of the ship (with a different color scheme) had to be created.  ",
        "This was the first film to have an \"on-location\" film shown once a week to document the shooting process. After the success of this feature, other films adopted the same process.  ",
        "The design for Anakin's lightsaber was based on Darth Vader's lightsaber prop as seen in Guerra nas Estrelas (1977). Count Dooku's lightsaber prop is curved and is based on a rapier, with an Arabian flare. Obi-Wan uses a lightsaber prop, that is a duplicate of the one he lost in battle, at the end of Star Wars: Episódio I - A Ameaça Fantasma (1999).  ",
        "The look of the Republic Clone Troopers is a combination of the Mandalorian armor worn by Jango Fett (later Boba Fett) and the armor worn by the Imperial Storm Troopers of episodes IV, V and VI.  ",
        "Where Luke Skywalker's T-16 Skyhopper sat in the garage of the Lars homestead in Guerra nas Estrelas (1977), a smaller ship with a similar design sits parked there in this film. Also, Luke's landspeeder is visible in the garage in this film.  ",
        "To efficiently deliver a realistic explosion for the gunship that gets shot out of the sky, ILM built a mandrill of the vessel. A mandrill is an all-blue practical miniature. It was rigged with pyrotechnics and blown up. The properly shaped explosion was digitally extracted, interacting with the properly shaped wreckage, and digital artists replaced the blue gunship with the computer-generated one.  ",
        "The Clone Troopers' rifle design is based on the German MG-42 machine gun.  ",
        "The Kaminoans have an appearance more reminiscent of \"traditional\" extraterrestrials than other aliens in the Star Wars. George Lucas has stated this is an homage to his friend Steven Spielberg and his work on Contatos Imediatos do Terceiro Grau (1977).  ",
        "C-3PO (Anthony Daniels) was originally to have made his first appearance still in skeletal form. In post-production, George Lucas decided to have C-3PO be complete throughout the film.  ",
        "After the mixed critical response to Star Wars: Episódio I - A Ameaça Fantasma (1999), George Lucas was hesitant to return to the writing desk. In March 2000, just three months before the start of principal photography, Lucas finally completed his rough draft for Episode II. Lucas continued to iterate on his rough draft, producing a proper first and second draft. For help with the third draft, which would later become the shooting script, Lucas brought on Jonathan Hales, who had written several episodes of O Jovem Indiana Jones (1992) for him, but had limited experience writing theatrical films. The final script was completed just one week before the start of principal photography.  ",
        "The release year of this film also coincided with the 25th anniversary of the release of Guerra nas Estrelas (1977).  ",
        "In the arena, Senator Amidala's gun makes the distinctive sound of a .44 Magnum, a reference to this sound accidentally being left in the sound mix when Princess Leia shoots over the chasm in the special edition of Guerra nas Estrelas (1977)  ",
        "Ben Burtt, during production on the film, tried to compile all of the sound effects from every other Star Wars movies when working on this one onto a single database - he estimated that there were roughly 5,000 sound effects up to that time. He was disappointed to find that many sound effects from the older films had not been properly preserved.  ",
        "The arrogant librarian at the Jedi Archives says \"If an item doesn't appear in our records, it does not exist!\" This is a variation of the slogan of the Pacific Bell Yellow Pages.  ",
        "During the final battle, nearly ninety percent of the music heard, is temp-tracked from John Williams' score of Star Wars: Episódio I - A Ameaça Fantasma (1999). This is most likely because, like the Droid factory sequence, the Clone battle was a late addition to the film.  ",
        "Sebulba, the champion podracer from Star Wars: Episódio I - A Ameaça Fantasma (1999), seems to appear during the Coruscant chase and in Dex' Diner (in fact there are two of his species in this scene). However, the first Dug has been identified as Taxi cab driver 'Seboca' and his dinner date is named 'Rednax'.  ",
        "Only the even-numbered films of the original trilogy referred to important plot points in all capital letters during the opening crawl (e.g., DEATH STAR, GALACTIC EMPIRE). This film continues the tradition with its reference to the ARMY OF THE REPUBLIC. The first and third prequels do not do this.  ",
        "In the Jedi Archives, many of the busts, sculpted by Richard Miller, are actually of members of the Star Wars staff, including George Lucas, Animation Director Rob Coleman, Visual Effects Supervisors John Knoll and Pablo Helman, and Model Supervisor Brian Gernand.  ",
        "The growling dog-like creatures fighting over a bone in the Tusken camp on Tatooine were originally meant to be used on Geonosis and would encounter Obi-Wan. The Obi-Wan scene was cut, so the creatures were used on Tatooine so the models of the creatures would not be wasted.  ",
        "The large Aiwha creature, briefly seen flying out of the waves of Kamino, was originally designed by Ralph McQuarrie for O Império Contra-Ataca (1980). In that film, the 'air-whale' would have been seen on Bespin. Subsequently, it was proposed as desert mounts for the Sarlaac scene in O Retorno de Jedi (1983) and then to be used by the Gungan in Star Wars: Episódio I - A Ameaça Fantasma (1999).  ",
        "A conversation between Obi-Wan and Jocasta Nu was written and filmed, but deleted, and would have identified the bust that Obi-Wan is looking at to be Count Dooku.  ",
        "Was shot on exactly the same stages as Moulin Rouge: Amor em Vermelho (2001), also starring Ewan McGregor.  ",
        "The droid factory chase sequence was not in the original script. Anakin and Padme were originally captured as soon as they arrived on Geonosis. George Lucas wrote an additional action sequence based in the droid factory to lead up to their capture that was filmed in March 2001.  ",
        "Australian actor and actresses Graeme Blundell, Trisha Noble, and Claudia Karvan, were cast as Padmé's parents and sister and were interviewed by Ahmed Best for the 'On Location' web-series. Blundell was even involved in the location shoot in Italy for one scene. However, all of their scenes, which also included young Keira Wingate and Hayley Mooy playing Karvan's daughters, ended up being cut. Most of the footage can be seen as an extra feature on the DVD. Despite of their absence in this movie, the entire Naberrie family is still visible at the very end of Star Wars: Episódio III - A Vingança dos Sith (2005) and are all credited as such.  ",
        "The scene of Obi-Wan contacting Mace Windu and Yoda was originally shot with Windu behind a desk. The crew claims the scene had a \"film noir\" feel to it, but ultimately ended up redoing it, because it did not seem appropriate to the look and feel of the Star Wars universe.  ",
        "The spin-off video game \"Star Wars: Bounty Hunter\" which is a prequel to this film, reveals how Jango Fett was chosen as the genetic model for the clone army. Jango Fett was hired, along with other bounty hunters, by Count Dooku, to hunt down and eliminate Komari Vosa, Dooku's former apprentice, which Jango Fett succeeded in doing. Count Dooku revealed that that the bounty hunt was a test, and that the bounty hunter that succeeded in killing Komari Vosa, would go with Count Dooku to Kamino to be cloned, which Fett agreed, on the condition that he wanted one unaltered clone for himself - Boba Fett.  ",
        "For shooting the pre-visualization sequences for the speeder chase scenes, Luke Skywalker's speeder from Guerra nas Estrelas (1977) was dug out of storage, and used to represent the open-cockpit speeder with Anakin and Obi-Wan, and George Lucas' own Ferrari was used to represent Zam's speeder.  ",
        "Shot on digital video, using a new 24-frame High-Definition Progressive Scan camera, developed by Sony and Panavision, Inc. The cameras worked flawlessly, even in temperatures of 125 degrees Fahrenheit.  ",
        "In the Brazilian Portuguese translation, the names of Count Dooku, and the Jedi Master Sifo-Dyas, were changed. The reason is that, in Portuguese, \"Dooku\" and \"Zaifo-Dias\" have obscene meanings. \"Dooku\" became \"Dookan\", and \"Zaifo-Dias\" became \"Zaifo-Vias\". In Portugal, that change didn't happened.  ",
        "The \"Death Sticks\" guy in the bar has two antennae on his head - these were added later with CGI and were not part of a costume or props. In the Blu-ray commentary, the crew states that the actor might not even have known they were going to be added to his head.  ",
        "Padmé (Natalie Portman) is supposed to be a few years older than Anakin (Hayden Christensen). In real-life, Christensen is almost 2 months older than Portman. Though, being human-like different races of \"aliens\", it's reasonable their aging is slightly different.  ",
        "Count Dooku was initially designed as a female alien, with concepts being thrown around, like a killer fairy, a hyper-advanced robot, and several others. Eventually, George Lucas told the team that they could either make one design work, or scrap the whole thing, and start fresh with Christopher Lee, who had just signed on. They did the easy thing. One of the rejected designs was later used to portray Asajj Ventress in the Star Wars Expanded Universe and Legends stories.  ",
        "According to the official website, one of the many considered ideas for the character, who eventually became Dooku, was a female Sith. The rejected concepts for this, later found their way into creating a new character, Asajj Ventress, who appeared extensively in the Clone Wars comics, cartoons, and novels.  ",
        "In the visual dictionary of the film: Jango Fett was adopted and raised by the Mandalorian Warrior Army, after his parents were murdered.  ",
        "Boba Fett is ten years old in this film.  ",
        "There were plans to include Captain Panaka (Hugh Quarshie) in the opening scene aboard the doomed Naboo Cruiser. This would have killed off his character early, if Quarshie could not commit to the majority of the movie in Australia. However, Quarshie declined, due to disagreements with Lucasfilm, and the role was recast.  ",
        "This is the only Star Wars movie to not to feature Darth Vader's iconic breath so far. In Episodes III, IV, V, and VI, one can obviously hear his breath, as he is seen on screen. In episode VII, when Kylo Ren talks to his burnt mask, the breath is heard, and in Episode I, after the credits, just before the film really ends, his breath is heard once again.  ",
        "During a meeting with Rick McCallum and Animation Director Rob Coleman, about how Yoda should move during the lightsaber duel with Count Dooku, George Lucas stated that Yoda should be leaping around with frog-like reflexes, jokingly referring to Yoda as \"the illegitimate child of Kermit the Frog and Miss Piggy\".  ",
        "The forbidden love affair between Anakin and Padmé was strongly influenced by the forbidden love affair between Sir Lancelot and Queen Guinevere in the Legend of King Arthur. Anakin, a Jedi Knight, falls in love with Padmé, a former Queen of Naboo, which it is forbidden for a Jedi Knight to fall in love. In the Legend of King Arthur, Sir Lancelot, a Knight of the Round Table, has a forbidden love affair with Queen Guinevere, wife of King Arthur.  ",
        "Jedi Master Sifo-Dyas was originally just a flimsy alias for Darth Sidious known as Sido-Dyas, but a typo was made in the script. George Lucas preferred the new name, and the plot point about him was changed, to make him an actual Jedi that had disappeared.  ",
        "Rob Coleman and John Knoll prepared two tests featuring a CGI Yoda, using audio from O Império Contra-Ataca (1980). Yoda's appearance in Star Wars: Episode V - The Empire Strikes Back (1980) also served as the reference point for the creation of the CGI Yoda; George Lucas repeatedly stated to the animation department, that \"the trick\" to the animation of the CGI Yoda was to make him like the puppet from which he was based, in order to maintain a flow of continuity. Frank Oz was consulted; his main piece of advice was that Yoda should look extremely old, sore, and frigid. Coleman later explained the process of making the digital Yoda like the puppet version, by saying, \"When Frank (Oz) would move the head, the ears would jiggle. If we hadn't put that in, it wouldn't look like Yoda.\"  ",
        "The alien creatures that attack Obi-wan, Anakin, and Padmé in the arena on Geonosis, are an Acklay, a Reek, and a Nexu.  ",
        "The first major motion picture shot on digital video instead of film. It was also projected digitally in some theaters, at that time, only a few theaters in major cities, had that capability, becoming one of the first films produced and distributed without film being used at any point.  ",
        "Because he wanted to be able to identify himself during the colleseum scene, Samuel L. Jackson specifically asked George Lucas if he could have a purple lightsaber. Lucas replied that Jedi lightsabers were only blue or green, to which Jackson said \"Yeah, but I want a purple one.\" Lucas said he'd consider the request. Jackson says he didn't know how it would turn out until he went in for reshoots, which is when Lucas showed him the scene containing his purple lightsaber.  ",
        "In the Star Wars novel, 'Tatooine Ghost', it is related that Anakin's slaughter of the Tusken Raiders passed into their folklore. The battle is commemorated with a dance to the sounds of a lightsaber.  ",
        "The CGI models of the Republic attack gunships, had to be extremely detailed to withstand viewer scrutiny during closeups. ILM even crafted a version with a fully decked out interior, which was used as the background, for new bluescreen elements of the actors, aboard the gunships, shot during additional photography in London. The real-life gunship interior sets, were left in Sydney, Australia, so these new shots required digital gunship interiors.  ",
        "This marks the first (chronological) time that Obi-Wan Kenobi cuts off an enemy's gun hand in a bar filled with people who fall silent and then return to their business. The second (chronological) time is in Guerra nas Estrelas (1977) where he and Luke Skywalker meet Han Solo.  ",
        "The yellow speeder that Anakin and Obi-Wan use, while chasing Zam Wesell, appears to be inspired by the yellow '32 Ford coupe from George Lucas' Loucuras de Verão (1973).  ",
        "During the scene set in the Lars homestead dining room, Owen Lars asks Anakin \"Where are you going?\", as he is the first one to leave the table. This is a reference to a similar scene in Guerra nas Estrelas (1977) when Luke becomes anxious to leave, and Aunt Beru asks where he's going.  ",
        "In the Blu-ray commentary, it is stated that some original scripts of the movie had the joking title of \"Episode II - Jar Jar's Big Adventure.\"  ",
        "Reshoots were performed in March 2001. During this time, a new action sequence was developed featuring the droid factory after George Lucas had decided that the film lacked a quick enough pace in the corresponding time-frame. The sequence's previsualization was rushed, and the live-action footage was shot within four and a half hours.  ",
        "R4-P17, Obi-Wan's astromech droid, was originally going to be destroyed during the execution scene at the Geonosian arena. The droid also was supposed to possess an actual body, whereas in the finished film, R4 is just a stationary head built into the ship.  ",
        "According to an internet rumor at the time, the original opening had Padmé's spacecraft exploding via hand-held detonator (Jango Fett's) before landing. This was altered, as it was uncomfortably similar to a reported terrorist attack to a commuter train. Portions of the opening scenes were re-filmed, that now featured the ship landing and the reason for detonation appearing vague. Steve John Shepherd was cast as the Naboo Lieutenant, and Mike Savva returned, as the accompanying Naboo Officer, having previously played a Naboo Guard in Star Wars: Episódio I - A Ameaça Fantasma (1999).  ",
        "Since Obi-Wan is ten years older than in Star Wars: Episódio I - A Ameaça Fantasma (1999), Ewan McGregor grew a beard, and let his hair grow slightly longer for Star Wars: Episódio II - Ataque dos Clones (2002), same for Star Wars: Episódio III - A Vingança dos Sith (2005), slightly in contrast to how Obi-Wan appeared in the original trilogy.  ",
        "To efficiently communicate the damage sustained by the Trade Federation core ship blasted out of the sky, two versions of the computer-generated vessel were made. One bore its standard paint job. The other was the \"distressed\" version, with carbon scoring damage painted across the surface. Both were animated performing the same movement, and the compositors used animated mattes to gradually reveal the damaged ship from \"behind\" the intact one, covering the transitions with composited fire and explosion effects.  ",
        "Dexter Jettster's surname comes from George Lucas nickname for his son Jett. The character was partly inspired by Hollywood legend Ernest Borgnine and Mel, the gruff chef, as played by Vic Tayback from Alice (1976). Another hidden reference to this series can be found on the droid waitress WA-7: her name-tag reads 'Flo' in the Star Wars font 'Aurebesh'.  ",
        "Anakin Skywalker, who lived a long time ago in a Galaxy far far away, was held up by some reviewers as an example of someone with Borderline Personality Disorder.  ",
        "The Tatooine garage in which Luke cleaned the droids in Guerra nas Estrelas (1977) was rebuilt for this movie, but not completely: while the foreground and background were complete sets in the original film, only the foreground was rebuilt for Episode II; the background is digital.  ",
        "Ben Burtt experimented with using drumbeats and percussion sounds to underscore the Droid factory sequence. When George Lucas told him to put in traditional effects instead, the scenes ended up accompanied by temp music from John Williams O Império Contra-Ataca (1980) score.  ",
        "Because of George Lucas' method of creating shots through various departments and sources that are sometimes miles and years apart from each other, this became the first film ever to be produced through what Rick McCallum called \"virtual filmmaking.\"  ",
        "In the bar scene, Obi-Wan chops off Zem Wessell's arm. This foreshadowed the cantina scene in \"Star Wars: Episode IV - A New Hope\" which Obi-Wan chopped off Ponda Baba's arm.  ",
        "According to Natalie Portman on the Blu-ray commentary, the character of Padmé Amidala was going to leave politics altogether after her term as Queen ended, but remained on as Senator, at the insistence of the new Queen.  ",
        "Count Dooku (Christopher Lee) reveals that Qui-Gon Jinn (Liam Neeson) had been his apprentice. Lee died on June 7, 2015; Liam Neeson's 63rd birthday.  ",
        "Christopher Lee has pointed out that \"Dooku\" is the Japanese word for poison, which is inaccurate. The Japanese word for \"poison\" is pronounced \"doku\" with the short \"o\" sound.  ",
        "WILHELM SCREAM: Not the \"classic\" Wilhelm, but what is known as the \"third scream\" can be heard at the beginning of the film as Amidala's ship explodes.  ",
        "Though the Republic AT-TE walkers were computer-generated, at least one 1/10th scale miniature was constructed for pyrotechnic purposes. The walker that gets blown apart by an armor-busting Hailfire missile was first shot as a miniature against greenscreen. This provided valuable reference for the animators, though the scale of the resulting miniature explosion proved unusable as a final element. Also, the miniature was shot with a static camera, while the finished shot, had a swooping camera move that followed the rocket: a CGI walker was needed to properly move with the perspective of the shot.  ",
        "The planet name 'Geonosis' is taken from the Greek word used in ancient times 'gnosis' - meaning 'knowledge'.  ",
        "One of the sculptures in Padmé's apartment on Coruscant, resembles the work of sculptor Constantin Brancusi. The sculpture is on the table near the balcony and looks like a tall, thin flame.  ",
        "The Separatist Droid army is made up of Trade Federation Battle Droids and Droidekas first seen in Star Wars: Episódio I - A Ameaça Fantasma (1999), as well as the introduction of rapid-firing Super Battle Droids. The large Homing Spider Droids and the Dwarf Spider Droids belong to the Commerce Guild, while the missile-firing Hailfire Battle Droids belong to the IG Banking Clan.  ",
        "The missile launcher with the two big wheels is an IG-227 Hailfire droid tank. It was inspired by the Russian Tsar Tank, designed in 1914.  ",
        "The Skywalker family has a great deal of Swedish blood. Pernilla August is Swedish, and Hayden Christensen's ancestry is Swedish as well, as is Mark Hamill's. Anakin's stepfather's name is Lars, a typically Swedish name.  ",
        "Yoda's command center was a 1/6th scale miniature.  ",
        "This is the only \"Star Wars\" film to be released during the same year as a \"Star Trek\" film: Jornada Nas Estrelas: Nêmesis (2002).  ",
        "Matt Doran, who has a cameo as Elan Sleazebaggano, the death-sticks dealer, who is Jedi mind-tricked by Obi-wan Kenobi in the Outlander Club, had played Mouse in The Matrix (1999).  ",
        "Beru's maiden name is Whitesun.  ",
        "The Neimoidian seen with Nute Gunray on Geonosis, was originally intended to be Rune Haako. However, Rune's mask was lost shortly after the first film completed shooting. The production crew gave uncredited actor David Healey the mask of Daultay Dofine instead. Although the \"new\" Neimoidian had no official name during filming (the character was only referred to by the crew as \"Nute's friend\"), he was eventually named Gilramos Libkath, after Costume Supervisor Gillian Libbert and Production Controller Kathryn Farrar. Unfortunately, a mix-up in the end credits not only erroneously lists Alan Ruscoe in the part, but also says the Neimoidian is Lott Dod (the Trade Federation Senator seen briefly in Episode I). Much confusion has surrounded whether Nute's companion should be considered Rune Haako, Gilramos Libkath, or Lott Dod. The official Lucasfilm word, is that it's Rune Haako \"for all intents and purposes,\" but many fans are unsatisfied with this decision, based on the fact that the character neither looks, nor sounds, anything like Rune, who is back to his old Episode I self, by Episode III.  ",
        "George Lucas originally wanted Sammo Kam-Bo Hung to be the lightsaber fight choreographer.  ",
        "The novelization of O Retorno de Jedi (1983) states that Owen Lars was Obi-wan's brother, instead of Anakin's stepbrother as finally shown in the film.  ",
        "Both this film, and Minority Report: A Nova Lei (2002), directed by George Lucas' pal Steven Spielberg, have similar factory chase scenes.  ",
        "Susie Porter makes a brief cameo as Hermoine Bagwa, waitress in Dex's Diner.  ",
        "The Clone Wars was first teased in Guerra nas Estrelas (1977) Fans would have to wait 25 years until 2002 to get a taste of The Clone Wars in Star Wars: Episódio II - Ataque dos Clones (2002), and wait another year to see the web series Star Wars: Clone Wars (2003).  ",
        "EASTER EGG: On the special features disc of the DVD, go to Dex's Kitchen from the Still Galleries menu (it's listed as \"Dex's Kitchen and Still Galleries\" in the main menu). Then in the menu that follows, use your remote to select the flier on the wall behind Dex. This will take you to a reel showing \"flyers\" made by college students to promote the film. They contain links to web sites which you can access if you put the disc in your computer.  ",
        "Over 400 young actors were tested for the part of Anakin Skywalker.  ",
        "Obi-wan says machines can't think, but in Phantom Menace, C-3PO thinks Jar-Jar Binks is very odd indeed.  ",
        "Dex's full name is Dexter Jettster.  ",
        "The Republic flying gunships used in the climactic battle were LAAT/I used to transport troops from the assault ships while larger LAAT/C gunships carried AT-TE Armored Walkers. The Republic artillery was SPHA-T-class used to bring down a Trade Federation core ship.  ",
        "George Lucas has the head of a Stormtrooper and an R2-D2 in his office.  ",
        "The shot of Anakin and Padme walking and talking about her serving as Senator when they first arrive on Naboo, is shot in the same way, and outside the same building, as the last conversation between General Allenby and Dryden before the intermission of Lawrence da Arábia (1962).  ",
        "Art department Concept Sculptor Robert Barnes developed the Nexu after several early sketches depicted rather literal interpretations of a lion-like creature by intermixing different species traits like reptilian and human characteristics. Barnes was able to develop an unsettlingly vicious design, the Nexu was nicknamed \"Bad Kitty\" by the ILM animation team during production.  ",
        "The film features many plot elements of O Império Contra-Ataca (1980), although often reversed on themselves. This film begins in a mile-high city but ends in a desert wasteland. Empire begins in a snowy wasteland but ends at a city in the clouds. Obi-Wan; who trains Anakin; goes of on a mission by himself, just as Luke; who later trains Kylo Ren; goes off on his own to find Yoda. Han and Leia; Kylo Ren's parents; are captured, and Luke must rescue them. In this film, it is Anakin and Padme; Luke's parents; who come to Obi-Wan's rescue. Luke and Anakin also both lose a right arm in a duel with the villain at the film's climax.  ",
        "Anakin \"has a bad feeling about this\" when he, Padmé, and Obi-wan are about to be executed on Geonosis.  ",
        "Jedi Council members Eeth Koth and Adi Gallia, though recast, were originally supposed to make appearances in this film. In the role of Eeth Koth, Hassani Shapi was replaced by Tux Akindoyeni; and Gin Clarke was replaced by Lily Nyamwasa. Shapi and Clarke still appear in this film, though they were not involved in its production: a scene in the Jedi Council chamber features a recycled background from Star Wars: Episódio I - A Ameaça Fantasma (1999). Akindoyeni and Nyamwasa played Koth and Gallia, respectively, during the battle of Geonosis. However, it was decided during post-production that they looked different enough to be designated as different characters. Eeth Koth was therefore changed to Agen Kolar, and Adi Gallia became Stass Allie. The Episode I characters and cast members are still the only ones credited.  ",
        "Some of the stunt work was computer-generated, and was performed by \"digital stand-ins\".  ",
        "The film relied almost solely on digital animatics as opposed to storyboards in order to previsualize sequences for editing early on in the film's production. While George Lucas had used other ways of producing motion-based storyboards in the past, after Star Wars: Episódio I - A Ameaça Fantasma (1999) the decision was made to take advantage of the growing digital technology. The process began with Ben Burtt's creation of what the department dubbed as \"videomatics\", so called because they were shot on a household videocamera. In these videomatics, production assistants and relatives of the department workers acted out scenes in front of greenscreen. Using computer-generated imagery (CGI), the previsualization department later filled in the green screen with rough background footage. Burtt then cut together this footage and sent it off to Lucas for changes and approval. The result was a rough example of what the final product was intended to be. The previsualization department then created a finer version of the videomatic by creating an animatic, in which the videomatic actors, props, and sets were replaced by digital counterparts to give a more precise, but still rough, look at what would eventually be seen. The animatic was later brought on set and shown to the actors so that they could understand the concept of the scene they were filming in the midst of large amount of bluescreen used. Unlike most of the action sequences, the Battle of Geonosis was not storyboarded or created through videomatics but was sent straight to animatics after the department received a small vague page on the sequence. The intent was to create a number of small events that would be edited together for pacing inside the finished film. The animatics department was given a free hand regarding events to be created within the animatic; Lucas only asked for good action shots that he could choose from and approve later.  ",
        "Jesse Spencer, Donald MacKinnon, Jonathon Jackson, and S Club 7's Paul Cattermole were all considered for the part of Anakin Skywalker.  ",
        "In the Jedi Temple, one of the \"younglings\" being trained by Yoda, is named Liam.  ",
        "When Obi-wan is flying to Kamino, there is a shot of the exterior of his fighter. If you look closely to the right, you can see a symbol, that looks very similar to the Empire symbol.  ",
        "Christopher Lee, who appears as the villain Count Dooku, was very good friends with Peter Cushing, who appeared as Grand Moff Tarkin in Guerra nas Estrelas (1977). Both men starred together in many movies, but never together in a Star Wars movie.  ",
        "When Obi-wan explains to Anakin about how his lightsaber is his life-not to lose it is ironic as Obi-wan loses two of his lightsabers, 1st) when Darth Maul kicks his lightsaber down the reactor shaft in The Phantom Menace (1999), 2)in A New Hope (1977) After Darth Vader/Anakin kills Obi-Wan he takes his lightsaber.  ",
        "Anakin doesn't call the children of the Tusken Raiders \"younglings\".  ",
        "The Geonosis Droid Factory action sequence was influenced by the 1998 video game Apocalypse (1998). In the 8th level of the game, main protagonist Trey Kincaid (Bruce Willis) fights his way through the Warfighter, Inc. factory, in which robots are built and manufactured.  ",
        "Temuera Morrison and Rena Owen previously featured together in Once Were Warriors (1994), and its sequel, What Becomes of the Broken Hearted (1999).  ",
        "Count Dooku was played by Christopher Lee. Christopher Lee is famous for playing Count Dracula. Both Dracula and Count Dooku wear a cape.  ",
        "In this film, Padmé (Natalie Portman) falls in love with Anakin (Hayden Christensen), a Jedi. This foreshadows Natalie Portman starring in the \"Thor\" films as Dr. Jane Foster, a human scientist who falls in love with the god of thunder, Thor (Chris Hemsworth). Natalie Portman would also play a warrior herself in Your Highness (2011), as the elusive Isabel.  ",
        "Count Dooku and the Battle Droids are possibly based on Count Zarth Arn and the Golem robots in Starcrash (1978).  ",
        "We do not see any Separatist battle droids for the first eighty minutes.  ",
        "Count Dooku is a former Jedi, and leader of the Separatist Alliance, and the Droid Army. A plausible nod to the television series Battlestar Galactica (1978). In that series, Count Baltar (John Colicos), a member of the Council of Twelve, betrays the Council, and the human race, to the Cylons.  ",
        "Anthony Daniels: as a human customer in the bar, when Anakin and Obi-Wan hunt Senator Amidala's would-be assassin - visible just after Obi-Wan draws his lightsaber.  ",
        "Ahmed Best: He is seen as a human customer in the bar, into which Anakin and Obi-wan follow the assassin.  ",
        "Jar Jar Binks, standing in for Senator Amidala, puts forth the motion that gives Palpatine supreme powers. This means that Jar Jar, the most hated character in the Star Wars canon, is indirectly responsible for the fall of the Old Republic and the near-annihilation of the Jedi order.  ",
        "Senator Amidala is the best shot; she almost never misses. This is a reference to her daughter, Leia, who also almost never misses.  ",
        "While on location in Tunisia, George Lucas made one shot intended for Star Wars: Episódio III - A Vingança dos Sith (2005) of Obi-wan delivering baby Luke to the Lars homestead. He claimed he would not be returning to Tunisia, and if he needed another shot, he wouldn't get it. Since Ewan McGregor did not participate in the Tunisia shoot, a wide shot of a double was filmed handing over a doll to Owen Lars (Joel Edgerton). However, during production of \"Revenge of the Sith\", it was decided that Obi-wan should hand the infant to Beru (Bonnie Piesse) instead. All three actors were filmed separately, in front of a greenscreen, and the original shot was ultimately not used.  ",
        "The scene where Count Dooku visits the captive Obi-wan Kenobi, and tries in vain to recruit him, was not in the original shooting script. This scene was shot during reshoots in early 2001, and was designed to confuse the audience into thinking that Dooku may not be evil after all. This new scene replaced two other scenes, discarded during post-production, where Count Dooku's true allegiance was clearly stated; a brief meeting where Padmé and Anakin meet him in a conference room, and refuse an offer to join him, and their subsequent trial, where they are sentenced to death, which would have led directly to the scenes in the execution arena in the film.  ",
        "In the scene when Obi-wan and Anakin enter the bar after the speeder chase, Obi-wan states that Anakin will be the death of him. This is a foreshadowing to Darth Vader (Anakin) killing Obi-wan in Guerra nas Estrelas (1977).  ",
        "Body Count: 88.  ",
        "Every movie in the franchise closes with a scene with no dialogue. This movie ends with a wedding ceremony, with the main characters looking at one another, then out over the lake.  ",
        "Anakin Skywalker and Boba Fett do not meet face to face. Although Anakin Skywalker and Boba Fett are present in the Geonosis arena battle, they would meet each other years later when Darth Vader hires Boba Fett to track down the Millennium Falcon, but not until season two of Star Wars: The Clone Wars (2008-2015), which takes place a few years after the Battle of Geonosis.  ",
        "In the backstory behind why Count Dooku left the Jedi Order, and why he joined the Dark Side of the Force: Count Dooku became disillusioned with the Jedi Order when Qui-Gon Jinn died, and Count Dooku regrets the death of Qui-Gon Jinn, and he joined the Sith, so he could wipe them out from within. This is hinted in the scene which Count Dooku interrogates the captive Obi-wan, when he mentions Qui-Gon Jinn and wishes he was still alive and pleads with Obi-wan to join him and destroy the Sith together.  ",
        "If you look closely at Jango Fett, before he is killed by Mace Windu, you can see him trying to start his jetpack, which malfunctions, adding to his downfall.  ",
        "As Zam dies, after being shot with a toxic dart and reverts to her alien form, she says in her alien language, \"Murashani sleemo\". Which is Huttese for \"Bounty Hunter Slimeball\".  ",
        "Hayden Christensen and Natalie Portman play the parents of Mark Hamill and Carrie Fisher. Christensen and Hamill both have Swedish ancestry, while Portman and Fisher both have Jewish ancestry.  ",
        "The Jedi who tries to attack Count Dooku, before getting killed by Jango Fett on the planet Geonosis, is Jedi Master Coleman Trebor.  ",
        "Although Jango Fett dies. Temeura Morrison would return as Commander Cody and the Clone Troopers in the following film Star Wars: Episode III - Revenge of the Sith (2005). Cody, and the Clone Troopers, are clones of Jango Fett.  ",
        "Jango Fett, a bounty hunter is killed by Mace Windu (Samuel L. Jackson). This is a switch with Django Unchained (2012), which, in that film, the character Steven is killed by the character Django, who is a bounty hunter. Steven is played in that film by Samuel L. Jackson.  ",
        "When lightning comes out of Count Dooku's fingers towards the end of the movie, Obi-wan uses his lightsaber as a shield upwards where the lightning absorbs into the lightsaber. In Episode III, lightning comes out of Palpatine's fingers and Mace Windu uses his lightsaber as a shield sideways, rather than straight up. This bounced the lightning back onto Palpatine.  ",
        "When Mace Windu reveals himself on Geonosis, he pulls his lightsaber out on Jango Fett against his neck, later, during the battle, he cuts off Jango's head.  ",
        "After the second assassination attempt on Senator Amidala (involving poisonous creatures infiltrating her bedroom) and the ensuing chase, there is an exterior shot of Amidala's apartment building. If you look in the top-left corner of the screen you can see a small droid replacing the broken window that Obi-Wan had smashed through the night before.  ",
        "The first hour is in blue locations and the last hour in red locations. This is the same pattern as Episode V, but the actual locations reverse. The opening scene is in Cloud City. The same place Episode V ended. Since ice cannot be red unlike clouds being sometimes red or blue, the last location is the desert that opens Episode VI's first action sequence. Notice Luke and Anakin were similarly held captive, and use green lightsabers instead of blue. Jango Fett's death is similar to Boba Fett, and so is when Padmé and Leia would each use a chain to strangle a character.  "
    ],
    "cameo": [
        "Anthony Daniels: as a human customer in the bar, when Anakin and Obi-Wan hunt Senator Amidala's would-be assassin - visible just after Obi-Wan draws his lightsaber.  ",
        "Ahmed Best: He is seen as a human customer in the bar, into which Anakin and Obi-wan follow the assassin.  "
    ],
    "spoiler": [
        "Jar Jar Binks, standing in for Senator Amidala, puts forth the motion that gives Palpatine supreme powers. This means that Jar Jar, the most hated character in the Star Wars canon, is indirectly responsible for the fall of the Old Republic and the near-annihilation of the Jedi order.  ",
        "Senator Amidala is the best shot; she almost never misses. This is a reference to her daughter, Leia, who also almost never misses.  ",
        "While on location in Tunisia, George Lucas made one shot intended for Star Wars: Episódio III - A Vingança dos Sith (2005) of Obi-wan delivering baby Luke to the Lars homestead. He claimed he would not be returning to Tunisia, and if he needed another shot, he wouldn't get it. Since Ewan McGregor did not participate in the Tunisia shoot, a wide shot of a double was filmed handing over a doll to Owen Lars (Joel Edgerton). However, during production of \"Revenge of the Sith\", it was decided that Obi-wan should hand the infant to Beru (Bonnie Piesse) instead. All three actors were filmed separately, in front of a greenscreen, and the original shot was ultimately not used.  ",
        "The scene where Count Dooku visits the captive Obi-wan Kenobi, and tries in vain to recruit him, was not in the original shooting script. This scene was shot during reshoots in early 2001, and was designed to confuse the audience into thinking that Dooku may not be evil after all. This new scene replaced two other scenes, discarded during post-production, where Count Dooku's true allegiance was clearly stated; a brief meeting where Padmé and Anakin meet him in a conference room, and refuse an offer to join him, and their subsequent trial, where they are sentenced to death, which would have led directly to the scenes in the execution arena in the film.  ",
        "In the scene when Obi-wan and Anakin enter the bar after the speeder chase, Obi-wan states that Anakin will be the death of him. This is a foreshadowing to Darth Vader (Anakin) killing Obi-wan in Guerra nas Estrelas (1977).  ",
        "Body Count: 88.  ",
        "Every movie in the franchise closes with a scene with no dialogue. This movie ends with a wedding ceremony, with the main characters looking at one another, then out over the lake.  ",
        "Anakin Skywalker and Boba Fett do not meet face to face. Although Anakin Skywalker and Boba Fett are present in the Geonosis arena battle, they would meet each other years later when Darth Vader hires Boba Fett to track down the Millennium Falcon, but not until season two of Star Wars: The Clone Wars (2008-2015), which takes place a few years after the Battle of Geonosis.  ",
        "In the backstory behind why Count Dooku left the Jedi Order, and why he joined the Dark Side of the Force: Count Dooku became disillusioned with the Jedi Order when Qui-Gon Jinn died, and Count Dooku regrets the death of Qui-Gon Jinn, and he joined the Sith, so he could wipe them out from within. This is hinted in the scene which Count Dooku interrogates the captive Obi-wan, when he mentions Qui-Gon Jinn and wishes he was still alive and pleads with Obi-wan to join him and destroy the Sith together.  ",
        "If you look closely at Jango Fett, before he is killed by Mace Windu, you can see him trying to start his jetpack, which malfunctions, adding to his downfall.  ",
        "As Zam dies, after being shot with a toxic dart and reverts to her alien form, she says in her alien language, \"Murashani sleemo\". Which is Huttese for \"Bounty Hunter Slimeball\".  ",
        "Hayden Christensen and Natalie Portman play the parents of Mark Hamill and Carrie Fisher. Christensen and Hamill both have Swedish ancestry, while Portman and Fisher both have Jewish ancestry.  ",
        "The Jedi who tries to attack Count Dooku, before getting killed by Jango Fett on the planet Geonosis, is Jedi Master Coleman Trebor.  ",
        "Although Jango Fett dies. Temeura Morrison would return as Commander Cody and the Clone Troopers in the following film Star Wars: Episode III - Revenge of the Sith (2005). Cody, and the Clone Troopers, are clones of Jango Fett.  ",
        "Jango Fett, a bounty hunter is killed by Mace Windu (Samuel L. Jackson). This is a switch with Django Unchained (2012), which, in that film, the character Steven is killed by the character Django, who is a bounty hunter. Steven is played in that film by Samuel L. Jackson.  ",
        "When lightning comes out of Count Dooku's fingers towards the end of the movie, Obi-wan uses his lightsaber as a shield upwards where the lightning absorbs into the lightsaber. In Episode III, lightning comes out of Palpatine's fingers and Mace Windu uses his lightsaber as a shield sideways, rather than straight up. This bounced the lightning back onto Palpatine.  ",
        "When Mace Windu reveals himself on Geonosis, he pulls his lightsaber out on Jango Fett against his neck, later, during the battle, he cuts off Jango's head.  ",
        "After the second assassination attempt on Senator Amidala (involving poisonous creatures infiltrating her bedroom) and the ensuing chase, there is an exterior shot of Amidala's apartment building. If you look in the top-left corner of the screen you can see a small droid replacing the broken window that Obi-Wan had smashed through the night before.  ",
        "The first hour is in blue locations and the last hour in red locations. This is the same pattern as Episode V, but the actual locations reverse. The opening scene is in Cloud City. The same place Episode V ended. Since ice cannot be red unlike clouds being sometimes red or blue, the last location is the desert that opens Episode VI's first action sequence. Notice Luke and Anakin were similarly held captive, and use green lightsabers instead of blue. Jango Fett's death is similar to Boba Fett, and so is when Padmé and Leia would each use a chain to strangle a character.  "
    ]
}