{
    "common": [
        "\nDuring the shot in which Salacius Crumb (the small, annoying, rat-like thing that sits with Jabba in his palace) is chewing off C-3PO's eye, Anthony Daniels had a panic attack while in the C-3PO suit. While filming, he didn't actually say his lines (all his lines were dubbed in post-production anyway), but repeated \"Get me up. Get me up.\" over and over. This is the take used in the final film.  ",
        "\nIn the 2004 DVD release, George Lucas explained the reason behind why Yoda told Luke that Darth Vader was his father. Lucas had consulted with a child psychologist during the making of the film. The psychologist said that unless it was unequivocally stated that Vader was Luke's father, moviegoers age 12 and under would dismiss Vader's claim to be Luke's father as a lie.  ",
        "\nWhen Leia gets wounded, if you look closely you can spot Han Solo accidentally grab her breast before immediately correcting himself.  ",
        "\nFake scripts were distributed to some cast members that were considered likely to leak information to the media. Some of these phony story elements were indeed leaked, such as Lando being revealed as the \"last hope\" for the Jedi mentioned by Obi-Wan and Yoda in Star Wars: Episode V - The Empire Strikes Back (1980).  ",
        "\nThe Emperor's chair was mechanized so that it could rotate when the scene called for it. However, the mechanism never worked properly, so Ian McDiarmid had to make it move by shuffling his feet. A piece of tape on the floor told him when to stop so it would not be visible to the camera.  ",
        "\nIt took six people to work the full-sized animatronic of Jabba the Hutt.  ",
        "\nHarrison Ford suggested that Han Solo sacrifice his life to save his friends, but George Lucas disagreed with him, as he wanted Han to play a heroic part at the end.  ",
        "\nAccording to Ian McDiarmid, George Lucas originally cast him simply as the physical performance of the Emperor (similar to David Prowse as Darth Vader). This became evident to him when a producer told him that if he was able to get his voice close enough to Clive Revill's (who portrayed the Emperor's voice in Star Wars: Episode V - The Empire Strikes Back (1980)) Lucas would let him use his on-camera vocals in the final cut of the film. However, McDiarmid felt he could conduct a stronger, more wicked and demonic voice for the Emperor as opposed to Revill's more aristocratic Emperor. Lucas, and even Steven Spielberg, were so impressed with his take that it ended up becoming a signature trait of the character.  ",
        "\nCarrie Fisher complained about her costumes in the previous two movies. She said they were so long, you could not tell \"she was a woman\". Those complaints led to the skimpy outfit she wore as Jabba's slave. The costume became something of a running joke among the crew, because the metal framework that held the top together meant that the costume didn't move well with her. Since Fisher didn't like the industry standard solution of using double-sided tape, it became necessary before each take to have a wardrobe person check to ensure that her breasts were still snug inside the costume top (and several scenes had to be re-shot when \"wardrobe malfunctions\" occurred).  ",
        "\nAs the Californian forest location the production was using was due for logging, the special effects crew were allowed to knock trees down in the Battle of Endor.  ",
        "\nSir Alec Guinness filmed his cameo in just a day.  ",
        "\nWhilst clambering over Jabba the Hutt, one of the high heels that Carrie Fisher was wearing accidentally punctured the latex casing and pierced Mike Edmonds who was operating the tail inside.  ",
        "\nNien Nunb, Lando's co-pilot, speaks a Kenyan dialect called Haya. According to sound designer Ben Burtt, the lines were delivered by Kipsang Rotich, a Kenyan student living in the U.S., and are actually correct Hayan translations of the English text. Audiences in Kenya were reportedly very thrilled to hear their language spoken in proper context.  ",
        "\nAccording to Gary Kurtz, the original treatment ended with Luke Skywalker walking off alone and exhausted like the hero in a Spaghetti Western, going into seclusion by walking out into the Tatooine desert. George Lucas opted for a happier ending to encourage higher merchandise sales.  ",
        "\nGeorge Lucas fired his friend and producer of the previous two Star Wars movies, Gary Kurtz, before production began (although some sources say he simply quit on his own). The relationship between Kurtz & Lucas had deteriorated during the making of Star Wars: Episode V - The Empire Strikes Back (1980), when the film went wildly over budget and fell behind schedule. With Lucas self-funding both films as independent productions, he opted to part company with Kurtz in favor of taking on active executive producer duties himself to insure the film stayed under budget.  ",
        "\nJabba's sail barge was filmed in Yuma, Arizona. The film crew had problems avoiding the 35,000 dune buggy enthusiasts in the area. To preserve secrecy, the producers claimed to be making a horror film called \"Blue Harvest\" with the tagline \"Horror beyond imagination\", and even had caps and t-shirts made up for the crew. A chain-link fence and a 24-hour security service could not prevent die-hard fans from entering the set and sneaking some photographs.  ",
        "\nThe Endor shots were filmed near Crescent City, California. Forest work was especially hard on the Ewok actors. Production Assistant Ian Bryce arrived on the set one day to find a note from the Ewok actors saying that they had all had enough and they were on their way to the airport. Bryce tried to drive to the airport, but got a flat tire not far from the set. He found another car and was about to leave when the Ewoks' bus pulled up, and all the Ewok actors got off wearing \"Revenge of the Ewok\" t-shirts.  ",
        "\nEndor is the name of a place in the Bible; it's a village found in Biblical Israel's territory of Isaachar, where king Saul went on the eve of his final battle with the Phillistines and came across \"The Witch of Endor\". It also the Elvish name for Middle-Earth in J.R.R. Tolkien's \"Lord of the Rings\".  ",
        "\nFollowing the success of Boba Fett (appearing in comics and being a popular supporting character), George Lucas admitted that he had no idea that the character had become so popular. He mentioned that if he had known, he would have given the bounty hunter a more memorable death scene. Lucas even considered adding a shot of Boba Fett escaping the Sarlacc for the 2004 DVD release. Ultimately, he decided against it as he did not want viewers to be distracted from the intended storyline.  ",
        "\nThe slithery noises made when Jabba the Hutt moves were created by sound-man Ben Burtt running his hands through a cheese casserole.  ",
        "\nAccording to Warwick Davis, he auditioned for the movie after his grandmother heard a London radio station announce a casting call to play the Ewoks.  ",
        "\nOriginally, Yoda was not in the film's script. Yoda was added when George Lucas determined him best to properly confirm to Luke as to whether Vader was his father or not.  ",
        "\nThe second Death Star was approximately 460% larger than the first one.  ",
        "\nThis is the only Star Wars movie where Darth Vader does not Force choke someone. A scene did exist in the initial cut that showed Vader Force choke an Imperial Officer in order to gain access to the Emperor's throne room. This scene was cut because George Lucas felt that this point had been made clearly enough in Star Wars: Episode V - The Empire Strikes Back (1980).  ",
        "\nThis was originally to be entitled \"Revenge of the Jedi\", but producers thought the Jedi wouldn't seek revenge, due to their ethical code. Some posters and theater stand-ups were made early, but then quickly pulled when the title changed names. Also, Star Trek II: The Wrath of Khan (1982) was originally to be called \"Star Trek: The Revenge of Khan\", but the title for that movie was changed to avoid confusion with this movie back when \"Revenge of the Jedi\" was being considered.  ",
        "\nThe point-of-view shots for the speeder bike sequence were achieved by having a camera operator walk through the forest at normal speed with a camera filming at one frame per second. When the footage was played back at twenty four frames per second, it gave the appearance of flying through the forest at high speeds.  ",
        "\nAdmiral Ackbar's famous line 'It's a trap!' was originally scripted as 'It's a trick!'. The line was changed in post-production after a negative test screening.  ",
        "\nHayden Christensen mentioned in an interview that he didn't fully know what George Lucas was up to when he was inserted into The Special Edition, otherwise he would have played the scene totally different.  ",
        "\nThe growls and sounds of the Rancor in Jabba's Palace were actually made by a dachsund.  ",
        "\nIan McDiarmid, a prolific stage actor, based his character's unusual voice on the Japanese method of using your stomach to project yourself. The result was a strange, guttural croak that Lucas decided was perfect for the character of Palpatine.  ",
        "\nWhen preparing to work on the special edition one of the ILM employees was talking to a friend and mentioned in passing that they were extending the musical number in Jabba's palace. The friend happened to be the brother of Femi Taylor, the dancer that played Oola (the slave girl/dancer who is fed to the Rancor) and suggested that they get in contact with her as she was in even better shape than she was when they originally shot the scene. They ended up using her, and the scene is a combination of footage that they already had and the new footage recorded 15 years later. Femi Taylor also has the distinction of being the only cast member from the original movies to reprise her role for the special edition.  ",
        "\nMarks the first time Luke addresses Kenobi as \"Obi-Wan\" and not just \"Ben\".  ",
        "\nThe word Ewok is never spoken in the movie, nor are the individuals (Wicket, Paploo, etc.) referred to by name.  ",
        "\nDavid Prowse only portrayed Darth Vader completely for the first half of the movie. In the second half of the movie, the character was played by Bob Anderson (stuntman) during the fight sequence, and Sebastian Shaw after the character is unmasked. James Earl Jones voiced the character throughout, with the exception of the unmasking scene.  ",
        "\nJohn Williams son Joseph Williams, the lead singer of the pop/rock band Toto, collaborated on part of the score, and wrote lyrics for the Ewoks songs.  ",
        "\nAccording to Ian McDiarmid in the Blu-ray commentary, Palpatine is over 100 years old.  ",
        "\nSeveral Ewok lines are in the Filipino (Tagalog) language. Most Ewok lines, however, were inspired by the Kalmyk language, spoken by Buddhist tribes living in Southern Russia.  ",
        "\nThe Jabba the Hutt puppet took Stuart Freeborn's team three months to build, cost $500,000 to make and weighed 2000lbs.  ",
        "\nAlan Rickman auditioned for the role of Moff Jerjerrod.  ",
        "\nThe radiating shafts making up the floor of the second Death Star's reactor core are actually 1,500 fishing rods.  ",
        "\nAccording to the documentary \"Empire of Dreams\", Steven Spielberg, who is a life-long best friend with George Lucas, was Lucas's first choice to direct, and even though Spielberg would have loved to direct a Star Wars film, he was forced to decline because he is a member of the Directors' Guild (Lucas dropped his Guild membership over disagreements about Star Wars: Episode V - The Empire Strikes Back (1980). As a result, Lucas hired the relatively unknown (and at the time non-union) Welsh director Richard Marquand. Lucas was also impressed by Marquand's ability to bring in a movie on time and on budget, a very real concern of Lucas after the budget overruns experienced on The Empire Strikes Back.  ",
        "\nAnother reason for filming under the guise of nondescript horror movie title, \"Blue Harvest\" was partly to put off any snoopers and also because the production found that if they mentioned they were working on the next Star Wars film, suppliers would automatically ramp up their prices, assuming that money was no object for Lucasfilm.  ",
        "\nIn the Battle of Endor, many of the \"ships\" and other objects far in the background are actually things like chewed-up gum. The crew knew there was so much action going on that people would not notice things like this use to fill up the picture in the background.  ",
        "\nBefore filming began, it was discovered that all of Darth Vader's lightsaber props had either been lost or stolen. Thus, one of Luke Skywalker's \"stunt\" saber props from Star Wars: Episode V - The Empire Strikes Back (1980) had to be quickly cannibalized into a \"Vader-esque\" saber for this film.  ",
        "\nOriginally, George Lucas was disapproving of Richard Marquand's choice in casting Ian McDiarmid as The Emperor. The choice eventually grew on Lucas, as he eventually went on to cast McDiarmid as the younger version of the same character in the first three episodes of the saga.  ",
        "\nDavid Lynch was originally offered the chance to direct this episode of the series. He turned it down because he believed it was \"Lucas' thing.\" He went on to direct Dune (1984) instead. Despite this, his career was able to recover.  ",
        "\n10 puppeteers, 9 mime artists, 42 extras, 18 principles, supported by a crew of 90 worked almost a month on the Jabba's Palace sequence.  ",
        "\nOn what was dubbed \"Black Friday\", 100,000 feet of film stock containing effects shots that couldn't be read in an optical printer were unceremoniously dumped by George Lucas himself. The crew at ILM were forced to go back to the drawing board and start again from scratch, with many getting drunk when they heard the news.  ",
        "\nDuring pre-production, George Lucas and Lawrence Kasdan would constantly argue over story beats and setpieces, with both of them getting into heated discussions over whether to scrap Endor entirely in favor of setting the climactic battle on Had Abbadon, the supposed Imperial \"home planet\".  ",
        "\nMany ideas from the original script were left out or changed. For instance, the Ewoks were going to be Wookiees, the Millennium Falcon would be used in the arrival at the forest moon of Endor, and Obi-Wan Kenobi would return to life from his spectral existence in the Force.  ",
        "\nAccording to Anthony Daniels, it only took him less than 10 minutes to put on the C-3PO outfit, unlike the last two films where it took him two hours.  ",
        "\nAdmiral Ackbar's backstory is that he was once the slave of Grand Moff Tarkin, as well as his personal pilot.  ",
        "\nThe TIE in TIE Fighter stands for Twin Ion Engine.  ",
        "\nOriginally, the color of Luke's new lightsaber was blue, the same as the one he lost in Star Wars: Episode V - The Empire Strikes Back (1980). Luke can even be seen wielding a blue lightsaber in early ROTJ trailers. However, when a scene of Luke assembling and activating his new saber, (still blue), was cut, George Lucas thought the audience might not understand that Luke's ROTJ lightsaber was not the exact same one he lost on Cloud City. To avoid confusion, Lucas decided to change the color from blue to green, making it clear that Luke was using a new saber. (As part of the Expanded Universe -Legends-, Luke's original lightsaber, used by his father and given to him by Obi-Wan, was recovered (along with his severed hand) from Cloud City and was later wielded by a Luke clone. Luke later recaptured this saber and presented it to Mara Jade, his love.) (The cover art for this movie shows Luke wielding a blue lightsaber though.)  ",
        "\nDarth Vader's footsteps were recorded in underground tunnels by the Golden Gate Bridge to help create an ominous effect.  ",
        "\nThere are several women among the Rebel pilots seen during the briefing aboard Home One (one can be seen just behind Lando's shoulder in his conversation with Han), who never actually appear in the actual battle sequence, though at least three were known to have filmed cockpit scenes for the battle. One of these actresses did survive into the final cut film: one of the A-Wing pilots is actually a woman redubbed by a male actor. The most significant cut was French model and actress Vivienne Chandler, who played an unnamed female X-wing pilot (later named Dorovio Bold). What made her cut surprising was that it appeared she would have played a significant role in the battle, as she recorded over a full page of dialogue. Footage of her in the cockpit of her X-wing recently resurfaced, indicating she was among the pilots to assault the Death Star itself, and her dialogue (in which she makes a distress call about a fatally-damaged stabilizer) suggests she would have been killed after crashing much like Red Leader had in the original film. It's unclear exactly why the women were cut, but it's been speculated there were concerns that audiences would be made uncomfortable by the thought of women being killed during a battle sequence.  ",
        "\nThe first screening of the film (using an early cut) was reportedly a disaster, with George Lucas deriding the editing and the fact that it didn't feel like a Star Wars film. Eventually, one of the film editors, Sean Barton, did his own cut that Lucas preferred a lot more, and it was this cut that the final version was crafted from.  ",
        "\nAn early version of the script featured Obi-Wan actually returning from the dead rather than just appearing in spirit form.  ",
        "\nThe script described a little more detail about Luke and Leia's mother. She was disguised as Leia's adoptive parents' handmaid. She died when Leia is about 4. This is contradicted by Star Wars: Episode III - Revenge of the Sith (2005), which showed Padme Amidala (Natalie Portman) as Luke and Leia's mother who died in childbirth.  ",
        "\nFor security reasons, when the film was sent to the lab, it was sent under the title \"Blue Harvest\". The title was inspired by the Dashiell Hammett story \"Red Harvest\", which was the inspiration for Yojimbo (1961), directed by Akira Kurosawa, one of the favorite directors of George Lucas. When you go to www.blueharvest.com, you'll get the official Star Wars website.  ",
        "\nThe first film to gross over $20 million in its opening weekend.  ",
        "\nDavid Prowse has said that he did not take part in any of the lightsaber-fighting sequences. As with Star Wars: Episode V - The Empire Strikes Back (1980), the film's sword master, Bob Anderson played Darth Vader during the duel sequence, wearing platform shoes and careful filming to make up for the height difference.  ",
        "\nAfter appearing in this film, Wedge becomes the only X-wing pilot (apart from Luke) who survives all three films.  ",
        "\nPhysicists have calculated that while the Death Star design is theoretically possible, it would take too much money, time and material to be feasible.  ",
        "\nLeia strangling Jabba was an homage to the death of Luca Brasi in The Godfather (1972). George Lucas worked as an assistant editor on that film. Star Wars: Episode III - Revenge of the Sith (2005) featured an homage to the famous Baptism sequence.  ",
        "\nPrior to the making of the film, Mark Hamill speculated that it would have involved Luke turning to the dark side, with the main conflict being generated by whether or not he'll be turned back.  ",
        "\nAn extended version of Yoda's death reveals that Obi-Wan would have told Luke the truth that Vader was indeed his father if he'd let him.  ",
        "\nAt the time, the climactic battle in outer space featured more optical effects in one scene than had ever been previously committed to film.  ",
        "\nOriginally Moff Jerjerrod was written as Grand Moff Jerjerrod, and was Palpatine's personal representative, and schemed with him to turn Luke and betray Vader. When Vader finds out he breaks Jerjerrod's neck.  ",
        "\nWhile attempting to film Luke Skywalker's battle with the rancor beast, George Lucas insisted on trying to create the scene in the same style as Toho's Godzilla films by using a stunt performer inside a suit. The production team made several attempts, but were unable to create an adequate result. Lucas eventually relented and decided to film the rancor as a high-speed puppet.  ",
        "\nSpeeder bike \"pass by\" sound effects were done by splicing together thunder sounds with those of a P-38 airplane.  ",
        "\nGeorge Lucas has admitted to being on the set frequently due to Richard Marquand's relative inexperience with special effects. Marquand joked, \"It is rather like trying to direct King Lear - with Shakespeare in the next room!\"  ",
        "\nThe dancer that Jabba drops into the Rancor pit loses her top as she falls in.  ",
        "\nThe screenplay was not finished until rather late in pre-production, well after a production schedule and budget had been created by Howard G. Kazanjian and Richard Marquand had been hired, which was unusual for a film. Instead, the production team relied on Lucas' story and rough draft in order to commence work with the art department. When it came time to formally write a shooting script, Lucas, Lawrence Kasdan, Marquand and Kazanjian spent two weeks in conference discussing ideas; Kasdan used tape transcripts of these meetings to then construct the script.  ",
        "\nEverything Jabba the Hutt says has the same amount of syllables as the English translations. This is due to the fact that the puppeteers said all of the lines in English when they were controlling the Jabba puppet.  ",
        "\nCharacters who have \"a bad feeling about this\": C-3PO and Han Solo. See also Star Wars: Episode IV - A New Hope (1977) and Star Wars: Episode V - The Empire Strikes Back (1980).  ",
        "\nSFX crew claim to have included a \"sneaker\" as one of the spaceships in a complex dog-fight scene (see also trivia for Star Wars: Episode V - The Empire Strikes Back (1980)).  ",
        "\nIn the familiar theatrical one-sheet poster advertising the film, forearms assumed to belong to Luke Skywalker are shown raising an ignited light-saber upward toward the starry sky. But the unidentified arms pictured are not those of actor Mark Hamill, they belong to George Lucas.  ",
        "\nRichard Marquand alienated several of the actors, with both Carrie Fisher and Mark Hamill accusing the director of treating them terribly while simultaneously fawning over Harrison Ford's performance.  ",
        "\nDavid Prowse, who played Darth Vader's body in three films, was unaware of the planned unmasking scene in which a different actor, Sebastian Shaw, played Vader's face.  ",
        "\nThe deleted sandstorm scene involving all the actors was the first scene shot on the first day of shooting. This made Mark Hamill the only Star Wars actor to work the first full day of shooting on all three Star Wars movies.  ",
        "\nIn the 2011 Blu-ray release, Ewoks blink. According to Warwick Davis on the Blu-ray commentary, a mechanism was invented to make the actual costume blink, but this was determined to be faulty and was later aborted.  ",
        "\nBefore the special editions, this was the only movie of the original trilogy that mentioned the name Anakin. There was a deleted scene in Star Wars: Episode IV - A New Hope (1977) where Luke meets Biggs and Red Leader, where the latter mentions that he had once met Anakin. The scene was restored in the Special Edition, minus the line mentioning Anakin, though.  ",
        "\nLawrence Kasdan and George Lucas initially wanted to include the \"victory over the Empire\" shots on the imperial city. However, they were unable to get a satisfactory name for the capital planet of the Empire. In May 1991, author Timothy Zahn wrote a Star Wars spin-off book, Heir to The Empire, and came out with the capital planet's name as Coruscant. Lucas was happy with the name and as the result, CG shots of victory celebration sequences of other cities, including Coruscant (where the statue collapsed) was included in the 1997 Special Edition.  ",
        "\nThe inside of Jabba the Hutt's palace is deliberately styled to resemble the Mos Eisley cantina in the first film. George Lucas wanted to redo the scene but with a bigger budget and without having to rely on stock masks.  ",
        "\nRalph McQuarrie became burned out because of his constant work on the film and his hatred of the Ewok concept, and walked away from the production.  ",
        "\nAt one point during the battle on Endor, Leia turns towards a Scout Walker and shoots a man who is either standing on or leaning out of the top. This man is rumored to be none other than the director, Richard Marquand, who also did the voice for the interrogator droid EV 9D9. His voice was run through a ring modulator to give the proper mechanic-sounding effect.  ",
        "\nStuntwoman Tracey Eddon wore a rubber replica of C-3PO for the tumble off of the sail barge. She then donned a metal bikini to swing with Mark Hamill's stunt double onto the escaping skiff.  ",
        "\nIan McDiarmid's character of Palpatine/Darth Sidius is not referred to by this name in the original trilogy. He is only called \"The Emperor\".  ",
        "\nThe main chamber of Jabba's palace is connected to the entrance by a short flight of steps. When filming the scene where R2-D2 enters the chamber it was discovered that the droid could not roll down the stairs. In the movie we see R2-D2 approaching the stairs, then the camera moves to the left past the steps and the droid re-enters the field of view, having been manually hauled down the stairs.  ",
        "\nPeter Mayhew had to be careful while filming in the redwoods in his Chewbacca costume, in case hunters mistook him for Bigfoot.  ",
        "\nWILHELM SCREAM: As Luke slashes an enemy with his lightsaber and he falls into the Sarlacc pit. It can also be heard again a second time as Luke slashes another enemy into the pit soon after, but it is barely audible. Additionally, in the Special Edition, a Wilhelm can be heard during one of the huge celebration scenes, on Coruscant, after the Death Star is destroyed (an Imperial Stormtrooper is crowd surfing and the Wilhelm is heard as he passes to the right of the film frame; since this is a celebration scene rather than a fight scene, the Wilhelm was presumably included as a joke).  ",
        "\nBen Kingsley, David Suchet, Alan Webb and Lindsay Anderson were considered for the role of Emperor Palpatine. If Alan Webb had been cast he would have died during the few weeks of shooting.  ",
        "\nThe dual stripes painted on rebel A-wing fighters were originally blue, but were changed to red because the blue made it a problem when filming blue-screen effects.  ",
        "\nThe Ewoks were originally supposed to be a tribe of Wookiees. In pre-production, though, the decision was made to go to short creatures with short fur rather than very tall creatures with longer fur and, hence, the Ewoks were created (Ewok may very well have been created by rearranging the sounds in the word \"Wookiee\").  ",
        "\nAccording to Star Wars canon, Luke had been to the Sarlacc pit before. During his adolescence, it was a popular dare among his friends to jump the Sarlacc pit in a low-flying sand-skimmer.  ",
        "\nSydney Greenstreet was used as one of the models for Jabba the Hutt.  ",
        "\nThe official poster of the film displays a disclaimer. \"This film may be too intense for very young children.\"  ",
        "\nThere were several versions of Carrie Fisher's slave costume. One was made of metal form-fit to her body. Another was made of rubber and was used for stunt scenes because it was more comfortable.  ",
        "\nThe Huttese language spoken by Jabba the Hutt was inspired by the Incan language Quechua.  ",
        "\nCaroline Blakiston (Mon Mothma) had to re-record her dialogue after it was discovered that her microphone had picked up the sound of pigeons roosting in the set ceiling.  ",
        "\nWhen sound designer Ben Burtt was working on the sound effects for the speeder bike chase, he tried to emulate Treg Brown's sound effect work on the Road Runner cartoons as closely as possible.  ",
        "\nSound designer Ben Burtt got the opportunity to operate the mike boom in the dialogue scene between Luke and Leia on Endor. He didn't know the entire scene would take almost 3 minutes to shoot, so he got very tired holding up the microphone, and nearly dropped it on Carrie Fisher's head.  ",
        "\nAccording to a magazine interview with Irvin Kershner in May 2004, Kershner states that Richard Marquand didn't direct all of Star Wars: Episode VI - Return of the Jedi (1983), it was Kershner's assistant director and George Lucas who took over after the actors didn't respond very well to Richard Marquand. The relationship between Marquand and George Lucas was said to be bad. On the DVD commentary, however, George Lucas claims he worked quite well with Marquand.  ",
        "\nThe Twilek dancer/slave in Jabba's palace has two \"wardrobe malfunctions\" throughout her appearance. Once whilst Jabba the Hutt pulls the chain attached to her and once while falling into the Rancor pit.  ",
        "\nDenis Lawson, who played Wedge Antilles in Star Wars: Episode IV - A New Hope (1977) and Star Wars: Episode V - The Empire Strikes Back (1980) plays Wedge in this film, despite the rumors to the contrary which were caused by his name being misspelt (\"Dennis Lawson\") in the credits of Star Wars: Episode IV - A New Hope (1977). Intense debate on Usenet prompted Jarod Nash to write a letter to Lawson, asking for clarification. Lawson confirmed that he indeed played in all three movies, this being the only one that spells his name right.  ",
        "\nThe Ewok battle was modeled after George Lucas's original idea for the climax of Apocalypse Now (1979), a project he was once interested in directing himself before leaving it to his mentor Francis Ford Coppola. Harrison Ford appeared in both films. In Star Wars, his character is based on Coppola. In the other film, his character is named \"Col. G. Lucas.\"  ",
        "\nThe film grossed more than $250 million from a $32 million budget in 1983, and then another $40 million in its 1997 re-release.  ",
        "\nFirst film to mention the TIE Fighter by name, when Lando issues the order to split up to \"get some of those TIE Fighters to follow\".  ",
        "\nGary Kurtz was replaced by Howard G. Kazanjian as producer due to the previous film going overbudget.  ",
        "\nHoward G. Kazanjian's schedule pushed shooting as early as possible in order to give Industrial Light & Magic (ILM) as much time as possible to work on effects, and left some crew members dubious of their ability to be fully prepared for the shoot.  ",
        "\nWith the addition of Darth Vader's \"No! No!\" in the Blu-Ray Edition, every live action Star Wars film to date has a powerful \"No!\"    Episode I - Obi-Wan Kenobi   Episode II - Anakin Skywalker   Episode III - Darth Vader   Episode IV - Luke Skywalker   Episode V - Luke Skywalker   Episode VI - Darth Vader   Episode VII - Rey  ",
        "\nThe film originally included a sandstorm scene that occurred after Han's rescue. It was cut because it was unnecessary and was hectic to shoot, but the idea for the scene was later used in Star Wars: Episode I - The Phantom Menace (1999).  ",
        "\nEwok costumes had their \"feet\" custom-fitted for each actor, so that they were capable of both walking and running as needed.  ",
        "\nPrincipal photography was beset with numerous delays and clashes between George Lucas and Richard Marquand, with the former wanting to use multiple cameras during each take so he could have more material in the editing room, and the latter wanting only one or two cameras with no fallback option. The filmmakers inadvertently used old film stock that caused many shots to have a bizarre blue tint, which forced ILM to fix the color timing on many shots in post-production. At a certain point, Lucas essentially took over the majority of directing duties from Marquand.  ",
        "\nLightsabers and Blasters in this movie have opposite colors for each side of the force. For example, The Rebels have green light sabers and red gun lasers. And the Empire has red light sabers and green gun lasers.  ",
        "\nEndor scenes were filmed on a sound stage in London, and then on location in a Redwood forest. According to Warwick Davis, Lucas decided to spotlight six of the Ewoks, and to have the same British actors play those parts in England and America. All the others were replaced with Americans for the location shoot.  ",
        "\nCinematographer Alan Hume, angered over George Lucas' treatment of Richard Marquand, informally stepped away from his duties, leaving camera operator Alec Mills to finish filming in the last month of production.  ",
        "\nReportedly, when Steven Spielberg was unavailable to direct this film due to his membership of the Director's Guild, he suggested Dutch director Paul Verhoeven to his friend George Lucas as a potential director. Spielberg had been impressed by Verhoeven's Dutch films, especially his war epic Soldier of Orange (1977), and knew that Verhoeven was searching for an American project. However, when Spielberg saw Verhoeven's latest movie, the sexually explicit Spetters (1980), he decided to withdraw his recommendation.  ",
        "\nUnlike other Star Wars installments, Star Wars: Episode VI - Return of the Jedi (1983) was shot and completed in less than one year. Photography was done within January 1982 - May 1982  ",
        "\nChewbacca swinging through the trees with the two Ewoks and yelling was written as an obvious nod to \"Tarzan\". The famous yell Tarzan makes when he swings through the trees.  ",
        "\nGeorge Lucas also ran into budget problems as a result of ensuring his loan with 20th Century Fox after the release of Star Wars: Episode V - The Empire Strikes Back (1980), to the point of interfering with filming. Richard Marquand had to beg Lucas for a Rancor hand prop to be constructed so that close-ups of Mark Hamill could be filmed.  ",
        "\nLawrence Kasdan claims he told George Lucas that Return of the Jedi was \"a weak title\".  ",
        "\nIn the part where Paploo was barely hanging onto the speeder bike, Paploo was played by stuntman Tony Cox. The crew propped the bike up vertically and filmed Cox dangling from the handlebars, then simply rotated the camera.  ",
        "\nThe visually-distinct B-wing fighters apparently had a substantial amount of footage filmed for use in the final battle, however it was realized that the fighter's thin profile meant that it was incredibly difficult to pick up on screen, so all shots of the B-wings in action was cut after the Rebels break off when they realize the shield is still up.  ",
        "\nThe design of Luke's new light saber is directly based on the one used by Obi-Wan Kenobi in Star Wars: Episode IV - A New Hope (1977). In fact, one of Obi-Wan's \"stunt\" saber props was reused in Star Wars: Episode VI - Return of the Jedi (1983) as Luke's.  ",
        "\nIn an episode of Storage Wars (2010), one of the stars of the show discovered a Star Wars jacket in a storage locker with the original title, \"Revenge of the Jedi\" printed on it. The jacket was ultimately appraised to be worth over $3,000.  ",
        "\nPat Welsh performed the voice of the Bounty Hunter Boush (Princess Leia in disguise)  ",
        "\nAlthough Boba Fett is present in the previous installment, Star Wars: Episode V - The Empire Strikes Back (1980), his name is not mentioned until this movie during the sail barge fight scene.  ",
        "\nThe first appearance of the Death Star was originally supposed to be in this episode. Lucas changed the Death Star in this movie to the Death Star Two after having been forced to introduce the Death Star in Star Wars: Episode IV - A New Hope (1977) due to budget cuts imposed by the studio.  ",
        "\nOne of the words C-3PO uses to communicate with the Ewoks is \"naboo\" which is the name of Queen Amidala's planet in Star Wars: Episode I - The Phantom Menace (1999).  ",
        "\nThe Millennium Falcons used for this movie were either models or matte paintings. The full-sized mock up used for the other films was only used for the deleted sandstorm scenes and therefore doesn't make an appearance in this movie  ",
        "\nThe word \"Ewok\" is never said out loud in the movie.  ",
        "\nGeorge Lucas had a script policy which was carried over to the novel-writing policy today: Any characters from the trilogy cannot be killed off by any means - which explained the reason he overruled Harrison Ford's suggestion of killing Han Solo off. However, he consented R.A. Salvatore's idea of killing Chewbacca off in the novel Vector Prime (set 21 years after Episode VI).  ",
        "\nPortions of the partially completed Death Star model resemble the San Francisco skyline.  ",
        "\nThe Death Star II's power source is called a Hypermatter Reactor. It is the standard energy source for all spacecraft in the Star Wars universe.  ",
        "\nSpecial effects work at ILM quickly stretched the company to its operational limits. While the R&D work and experience gained from the previous two films in the trilogy allowed for increased efficiency, this was offset by the desire to have the closing film raise the bar set by each of these films. A compounding factor was the intention of several departments of ILM to either take on other film work or decrease staff during slow cycles. Instead, as soon as production began, the entire company found it necessary to remain running 20 hours a day on six-day weeks in order to meet their goals by April 1, 1983. Of about 900 special effects shots, all VistaVision optical effects remained in-house, since ILM was the only company capable of using the format, while about 400 4-perf opticals were subcontracted to outside effects houses. Progress on the opticals was severely retarded for a time due to ILM rejecting about 100,000 feet (30,000 m) of film when the film perforations failed image registration and steadiness tests.  ",
        "\nWhen Han and Leia are trapped by two troopers as they attempt to access the shield generator, Han confesses his love by saying \"I Love You\" to which Leia responds with \"I know\". This is an exact reverse of the conversation that took place in The Empire Strikes Back (1980) when Han is about to be frozen.  ",
        "\nThe biggest grossing film of 1983.  ",
        "\nAccording to crew members Ian McDiarmid was not the studios original choice to play Palpatine. Laurence Olivier had been rumoured to play Palpatine but eventually turned the role down. Frank Finlay, Harry Andrews and John Gielgud were considered for the role. It wasn't until the studio saw McDiarmd's performance in Dragonslayer (1981) that they he was cast as Palpatine.  ",
        "\n\"Ewok\" is derived from Miwok, a term for a series of Native-American tribes indigenous to Northern California where the Endor scenes were shot.  ",
        "\nThe trumpeting sound by the Ewoks at the end of the Battle of Endor is also heard in The Ten Commandments (1956).  ",
        "\nOnly film in the franchise in which no blue lightsabers appear (unless footage from trailers and poster art is counted).  ",
        "\nThe climactic battle in Swiss Family Robinson (1960) directly influenced the final Ewok skirmish with the various treehouse stunts and booby traps used on the empire.  ",
        "\nGeorge Lucas may have directed some of the second unit work personally as the shooting threatened to go over schedule; this is a function Lucas had willingly performed on previous occasions when he had only officially been producing a film. He did operate a B camera on the set a few times.  ",
        "\nThe deaths of Yoda and Darth Vader parallel the death of Qui-Gon Jinn in Star Wars: Episode I - The Phantom Menace (1999). Vader dies by throwing Palpatine into a chasm. Darth Maul dies the same way. Luke cradles his dying father next to that chasm, just as Obi-Wan does with Qui-Gon. Yoda tells Luke to pass on what he has learned, just as Qui-Gon tells Obi-Wan to train Anakin. Just as Obi-Wan's apprentice, Anakin Skywalker, turns to the Dark Side and becomes Darth Vader; Luke's apprentice and nephew Ben Solo turns to the Dark Side and becomes Kylo Ren.  ",
        "\nMichael Carter was cast as Bib Fortuna in this movie after casting director Mary Selway saw him appearing in the play \"The Streets of London\" in 1981. It took over eight hours of make-up to first transform him into Jabba the Hutt's Twi'lek advisor. By the end of his five-week shoot, make-up artist Nick Dudman had streamlined the process down to 58 minutes. Removing the make-up took another 25 minutes.  ",
        "\nWith the release of the Digital Movie Collection in 2015, the 20th Century Fox Fanfare was removed from this film and its predecessor. The ending of the track \"The Rebel Fleet/End Title\" from Star Wars: Episode V - The Empire Strikes Back (1980) now plays over the Lucasfilm logo. Star Wars: Episode IV - A New Hope (1977) retained the fanfare, as 20th Century Fox owns permanent distribution rights to the film.  ",
        "\nBoushh's (Leia in bounty hunter disguise) helmet has \"1138\" written on it. THX 1138 (1971) was Lucas' first feature film and is referenced many times in the series.  ",
        "\nDavid Cronenberg was offered the chance to direct. He declined the offer to make Videodrome (1983) and The Dead Zone (1983).  ",
        "\nKenny Baker's Ewok character, Paploo, was supposed to find Princess Leia unconscious after the speeder bike sequence, but Baker got a case of food poisoning before the scene was going to be filmed, so Warwick Davis's character, Wicket, became the Ewok who finds Leia.  ",
        "\nOne of the songs that the Ewoks sing sounds like: \"Det luktar flingor här\", which is Swedish for \"It smells of cereal here.\" (In fact, that line's lyrics are supposedly, \"G'noop dock fling oh ah.\") Another song sounds identical to a song sung in Caveman (1981).  ",
        "\nWhen Luke first enters Jabba's palace he gives the two guards the \"Darth Vader choke.\" At other times he uses the Force to pick up weapons or see targets clearly, but this is the only time in the entire trilogy he uses it to directly harm someone.  ",
        "\nIn his book \"Sculpting the Galaxy\", Lorne Peterson reveals that all shots featuring the second Death Star are flipped horizontally. The original model was unfinished on the left side, while in the film it appears to be unfinished on the right.  ",
        "\nClive Revill was never asked to reprise his role as Palpatine from Star Wars: Episode V - The Empire Strikes Back (1980).  ",
        "\nCostume designer Aggie Guerard Rodgers says that the inspiration for Leia's slave outfit came from the artwork of Frank Frazetta, which often focused on the female form.  ",
        "\nChris Parsons played C-3PO in 3 or 4 scenes, including the part where 3PO was carried on the chair by the Ewoks.  ",
        "\nThis is the first Star Wars film to show a lightsaber combat something other than another lightsaber. Luke on the Sail Barge fights guards with staffs and blasters. In Star Wars: Episode IV - A New Hope (1977) and Star Wars: Episode V - The Empire Strikes Back (1980), a lightsaber is seen only fighting another lightsaber. It should be noted that Obi-Wan's removal of Ponda Baba's arm does not count as a fight - but could be considered a combat between a lightsaber and another weapon.  ",
        "\nThe first stage of production started with 78 days at Elstree Studios in England, where the film occupied all nine stages.  ",
        "\nWhile filming, the film was called \"Blue Harvest\" in order to throw people off. It was said to be a horror film and advertisement products, such as t-shirts, were made. Many years later, an episode of Family Guy (1999) was called Family Guy: Blue Harvest (2007), which was an episode that spoofed Star Wars: Episode IV - A New Hope (1977).  ",
        "\nGeneral Madine was not scripted to have a beard, and Dermot Crowley showed up on set with a shaved face. The producers discovered that the Kenner toy based on the character had a beard, and presented Crowley with a prosthetic beard he would have to wear to match the figure. Alternate takes were shot of the rebel briefing in which he delivered Admiral Ackbar's exposition, but they were not used.  ",
        "\nBilly Dee Williams's stunt double was Julius LeFlore. LeFlore wears black gloves in the Sarlacc fight. Williams does not.  ",
        "\nExtras comprising of 130 Imperials, 40 Ewoks, and a cast and crew of 150 were used in the scene where the rebels are rounded up outside of the shield bunker, just before the final battle starts.  ",
        "\nThe Ewok language was based on Tibetan.  ",
        "\nAll the robots seen in Jabba's palace are the same as those seen on the Jawa's transporter in 'A New Hope'.  ",
        "\nThe only Star Wars movie from the Original Trilogy where we do not see Han Solo in the cockpit of the Millennium Falcon.  ",
        "\nPeter Mayhew had a stunt double for the part of the Sarlacc fight in which the skiff jolted, causing Han Solo to hang upside down.  ",
        "\nRobert Watts, a co-producer of the film, doubles as the scout walker driver who is thrown out of the scout walker by Chewbacca. This role was written for General Veers, who was played by Julian Glover in Star Wars: Episode V - The Empire Strikes Back (1980) Since he looks nothing like Glover, however, Watts is credited as \"Lieutenant Watts.\"  ",
        "\nThe film's shooting schedule was six weeks shorter that its predecessor.  ",
        "\nWILHELM SCREAM: Ewok killed while taking cover from the Imperial Walker turret fire.  ",
        "\nLuke and Han's meeting in Jabba's palace is the first time that Harrison Ford and Mark Hamill have been on-screen together since saying their goodbyes in Star Wars: Episode V - The Empire Strikes Back (1980).  ",
        "\nThough revealed to be twins, Mark Hamill (Luke) is actually 5 years older than Carrie Fisher (Leia) in real life.  ",
        "\nMany times in the trilogy, characters speak to each other in different languages, yet they seem to understand each other perfectly. The most famous example is Han Solo, who speaks English, and Chewbacca, who speaks in a series of growls.  ",
        "\nThis movie depicts the first time in the series that Han speaks directly to R2-D2. As the droids approach the Imperial bunker, Han shouts, \"C'mon! C'mon!\" to him.  ",
        "\nDraws themes from the Hindu epic 'Bhagvad Geeta'. Luke's conflicting emotions about going against his own father are similar to Arjuna's emotions on waging a war against the Kauravas; who are his close and dear ones like his cousins, relatives and teachers. Arjuna seeks counsel with Lord Krishna, who advises him that he has to do what he has to do, similar to the advice Obi-Wan gives Luke after his last visit to meet Yoda.  ",
        "\nElephants were used as inspiration for the All Terrain Armored Transporters' (AT-AT) characteristic walk.  ",
        "\nLuke Skywalker never actually fires his own blaster in the course of the films. In 'A New Hope' he loses his rifle to the Sand People and only uses weapons taken from Stormtroopers. In 'The Empire Strike Back' he never fires his handgun and in 'Return of the Jedi' he only uses the deck cannon on Jabba's barge.  ",
        "\nHarrison Ford had wanted Han Solo to die at the end of the previous film, Star Wars: Episode V - The Empire Strikes Back (1980), and that he didn't want to play the character again. But, George Lucas had at a different idea and instead, Lucas opted to have Han Solo frozen in carbonite and have him revived in this film, in case Ford changed his mind about playing Han Solo for a 3rd time.  ",
        "\nThree of Darth Vader's scenes in this film parallel scenes with Qui-Gon Jinn (Liam Neeson) in Star Wars: Episode I - The Phantom Menace (1999). The first line in this film is one of Vader's henchmen in his shuttle asking to board the Death Star. The first lines in Episode I are of Qui-Gon and his pilot asking to be let aboard the Trade Federation Control Ship. Vader's last scenes involve him throwing the Emperor down a chasm to his death, and being mortally wounded in the process. Qui-Gon's last scenes involve him being mortally wounded by Darth Maul, who is then cut in half by Obi-Wan, and falls down a chasm. In Qui-Gon's death scene, he predicts Anakin will bring balance--which he did in the former scene. The last shot is an overhead view of Obi-Wan holding his body next to the chasm that Darth Maul fell into. The second-to-last scene of Vader still alive is an overhead shot of Luke holding his mortally wounded body, next to the chasm Palpatine was cast into. The two shots are mirror images of each other: In this film, Luke and Vader are on the right, with the chasm on the left. In Episode I, Qui-Gon and Obi-Wan are on the left, with the chasm on the right. Both Qui-Gon and Anakin/Vader are given a funeral by cremation. The shot of Vader's funeral pyre has his head on the left side of the screen. The shot of Qui-Gon's pyre has his head on the right. The music from Qui-Gon's funeral is also played in the scene were Vader is released from surgery in his new armor.  ",
        "\nOn the official poster Luke is holding a blue lightsaber but in the actual film he wields a green lightsaber. The shift from a 'pure' blue to a more neutral green could be perceived as representing Luke's increased moral ambiguity in this film. As the series progresses he is seen to more and more resemble Darth Vader, dressing in black with a darker hair colour, artificial hand and facial scarring.  ",
        "\nThe 1997 Special Edition's theatrical release was slated for March 7, but was pushed back a week to March 14. Most posters promoting the special edition still have the inaccurate March 7 release date.  ",
        "\nThe illusion for the speeder bike chase scene is a clever trick: a cameraman walked through the woods with a steadicam that filmed one frame per second. Played back at 24 frames per second, a calm stroll looked like a hair-raising ride.  ",
        "\nIn a personal letter to friend actor Henry Dibling, Lindsay Anderson said that a role in this movie was offered to him (a \"Prince of Evil\" role, in his own words). He turned it down because he was busy with his own movie, Britannia Hospital (1982), by then. Coincidentally, Mark Hamill appeared in that film as well.  ",
        "\nAn early draft featured General Veers from the previous film as the commander of the Endor Garrison, personally leading the battle on the moon.  ",
        "\nThe planet 'Sullust' is mentioned first in this episode (and later in other Star Wars saga items). That name is obtained from 'Sallust(ius)'; an important ancient Roman writer.  ",
        "\nThis is the only film in the Original Trilogy to have green lightsabers, instead of blue ones.  ",
        "\nLucas intentionally mirrored the father/son conflict between Darth Vader and Luke and that of Zeus and Zeus' father Cronus.  ",
        "\nThe only film where Luke famously wears black clothing. Iconally despite being a Jedi many fans found this foreshadowing as black is a color of the Dark Side which Luke almost joined. The other characters to wear black in the series are Vader, Palpatine, Darth Maul, and Kylo Ren.  ",
        "\nAnakin becoming a force-ghost at the end is explained by George Lucas on the commentary, both Yoda and Obi-Wan taught him how to transcend into the force.  ",
        "\nErnie Fosselius, creator of the Star Wars: Episode IV - A New Hope (1977) spoof Hardware Wars (1978), appears as the voices of the rancor's keepers.  ",
        "\nIn New Zealand, the film was not released on VHS until 1987, 4 years after its cinema release.  ",
        "\nIncluded among the \"1001 Movies You Must See Before You Die\", edited by Steven Schneider.  ",
        "\nThe roofs of the Scout Walkers bear an uncanny resemblance to the roofs of the gun turrets on WWII German Tiger tanks-especially the small railings that these tanks had.  ",
        "\nThis is only the second film in the series to use American locations for live-action location filming.  ",
        "\nThe first time in the film series, as originally released, that was ever revealed that Vader's first name was once Anakin.  ",
        "\nThis is the only film in the original trilogy in which Chewbacca actually fires his Wookiee bowcaster (on Endor, at a fleeing biker scout). Although Luke refers to it in the film as a 'crossbow', Chewie's weapon was given its proper name by author Brian Daley in the 1981 NPR radio dramatization of \"Star Wars.\"  ",
        "\nAlthough they are featured in the movie, the name \"Ewoks\" was never mentioned.  ",
        "\nCarrie Fisher's birthmark (near the small of her back) is visible in the desert scene where she turns her back to the camera to swing around a mounted laser gun.  ",
        "\nAs seen in the theatrical trailers, Luke's new light saber had a blue laser blade instead of the green that appears in the finished film, as it had been in the first two movies. The blade was changed to green as being blue, it was difficult to make out against the sky during the attack on the sail barge scene.  ",
        "\nAlthough Admiral Ackbar is famous for his \"It's a trap!\" exclamation in this movie, Leia beats him to it in Star Wars: Episode V - The Empire Strikes Back (1980), as she warns Luke after he first arrives on Bespin.  ",
        "\nIt has been considered that JRR Tolkien's classic and influential fantasy story \"The Lord of the Rings\" may be a major influence behind the \"Star Wars\" saga. The final installment of the \"Lord of the Rings\" was titled \"Return of the King\".  ",
        "\nThe film had the working title of \"Blue Harvest\" with a tagline of \"Horror Beyond Imagination.\" This disguised what the production crew was really filming from fans and the press, and also prevented price gouging by service providers, as had happened in Norway while filming the previous film.  ",
        "\nIn the familiar theatrical one-sheet poster advertising the film, forearms assumed belong to Luke Skywalker are shown raising an ignited light-saber upward toward the starry sky. But the unidentified arms depicted are not those of Mark Hamill. Actually the arms are those of George Lucas.  ",
        "\nNear the end of the film, Luke burns Vader's body. In The Phantom Menace, Qui-Gon's body is also burned.  ",
        "\nDespite being a Jedi, Luke shows several traits that could lure him to the Dark Side, such as force choking, getting angry at Vader after the latter threatens to turn Leia to the Dark Side, and wearing black.  ",
        "\nThe first and only Star Wars film to contain nudity. Although it was accidental and is only visible to viewers who pause the scene, the Twi'lek dancer of Jabba's that falls into the Rantcor pit has her outfit come partially undone.  ",
        "\nA scene was filmed, but cut and edited from Yoda's death scene, which Yoda confesses to Luke about the truth about Darth Vader and keeping it from Luke and that he admits that Obi-Wan would had told him, if he had let him and that he fears for Luke whom now carries a great weakness and apologizes to Luke.  ",
        "\nThe closing music in the Endor victory celebration scene is changed completely in the Special Edition version.  ",
        "\nAn uncredited John Altman, who played a rebel pilot in the film, later went on to play antagonist Nick Cotton in the soap opera \"Eastenders\", which he played from 1985 - 2015. 2015 was the year \"Star Wars: Episode VII - The Force Awakens\" was released.  ",
        "\nThe slimy sound of Jabba the Hutt was mainly made by using a bowl of melted cheese.  ",
        "\nAt one point during production, it was heavily rumored that Luke would die in some way over the course of the film. This was an especially common Schoolyard/Playground rumor among the franchise's younger audience.  ",
        "\nReleased on VHS by CBS/Fox video in Australia and New Zealand in 1987.  ",
        "\nBen Burtt: the Imperial officer in the bunker who says \"Freeze!\" and gets knocked into the generator room by a thrown satchel. When he falls over the edge, he attempts to emulate the Wilhelm scream, which he made famous.  ",
        "\nListen very carefully as Darth Vader picks up the Emperor and throws him down the Death Star shaft. This is the only time the Jedi theme music plays over a shot of Vader, reflecting his return to the Light Side of the Force.  ",
        "\nMark Hamill has said he took great issue with the revelation that Luke and Leia are brother and sister, going so far as to accuse George Lucas of making the idea up on the plane ride to set! Lucas, however, wanted to end the Star Wars saga to spend more time with his family. Lucas therefore opted to combine the character of Luke's unseen sister with Leia, thus resolving the Skywalker family story line and the Han-Leia-Luke love triangle in this film, thereby making it the definitive end to the Star Wars saga. That would change years later with the sale of LucasFilm to Disney and production on Star Wars: Episode VII - The Force Awakens (2015), which would continue the story of the Skywalker family. The Disney-produced sequel trilogy, however, does not integrate any of Lucas' original ideas for post-Star Wars: Episode VI - Return of the Jedi (1983) sequels.  ",
        "\nYoda is the only Jedi that dies of natural causes.  ",
        "\nShooting the scene of Vader's unmasking was handled with so much secrecy that the actor, Sebastian Shaw was not even told what he would be doing until he arrived at the set. He was spotted by his old friend, Ian McDiarmid, who played the Emperor. He asked Shaw what he was doing there, and Shaw answered, \"I don't know. They haven't told me anything about it except that it has something to do with science fiction.\"  ",
        "\nMark Hamill pitched the idea of Luke donning Darth Vader's helmet after Vader's death, leaving the ending and Luke's character more ambiguous or ominous. George Lucas disagreed, opting for a happy ending.  ",
        "\nWhen Vader saves Skywalker by killing Palpatine, he fulfills the Jedi prophecy. He destroys the embodiment of the Dark Side and returns to the light. In doing so, he brings balance to the Force, just as the prophecy predicted.  ",
        "\nIn the most recent special edition, the force-ghost of Anakin Skywalker portrayed by Sebastian Shaw is replaced with one by Hayden Christensen from Star Wars: Episode III - Revenge of the Sith (2005). George Lucas felt the force-ghost should represent Anakin as he was before he succumbed to the Dark Side. Also, in \"Sith\", Anakin was horribly burned and lost both legs and his left hand, an aspect added after the original trilogy. Despite the explanation by Lucas, or perhaps because of it, many fans were outraged over the change and wrote angry letters to Lucas.  ",
        "\nWhen George Lucas originally mapped out the plot of the entire \"Star Wars\" series, he refined the backstory he'd used writing the original film, and concocted further stories for sequels. Initially thinking the series would run two trilogies, he eventually settled on three. The original trilogy would follow Luke Skywalker as he became a Jedi and fought Darth Vader. The second \"prequel\" trilogy would follow young Obi-Wan Kenobi and the fall of Anakin Skywalker. The third, a sequel trilogy, would follow Luke twin sister, Nelleth Skywalker. Originally, this film would have ended with Luke defeating Vader and embarking on the search for Nelleth. However, with production of Star Wars: Episode V - The Empire Strikes Back (1980) and this film taking an enormous toll on Lucas' health and personal life (he and wife Marcia Lucas divorced shortly after the release of this film), he opted to end the series here by making Leia into Luke's sister.  ",
        "\nThe raspy, labored breathing heard from Darth Vader after he kills the Emperor was originally meant to be how his breathing sounded when he was first introduced in Star Wars: Episode IV - A New Hope (1977). The sound of this labored breathing was kept and used for this film.  ",
        "\nThe blue energy seen after Palpatine's death is the essence of the Dark Side of the Force.  ",
        "\nIn the March 1997 issue of Nickelodeon Magazine, James Earl Jones admitted that he didn't believe that Darth Vader truly became a good guy at the end. When asked, he replied with, \"Not necessarily. I didn't want to believe him. I thought he was lying.\"  ",
        "\nDarth Vader's funeral pyre was added at the very last minute, long after principle photography and pick-ups had wrapped. The scene was thrown together and shot near the hills of Skywalker Ranch.  ",
        "\nIn the Special Edition release, when The Emperor is trying to kill Luke with the Dark Side lightning, Vader has an added short line: \"no, NO!\" and then picks up The Emperor and drops him down the shaft. In all other video releases, Vader says nothing during this scene.  ",
        "\nAfter appearing in this film, Wedge becomes the only X-wing pilot character (apart from Luke) who survives all three films.  ",
        "\nMany viewers commented about Leia's inability to see the Force-Ghosts of Ben, Yoda, and most importantly her father, Anakin. In the Star Wars novel, 'Truce at Bakura' - which takes place immediately after \"Return of the Jedi\" - Anakin does appear to Leia, to ask for her forgiveness.  ",
        "\nBefore the Millennium Falcon leaves for the final battle with the Death Star, Han says, \"I just got a funny feeling, like I'm not gonna see her again.\" This would seem to foreshadow the Falcon's demise in battle. But it doesn't. Researchers have looked into the matter from the first scripts of this movie, and have found that in all drafts of the script, Lando and the Falcon survive. All claims that the Falcon would not survive are urban legends, forgeries, or mistaken assumptions.  ",
        "\nIt is rumored that a different ending was shot, but discarded later on. It featured the (long awaited) marriage between Leia Organa and Han Solo. In the Star Wars \"Expanded Universe\" books, they go on to marry and raise a brood.  ",
        "\nIn the 2004 DVD release, Sebastian Shaw (older Anakin Skywalker) is replaced in the celebration scene by Hayden Christensen, the actor that portrayed Anakin in Episodes II and III.  ",
        "\nAs part of the Star Wars Expanded Universe lore, it is explained that Boba Fett actually survived the Sarlacc and went on to battle Han, Luke, etc. for many years following the events of ROTJ.  ",
        "\nAfter Yoda's death for the first and only time Luke addresses Obi-Wan Kenobi as 'Obi-Wan' rather then 'Ben' as he did in the first two films.  ",
        "\nThe 1997 CD-ROM Star Wars: Behind the Magic confirms that the sequence showing the cremation of Vader's body/armor was directed by George Lucas himself, although uncredited.  ",
        "\nThe scenes showing the Empire firing the new Death Star super laser for the first time and the Empire escaping before Vader is unmasked by Luke are 'recycled' scenes from Star Wars: Episode IV - A New Hope (1977) but the scenes are mirrored.  ",
        "\nThe film takes place 1 year after \"Star Wars: Episode V - The Empire Strikes Back\".  ",
        "\nWhen Vader throws the Emperor into the shaft, the brief image of a skull can be seen superimposed on his visor.  ",
        "\nVader threatens to turn Leia to the Dark Side. In Star Wars: Episode VII - The Force Awakens (2015), it is her son who has been turned.  ",
        "\nFrom an engineering perspective, both Death Stars were poorly constructed because they did not have either safety or redundancy systems. When Wedge and Lando shot out the power regulator, the entire reactor exploded. A properly engineered power generator would have multiple backups and safety protocols to prevent such an occurrence.  ",
        "\nOriginally Princess Leia was not Luke's twin-sister. Luke's twin sister would be called Nellith Skywalker and that she had been taken to the other side of the galaxy to be trained as a Jedi. George Lucas had originally planned the sequels to follow Luke's search for Nellith.  ",
        "\nThe close up shot of Luke Skywalker watching a dying Yoda disappear and become one with The Force was filmed in slow motion to give the scene a dramatic effect.  ",
        "\nProminent UK newspaper The Daily Mail ran a story shortly before the film's release, revealing that Darth Vader might die at the end. It was suggested that David Prowse was behind the leak, which led to his subsequent strained relationship with Lucasfilm (he wasn't interviewed for the DVD release of the original trilogy, and hasn't made any appearances at official Star Wars-related events, as of 2016). Prowse has denied being the one who told the newspaper about Vader's death, since he was unaware of it himself. It later emerged that unnamed crew members were responsible for the leak.  ",
        "\nRey (Daisy Ridley) is born 11 years after the Battle of Endor. See: Star Wars: The Force Awakens (2015).  ",
        "\nLuke's mechanical hand gets shot. Leia gets shot in the shoulder. Luke cuts off Darth Vader's hand. See also Star Wars: Episode IV - A New Hope (1977) and Star Wars: Episode V - The Empire Strikes Back (1980).  ",
        "\nIn the scene which Luke meets Emperor Palpatine, The Emperor tells Luke that is he mistaken about many different things when Luke says to him that he will not covert him to the dark side like he did with his father. In the prequel Star Wars: Episode III: Revenge of the Sith (2005), Palpatine manipulated Anakin Skywalker into pledging himself to the dark side of the Force, which he dubbed him Darth Vader, by making Anakin/Vader believe that the Jedi are scheming to take over the Republic and that if Anakin pledges himself to him, they will save Anakin's secret wife Senator Padme Amidala together by discovering the secret behind Darth Plageuis's power to stop people from dying, which Palpatine tells as a tale to Anakin in order to lure Anakin to dark side.  ",
        "\nThe bullfrog in the underwater Gungan City is based on Jabba the Hut since Jabba eats bullfrogs. He's seen in this movie eating a bucket of bullfrogs and opens the pod race in Episode I by biting the head off a frog and spitting it onto the gong to start the race. Their skin tones also match the environment they live in.  "
    ],
    "cameo": [
        "\nBen Burtt: the Imperial officer in the bunker who says \"Freeze!\" and gets knocked into the generator room by a thrown satchel. When he falls over the edge, he attempts to emulate the Wilhelm scream, which he made famous.  "
    ],
    "spoiler": [
        "\nListen very carefully as Darth Vader picks up the Emperor and throws him down the Death Star shaft. This is the only time the Jedi theme music plays over a shot of Vader, reflecting his return to the Light Side of the Force.  ",
        "\nMark Hamill has said he took great issue with the revelation that Luke and Leia are brother and sister, going so far as to accuse George Lucas of making the idea up on the plane ride to set! Lucas, however, wanted to end the Star Wars saga to spend more time with his family. Lucas therefore opted to combine the character of Luke's unseen sister with Leia, thus resolving the Skywalker family story line and the Han-Leia-Luke love triangle in this film, thereby making it the definitive end to the Star Wars saga. That would change years later with the sale of LucasFilm to Disney and production on Star Wars: Episode VII - The Force Awakens (2015), which would continue the story of the Skywalker family. The Disney-produced sequel trilogy, however, does not integrate any of Lucas' original ideas for post-Star Wars: Episode VI - Return of the Jedi (1983) sequels.  ",
        "\nYoda is the only Jedi that dies of natural causes.  ",
        "\nShooting the scene of Vader's unmasking was handled with so much secrecy that the actor, Sebastian Shaw was not even told what he would be doing until he arrived at the set. He was spotted by his old friend, Ian McDiarmid, who played the Emperor. He asked Shaw what he was doing there, and Shaw answered, \"I don't know. They haven't told me anything about it except that it has something to do with science fiction.\"  ",
        "\nMark Hamill pitched the idea of Luke donning Darth Vader's helmet after Vader's death, leaving the ending and Luke's character more ambiguous or ominous. George Lucas disagreed, opting for a happy ending.  ",
        "\nWhen Vader saves Skywalker by killing Palpatine, he fulfills the Jedi prophecy. He destroys the embodiment of the Dark Side and returns to the light. In doing so, he brings balance to the Force, just as the prophecy predicted.  ",
        "\nIn the most recent special edition, the force-ghost of Anakin Skywalker portrayed by Sebastian Shaw is replaced with one by Hayden Christensen from Star Wars: Episode III - Revenge of the Sith (2005). George Lucas felt the force-ghost should represent Anakin as he was before he succumbed to the Dark Side. Also, in \"Sith\", Anakin was horribly burned and lost both legs and his left hand, an aspect added after the original trilogy. Despite the explanation by Lucas, or perhaps because of it, many fans were outraged over the change and wrote angry letters to Lucas.  ",
        "\nWhen George Lucas originally mapped out the plot of the entire \"Star Wars\" series, he refined the backstory he'd used writing the original film, and concocted further stories for sequels. Initially thinking the series would run two trilogies, he eventually settled on three. The original trilogy would follow Luke Skywalker as he became a Jedi and fought Darth Vader. The second \"prequel\" trilogy would follow young Obi-Wan Kenobi and the fall of Anakin Skywalker. The third, a sequel trilogy, would follow Luke twin sister, Nelleth Skywalker. Originally, this film would have ended with Luke defeating Vader and embarking on the search for Nelleth. However, with production of Star Wars: Episode V - The Empire Strikes Back (1980) and this film taking an enormous toll on Lucas' health and personal life (he and wife Marcia Lucas divorced shortly after the release of this film), he opted to end the series here by making Leia into Luke's sister.  ",
        "\nThe raspy, labored breathing heard from Darth Vader after he kills the Emperor was originally meant to be how his breathing sounded when he was first introduced in Star Wars: Episode IV - A New Hope (1977). The sound of this labored breathing was kept and used for this film.  ",
        "\nThe blue energy seen after Palpatine's death is the essence of the Dark Side of the Force.  ",
        "\nIn the March 1997 issue of Nickelodeon Magazine, James Earl Jones admitted that he didn't believe that Darth Vader truly became a good guy at the end. When asked, he replied with, \"Not necessarily. I didn't want to believe him. I thought he was lying.\"  ",
        "\nDarth Vader's funeral pyre was added at the very last minute, long after principle photography and pick-ups had wrapped. The scene was thrown together and shot near the hills of Skywalker Ranch.  ",
        "\nIn the Special Edition release, when The Emperor is trying to kill Luke with the Dark Side lightning, Vader has an added short line: \"no, NO!\" and then picks up The Emperor and drops him down the shaft. In all other video releases, Vader says nothing during this scene.  ",
        "\nAfter appearing in this film, Wedge becomes the only X-wing pilot character (apart from Luke) who survives all three films.  ",
        "\nMany viewers commented about Leia's inability to see the Force-Ghosts of Ben, Yoda, and most importantly her father, Anakin. In the Star Wars novel, 'Truce at Bakura' - which takes place immediately after \"Return of the Jedi\" - Anakin does appear to Leia, to ask for her forgiveness.  ",
        "\nBefore the Millennium Falcon leaves for the final battle with the Death Star, Han says, \"I just got a funny feeling, like I'm not gonna see her again.\" This would seem to foreshadow the Falcon's demise in battle. But it doesn't. Researchers have looked into the matter from the first scripts of this movie, and have found that in all drafts of the script, Lando and the Falcon survive. All claims that the Falcon would not survive are urban legends, forgeries, or mistaken assumptions.  ",
        "\nIt is rumored that a different ending was shot, but discarded later on. It featured the (long awaited) marriage between Leia Organa and Han Solo. In the Star Wars \"Expanded Universe\" books, they go on to marry and raise a brood.  ",
        "\nIn the 2004 DVD release, Sebastian Shaw (older Anakin Skywalker) is replaced in the celebration scene by Hayden Christensen, the actor that portrayed Anakin in Episodes II and III.  ",
        "\nAs part of the Star Wars Expanded Universe lore, it is explained that Boba Fett actually survived the Sarlacc and went on to battle Han, Luke, etc. for many years following the events of ROTJ.  ",
        "\nAfter Yoda's death for the first and only time Luke addresses Obi-Wan Kenobi as 'Obi-Wan' rather then 'Ben' as he did in the first two films.  ",
        "\nThe 1997 CD-ROM Star Wars: Behind the Magic confirms that the sequence showing the cremation of Vader's body/armor was directed by George Lucas himself, although uncredited.  ",
        "\nThe scenes showing the Empire firing the new Death Star super laser for the first time and the Empire escaping before Vader is unmasked by Luke are 'recycled' scenes from Star Wars: Episode IV - A New Hope (1977) but the scenes are mirrored.  ",
        "\nThe film takes place 1 year after \"Star Wars: Episode V - The Empire Strikes Back\".  ",
        "\nWhen Vader throws the Emperor into the shaft, the brief image of a skull can be seen superimposed on his visor.  ",
        "\nVader threatens to turn Leia to the Dark Side. In Star Wars: Episode VII - The Force Awakens (2015), it is her son who has been turned.  ",
        "\nFrom an engineering perspective, both Death Stars were poorly constructed because they did not have either safety or redundancy systems. When Wedge and Lando shot out the power regulator, the entire reactor exploded. A properly engineered power generator would have multiple backups and safety protocols to prevent such an occurrence.  ",
        "\nOriginally Princess Leia was not Luke's twin-sister. Luke's twin sister would be called Nellith Skywalker and that she had been taken to the other side of the galaxy to be trained as a Jedi. George Lucas had originally planned the sequels to follow Luke's search for Nellith.  ",
        "\nThe close up shot of Luke Skywalker watching a dying Yoda disappear and become one with The Force was filmed in slow motion to give the scene a dramatic effect.  ",
        "\nProminent UK newspaper The Daily Mail ran a story shortly before the film's release, revealing that Darth Vader might die at the end. It was suggested that David Prowse was behind the leak, which led to his subsequent strained relationship with Lucasfilm (he wasn't interviewed for the DVD release of the original trilogy, and hasn't made any appearances at official Star Wars-related events, as of 2016). Prowse has denied being the one who told the newspaper about Vader's death, since he was unaware of it himself. It later emerged that unnamed crew members were responsible for the leak.  ",
        "\nRey (Daisy Ridley) is born 11 years after the Battle of Endor. See: Star Wars: The Force Awakens (2015).  ",
        "\nLuke's mechanical hand gets shot. Leia gets shot in the shoulder. Luke cuts off Darth Vader's hand. See also Star Wars: Episode IV - A New Hope (1977) and Star Wars: Episode V - The Empire Strikes Back (1980).  ",
        "\nIn the scene which Luke meets Emperor Palpatine, The Emperor tells Luke that is he mistaken about many different things when Luke says to him that he will not covert him to the dark side like he did with his father. In the prequel Star Wars: Episode III: Revenge of the Sith (2005), Palpatine manipulated Anakin Skywalker into pledging himself to the dark side of the Force, which he dubbed him Darth Vader, by making Anakin/Vader believe that the Jedi are scheming to take over the Republic and that if Anakin pledges himself to him, they will save Anakin's secret wife Senator Padme Amidala together by discovering the secret behind Darth Plageuis's power to stop people from dying, which Palpatine tells as a tale to Anakin in order to lure Anakin to dark side.  ",
        "\nThe bullfrog in the underwater Gungan City is based on Jabba the Hut since Jabba eats bullfrogs. He's seen in this movie eating a bucket of bullfrogs and opens the pod race in Episode I by biting the head off a frog and spitting it onto the gong to start the race. Their skin tones also match the environment they live in.  "
    ]
}