{
    "common": [
        "During filming, Ewan McGregor made lightsaber noises as he dueled. It was noted and corrected during post-production.  ",
        "20th Century Fox released the first trailer, with strict instructions that it not be shown before a certain date. When a Canadian movie theater accidentally showed it a day early, they lost the rights to show the movie.  ",
        "After the film's end credits finish rolling, the sound effect of Darth Vader's breathing can be heard.  ",
        "According to Star Wars canon, Obi-Wan's hanging braid is a Jedi tradition common to all Padawan Learners. When his Master feels that he has reached proper maturity, he cuts the braid with his lightsaber, signifying that the student is now a full Jedi Knight.  ",
        "Sets were built only as high as the tops of the actors' heads and computer graphics filled in the rest. Liam Neeson was so tall, that he cost the set crew an extra 150,000 dollars in construction.  ",
        "Natalie Portman (Queen Amidala) missed the premiere party in New York City, because she had to go home to study for her high school final exams.  ",
        "During the first week of the first trailer's release, many theaters reported up to 75 percent of their audiences paying full price for a movie, then walking out after the Star Wars: Episode I trailer was shown.  ",
        "Natalie Portman's voice was digitally enhanced to distinguish between Padmé and Queen Amidala.  ",
        "Liam Neeson convinced George Lucas to keep a scene where Qui-Gon Jinn puts his hand on Shmi Skywalker's shoulder. Lucas felt this might be out of character for the monk-like Jedi, but Neeson thought there should be an emotional connection between the characters. In an interview with Premiere magazine, Neeson defended his action, saying, \"It may be 'Star Wars', but we've got to have something in there for the adults.\"  ",
        "Qui-Gon Jinn's communicator is a redecorated Sensor Excel Razor for Women.  ",
        "When fully dressed, and in make-up, Natalie Portman and Keira Knightley resembled each other so much, that even Knightley's mother Sharman Macdonald, who visited the set, had trouble identifying her own daughter.  ",
        "The word lightsaber is never used in the film. When Anakin talks to Qui-Gon he calls it a \"laser sword\".  ",
        "Jake Lloyd has said that he retired from acting because of the trauma he experienced after playing Anakin Skywalker. According to Lloyd, other children constantly teased him about the role. For example they would make lightsaber sounds whenever he walked by. Lloyd also said that the situation was made worse because, in his opinion, the film did not meet the fans' expectations. Despite this, Lloyd has reprised the role of Anakin in several video games and has appeared at Star Wars conventions/events.  ",
        "The sound of the underwater monsters growling near the beginning of the film was made by the main sound technician's three-year-old daughter. The sound of her crying was recorded, and the frequency lowered to obtain the sound heard in the film.  ",
        "Benicio Del Toro was originally set to play Darth Maul. Del Toro left the film after George Lucas took most of Maul's lines out of the film.  ",
        "In the Galactic Senate scene, when Queen Amidala is asking for a vote of no confidence, and the whole Senate are on their feet shouting, in the lower left corner you can see that there are E.T. species (as in movie E.T. - O Extraterrestre (1982)). George Lucas included them, as a tribute to his long-time friend, Steven Spielberg, as well as showing them existing in the same universe.  ",
        "Ewan McGregor studied many of Alec Guinness' films, including Guerra nas Estrelas (1977), to ensure accuracy in everything from his accent to pacing of his words.  ",
        "At the time of the film's release, the producers ran a disinformation campaign to suggest that Natalie Portman played both Padmé and The Queen at all times. In fact, they are not always the same person. For many sections of the film, notably those where The Queen is wearing the black outfit with the huge feather headdress, she is actually a decoy, played by Keira Knightley. The real queen, Portman, is actually disguised as a handmaiden. Various conflicting public statements make it extremely difficult to figure out who is who. Whole websites are devoted to figuring out which actress is playing which handmaiden or The Queen at any given point.  ",
        "Anakin's theme is a musical variation on the Imperial March (a.k.a. Darth Vader's Theme) from O Império Contra-Ataca (1980).  ",
        "EASTER EGG: The starship Enterprise from Jornada nas Estrelas: A Nova Geração (1987) can be seen briefly amongst the traffic flying around Coruscant.  ",
        "Tupac Shakur (a Star Wars fan since childhood) expressed interest in reading for a role, even lobbying mutual friends of his and George Lucas' to get them in touch with each other to set up a meeting so he could read but his tragic murder in September 1996 prevented any such meeting from taking place. It has been speculated that he was up for the part of Mace Windu, but the character name was not publicly known before filming started, and it was not specifically written for an African-American until Samuel L. Jackson was cast. In early concept art, Windu was drawn as an alien and also with the likeness of Concept Designer Doug Chiang.  ",
        "Darth Maul only speaks a total of three lines.  ",
        "EASTER EGG: In the \"Options\" menu, key in \"11\" enter, \"3\" enter, \"8\" enter, and you will see bloopers mostly of R2-D2 falling during various takes of the film.  ",
        "The script explains that the reason Watto is always flying, is that he is crippled. Look closely, and you can see that one foot is longer than the other. He also talks out of the side of his mouth, because the broken tusk slurs his words.  ",
        "A few USC students took the Japanese LaserDisc and made their own edit of the movie. Contrary to popular belief, it does NOT cut out all scenes featuring Jar-Jar Binks, but does remove many of his sillier and more distracting moments, and makes many other minor tweaks. It became known as the \"Phantom Edit\". George Lucas requested to see a copy, and then Lucasfilm issued a press release reiterating that it is illegal to copy and/or edit a Lucasfilm property.  ",
        "Ian McDiarmid was surprised, when George Lucas approached him sixteen years after O Retorno de Jedi (1983), to reprise the role of Palpatine, because he had assumed that a younger actor would play the part in the prequels.  ",
        "To create the sounds of the spectators during the pod race scene, Sound Designer Ben Burtt took a recorder to a San Francisco 49ers game, and recorded the crowd's reactions.  ",
        "Scenes of straightforward dialogue may be comprised of up to six layers of computer-composited imagery, as the following example shows. In one scene, Natalie Portman's best take had been take seven while Jake Lloyd's was take one. The two takes were spliced together. However, Lloyd's mouth at the end of the scene is still gaped open, so the same segment from take fifteen (in which his mouth is closed) is patched in. Furthermore, when Portman appears to look down from Lloyd instead of up, those few seconds were run backwards, which unexpectedly caused steam in the background to rise in reverse. The problem was fixed by flipping the steam backwards. All these fixes resulted in a seamless scene. This technique prompted Liam Neeson, upon the film's release, to complain thus, \"We are basically puppets. I don't think I can live with the inauthenticity of movies anymore.\"  ",
        "George Lucas made a similar deal as he did in the original Guerra nas Estrelas (1977). Lucas and 20th Century Fox agreed that he would forego his salary as a director, provided he owns the entire negative of the final cut of the film, as well as ancillary rights of all toys and commercial tie-ins.  ",
        "In 1997, a fierce sandstorm destroyed several of the Tatooine sets in the desert outside Tozeur, Tunisia. Filming resumed two days later. George Lucas considered this a good omen, as the very same thing had happened during filming of the original Guerra nas Estrelas (1977).  ",
        "The movie was shipped to theaters as \"The Doll House\" to thwart piracy attempts.  ",
        "Anthony Daniels (C-3PO), Kenny Baker (R2-D2), Frank Oz (Yoda) and Ian McDiarmid (Palpatine) are the only actors to reprise their roles from the original \"Star Wars\" trilogy.  ",
        "The name used by the Queen while in disguise (and, later, after her term as Queen ends), \"Padmé\", is the Sanskrit word for \"lotus\". \"Yoda\" is also derived from the Sanskrit word for \"warrior\".  ",
        "The blue haired slave girl seen beside Jabba the Hutt before the pod race is wearing the same slave costume worn by Princess Leia Organa in O Retorno de Jedi (1983).  ",
        "Keira Knightley's parents tried to convince her not to audition, but the 12 year-old actress still sought a role, given she was a Star Wars fan.  ",
        "Earlier drafts of the script placed more emphasis on the character of Obi-Wan Kenobi. Originally, he was already a fully trained Jedi by the start of the movie, and also the only Jedi negotiator sent to Naboo. In this same draft, the character of Qui-Gon Jinn was not introduced until the characters reached Coruscant, and that character was of the same age of Obi-Wan, not his mentor.  ",
        "Tests were conducted to see if Yoda could be realized digitally, but it was determined that the technology was not up to scratch. A CGI model of Yoda was nevertheless created, but only used in one shot, a long shot, during the scene on Couriscant, near the end, where Obi-Wan Kenobi and Yoda discuss Anakin's future.  ",
        "Palpatine's line \"There is no civility, there is only politics\" is a corruption of part of the Jedi Code which consists of a negative assertion followed by a positive one. For example: \"There is no fear, there is only calm. There is no death, there is only the Force.\"  ",
        "Dates in Star Wars are based around the Battle of Yavin (in Guerra nas Estrelas (1977)): Star Wars: Episódio I - A Ameaça Fantasma (1999) takes place 32 years BBY (Before the Battle of Yavin),Star Wars: Episódio II - Ataque dos Clones (2002) is 22 BBY,Star Wars: Episódio III - A Vingança dos Sith (2005) is 19 BBY,Guerra nas Estrelas (1977): is 0 BBY,O Império Contra-Ataca (1980) is 3 years ABY (After the Battle of Yavin),O Retorno de Jedi (1983) is 4 ABY.  ",
        "According to the Blu-ray commentary, the scene where Padmé and Anakin first talk, is the one that was used to audition potential Anakin actors. The crew also states that Jake Lloyd did not like filming this particular scene.  ",
        "During the credits Jabba the Hutt is listed as being played by 'himself'.  ",
        "The core-plot of the movie came from George Lucas' first draft of Guerra nas Estrelas (1977), which he wrote in 1975.  ",
        "According to Jake Lloyd, there was a six-hour cut of the film that was screened for several people before the film was released, with those who saw it proclaiming it to be \"mindbogglingly good\". Like the later \"Lost Cut\" of Guerra nas Estrelas (1977), this cut has never been released publicly.  ",
        "In the original trilogy, lightsaber activations and deactivations happened off-screen most of the time to prevent the \"jumps\" that would occur when the film was stopped to allow the \"activated\" lightsaber props to be substituted for the deactivated handles. This no longer poses a problem and every activation/deactivation occurs on-screen in this film.  ",
        "The sound of the hovering battle tanks, used by the battle droids, was created by running an electric razor around a metal salad bowl, and then digitally lowering the pitch.  ",
        "Ewan McGregor, who plays Obi-Wan Kenobi, is the nephew of Denis Lawson, who played Rebel pilot Wedge Antilles in the original trilogy.  ",
        "According to the script, the chance cube that Watto rolled with Qui-Gon was fixed to land on red. That's why he was so mad when Qui-Gon tampered with it, to land on blue.  ",
        "Jake Lloyd retired from acting in 2001, citing bullying on the part of classmates, and the stress of doing up to sixty interviews a day, as his reasons for doing so. He stated in a 2012 interview, that being in the film, ruined his childhood and his acting career, and that he destroyed all of his Star Wars memorabilia out of anger toward the film. However, an interview with a Star Wars fansite has confirmed, that he's mellowed out since then, and contrary to popular belief, he does not hate Star Wars after all the bullying.  ",
        "Ewan McGregor was cast from a shortlist of fifty actors, all of whom had to be compared to pictures of young Alec Guinness.  ",
        "Qui-Gon Jinn identifies the Queen's starship as a Nubian model J-327. \"327\" was the number of the landing bay where the Millennium Falcon landed on the first Death Star in Guerra nas Estrelas (1977) as well as the number of the landing platform in Cloud City in O Império Contra-Ataca (1980).  During the introduction of the pod racers, one of the pods is \"327\".  ",
        "According to Ahmed Best in a Rolling Stone article, Michael Jackson \"campaigned\" for the role of Jar Jar Binks, but George Lucas decided against casting him, because his star status would \"compromise\" the film. At one point, Lucas took Best and Natalie Portman backstage at a concert, and introduced Best to Jackson to gain the singer's approval.  ",
        "Vin Diesel, Morgan Freeman, Tom Hanks, Kyle MacLachlan, Kurt Russell and Denzel Washington were considered for the role of Qui-Gon Jinn.  ",
        "The special effects teams creating the podrace, studied NASCAR crash footage extensively, to assure accuracy in the crashes.  ",
        "The announcer at the Pod Race welcomes people, \"...from all the Outer Rim Territories.\" This is a reference to the galaxy's grouping. The Star Wars galaxy is organized in concentric circles. Starting at the center and moving outward the circles are, The Deep Core, Core, Colonies, Inner Rim, Expansion Region, Mid Rim, Outer Rim, Wild Space, Unknown Regions.  ",
        "Darth Maul's double-bladed lightsaber design, was borrowed from the 1996 comic book series \"Tales of the Jedi: The Sith War\".  ",
        "The interiors of the palace on Naboo were shot in an Italian palace, the Reggia Reale (Royal Palace) of Caserta (now used mostly as a museum). However, the palace had candelabras on the wall which had to be removed prior to shooting. One of the curators, there to watch that the crew doesn't make damages, played one of Amidala's counselors.  ",
        "Liam Neeson was so eager to be in the film that he signed on without having read the script.  ",
        "Regarding some rumors saying that he \"felt like a puppet while working on the film, Liam Neeson said, \"That's simply not true,\" and that he had \"absolutely no misgivings\" about being in it, adding that George Lucas was \"very good\" to work with. \"He was clear about what he wanted,\" said Neeson.  ",
        "While referred to numerous times by other characters, Yoda is only clearly identified at the very end of the film. Mace Windu is never identified at all.  ",
        "In both of his identities, Darth Sidious/Palpatine makes his first appearance as a hologram. This is in keeping with the original trilogy, when his first appearance was a holographic communication with Darth Vader in O Império Contra-Ataca (1980).  ",
        "Obi-Wan has \"a bad feeling about this\" quite often. See also Guerra nas Estrelas (1977), O Império Contra-Ataca (1980), and O Retorno de Jedi (1983).  ",
        "George Lucas reportedly wrote Star Wars: Episódio I - A Ameaça Fantasma (1999) in the same binder of yellow ruled paper, in which he wrote the original Guerra nas Estrelas (1977), as well as Loucuras de Verão (1973).  ",
        "Natalie Portman worked extensively with a voice coach on what kind of dialect Queen Amidala would have. They settled on a classically imperious kind of tone, the type that Katharine Hepburn or Lauren Bacall would have used in their heyday. Portman's voice was then electronically lowered in post-production to make her sound more queenly.  ",
        "George Lucas's very first draft of Guerra nas Estrelas (1977) began, \"This is the story of Mace Windu, a revered Jedi-bendu of Opuchi who was related to Usby C.J. Thape, a padawan learner of the famed Jedi.\" Both the character of Mace Windu and the concept of padawan learners make their first appearance in Star Wars: Episódio I - A Ameaça Fantasma (1999).  ",
        "The sound of the \"force field\" in the lightsaber duel with Darth Maul, began as a recording of the Audio Supervisor's neighbor's ceiling fan.  ",
        "\"Phantom Menace\" was the name of a villain in the \"Flash Gordon\" comics. The same name used by NASA to refer to the fact that so few of their attempts to send a probe to Mars, were successful, to the point that the missions seemed cursed.  ",
        "C-3P0 was originally only supposed to appear in scenes set in, and around the slave quarters. During post-production, George Lucas decided to optically add the droid to several outside scenes.  ",
        "When Palpatine lands at Naboo at the end of the film, he's accompanied by Senate Guards dressed in blue. The guards' costumes are similar to those of the red Emperor's guards seen in Star Wars: Episódio II - Ataque dos Clones (2002), Star Wars: Episódio III - A Vingança dos Sith (2005), and O Retorno de Jedi (1983), and are, in a way, predecessors to the later red guards.  ",
        "Ewan McGregor recalled that his performance in the film consisted of 'walking into rooms and looking up'.  ",
        "Richard Armitage appears in this film, and can be seen standing beside Natalie Portman, at the point where the Naboo guards use the ascension guns to climb to the window above.  ",
        "Ahmed Best, who supplies the voice of Jar Jar Binks, also appears as a Jedi Knight when the newly appointed Chancellor Palpatine arrives on Naboo.  ",
        "On his way to England to be fitted for the suit of Jar Jar Binks, Ahmed Best suffered severe burns when hot tea was spilled into his lap. Best endured great pain while a cast of his body was made, but told no one about his injury, unwilling to take any chance that might jeopardize his role.  ",
        "In the Senate scene, one of the pods contains creatures that resemble E.T., an obvious tribute to George Lucas' friend, Steven Spielberg. Author James Luceno fleshed out this group of aliens in his Star Wars novel, \"Cloak of Deception.\" They are from the planet Brodo Asogi, and they are represented by Senator Greblieps (Spielberg spelled backwards.)  ",
        "George Lucas asked Lawrence Kasdan to write the script (and possibly for Star Wars: Episódio II - Ataque dos Clones (2002) and Star Wars: Episódio III - A Vingança dos Sith (2005) as well), but he turned it down, because he thought with O Império Contra-Ataca (1980) and O Retorno de Jedi (1983), Lucas's relationship to the movies had taken one step back, and that he alone should take responsibility, and make exactly the movie he wanted to make.  ",
        "Kenneth Branagh was originally considered for the part of the younger Obi-Wan Kenobi.  ",
        "When Yoda agrees that Anakin will be Obi-Wan's apprentice, a dragon can be seen out the window, flying in the sky.  ",
        "The Neimodians were originally to be computer generated creatures, but to save costs, they were changed into men wearing masks. Animatronic Model Designer John Coppinger quickly recycled animatronic masks from O Quinto Elemento (1997), to use as the basis for their facial movements.  ",
        "EASTER EGG: If you highlight the THX logo, in the Language Selection page on the DVD, and press \"11\" enter, \"3\" enter, \"8\" enter, with the remote, you will access a hidden blooper reel.  ",
        "While Liam Neeson did the majority of his own stunts, he did have three stunt doubles on hand to do everything else. Andrew Lawden doubled for Neeson for part of the Darth Maul duel on Tatooine, while Joss Gower played Qui-Gon for some shots in the main duel near the end. Rob Inch did everything else.  ",
        "George Lucas cast Natalie Portman, after seeing her in O Profissional (1994) and Brincando de Seduzir (1996).  ",
        "The two scenes recorded digitally were: Qui-Gon taking Anakin's blood sample and the promotion of Obi-Wan to the level of Jedi Knight.  ",
        "The first movie directed by George Lucas since the original Guerra nas Estrelas (1977).  ",
        "After the first lap of the podrace, Watto and Sebulba speak Finnish saying, \"Thank You\" and \"You're Welcome\".  ",
        "Jabba the Hutt's full name is Jabba Desilijic Tiure.  ",
        "Qui-Gon's description of Mos Espa is almost the same, if not verbatim, as Obi-Wan's description of Mos Eisley in Guerra nas Estrelas (1977).  ",
        "In scenes where Padmé and Queen Amidala appear together, Natalie Portman is Padmé, while Keira Knightley is Sabé, one of the handmaidens disguised as the Queen.  ",
        "Colored Q-Tips were photographed on a miniature stadium set in order to provide the background spectators during the pod race sequence.  ",
        "George Lucas has said that there are a couple of shots in the movie that were \"filmed\" on digital video instead of 35 mm film. He also said that he dares anyone to try and figure out which shots these were.  ",
        "Anakin has two model ships on his bed in Tatooine. These are models of early designs considered for the Naboo Starfighters. In the documentaries on the DVD, we see these models being rejected by George Lucas.  ",
        "The dress Amidala is wearing, when she addresses the Senate, is modeled after a Mongolian garment worn by nobility.  ",
        "Of this film's 133 minute running time, only 10 to 15 minutes contain no special effects.  ",
        "Andy Secombe based his vocal performance of Watto on Alec Guinness' performance as Fagin in Oliver Twist (1948). So essentially, Anakin is passed from one Alec Guinness impersonator to another through the course of the film.  ",
        "Two Wookies can be seen in the Galactic Senate meeting. For the first time in 21 years, Star Wars Wookiees were played by someone other than Peter Mayhew.  ",
        "The Jedi Council set was too large to be saved, only the chairs were put in storage. For Star Wars: Episódio II - Ataque dos Clones (2002) and Star Wars: Episódio III - A Vingança dos Sith (2005), backgrounds plates from Star Wars: Episódio I - A Ameaça Fantasma (1999) were reused.  ",
        "WILHELM SCREAM: during the shooting in the hangar, when a guard is shot.  ",
        "The words chanted during the \"Duel of the Fates\" are from Robert Graves' poem \"The White Goddess\". \"The White Goddess\" is a translation of the original version, \"Cad Goddeu\" or \"The Battle of Achren\", an early Celtic work of great antiquity also known as \"The Battle of the Trees,\" which was originally composed by Gwion and is found in the \"Book of Taliesin\", a Thirteenth Century Welsh manuscript . John Williams had the lines \"Under the tongue root a fight most dread, and another raging, behind, in the head\" translated into Sanskrit. The translation sung in the movie is as follows: \"Korah Matah Korah Rahtahmah Korah Rahtamah Yoodhah Korah Korah Syahdho Rahtahmah Daanyah Korah Keelah Daanyah Nyohah Keelah Korah Rahtahmah Syadho Keelah Korah Rahtahmah Korah Daanyah Korah Rahtahmah Korah Daanyah Korah Rahtahmah Nyohah Keelah Korah Rahtahmah Syadho Keelah Korah Rahtahmah Korah Korah Matah Korah Rahtahmah Korah Daanyah Korah Rahtahmah Nyohah Keelah Korah Rahtahmah Syadho Keelah Korah Rahtahmah Korah\".  ",
        "The Battle Droids were originally supposed to be as white as the Stormtroopers from the original trilogy. During pre-production, George Lucas decided to change them to beige.  ",
        "In the German language version of the film, the collaborating Trade Federation leaders have a French accent, while in the Italian language version they have heavy Russian accents. They also have Russian accents in the Czech version, except for the Viceroy, who speaks fluent Czech for reasons unknown.  ",
        "Anthony Daniels expressed dissatisfaction with the final cut of the film.  ",
        "In earlier drafts, the name of the planet where Queen Amidala comes from was called Utapau. This name was also used and abandoned in the early-1970s drafts of Guerra nas Estrelas (1977), and was finally used for the sinkhole planet where Obi-Wan confronts General Grievous in Star Wars: Episódio III - A Vingança dos Sith (2005).  ",
        "Frank Darabont was originally slated to be writing the script at one point, as was Carrie Fisher, who was said to be helping out as a script doctor.  ",
        "The name \"Jar Jar\" was created by George Lucas's son.  ",
        "Before the film's production started, fans campaigned on the Internet to retain Kenny Baker as R2-D2; George Lucas replied that the actor would remain.  ",
        "Queen Amidala's throne-room dress took eight weeks to design.  ",
        "This is the only Star Wars picture, in which Anthony Daniels does not provide the movements of C-3P0. Instead they were performed by puppeteer Michael Lynch.  ",
        "The Galactic Capitol planet of Coruscant was first mentioned in the first Expanded Universe tie-in novel \"Heir To The Empire\" by Timothy Zahn, set five years after O Retorno de Jedi (1983).  ",
        "Early treatments of the film did not have Qui-Gon Jinn, and simply had Obi-Wan by himself, as a Jedi Knight. Qui-Gon was added as Obi-Wan's Master, to flow with the generational \"Passing the Torch\" theme found throughout the whole saga.  ",
        "The parade music at the end of the film is melodically related to the Emperor's Theme from O Retorno de Jedi (1983).  ",
        "The name \"Qui-Gon\" derives from an ancient Chinese system of alternative medicine, called \"Qigong\". The \"Jinn\" part refers to the \"Djinn\" or genies of Arabian myth.  ",
        "Darth Vader's breath can be heard at the end of the credits.  ",
        "The \"water\" cascading over the falls in the Naboo capital city was actually salt.  ",
        "Roman Coppola (Naboo guard) and his sister Sofia Coppola (Handmaiden Saché) made their film debuts in O Poderoso Chefão (1972), on which George Lucas was an Assistant Editor.  ",
        "The lights in Queen Amidala's dramatic red throne-room gown were powered by a car battery that had to be worn under the heavy costume during filming. (Per the \"Rebel, Jedi, Princess, Queen\" exhibit at the EMP Museum in Seattle, Jan-Oct 2015)  ",
        "As of 2016, this is the only film in the franchise, with no storm troopers, nor any mention of a Death Star.  ",
        "George Lucas originally wanted to cast an American actor as Qui-Gon Jinn, but cast Liam Neeson, because he considered that Neeson had great skills and presence. Lucas said Neeson was a \"master actor, who the other actors will look up to, who has got the qualities of strength that the character demands\".  ",
        "Qui-Gon Jinn's name is not given in dialogue until 38 minutes into the film when he introduces himself to Shmi Skywalker (Pernilla August), whose first name is not actually mentioned until Star Wars: Episódio II - Ataque dos Clones (2002).  ",
        "Darth Maul has a total of ten horns on his head.  ",
        "DIRECTOR_TRADEMARK(George Lucas): [1138]: The Droid killed by Jar Jar Binks at the end, has serial number 1138 on his back. (THX 1138 (1971) was Lucas' first film and starred Robert Duvall.)  ",
        "Twelve years after the film was released, Liam Neeson (Qui-Gon Jinn) and Pernilla August (Shmi Skywalker) both reprised their roles in Star Wars: The Clone Wars: Overlords (2011). Neeson would later do so again, in Star Wars: The Clone Wars: Ghosts of Mortis (2011).  ",
        "A puppeteer dressed in a color matching the background (in a manner similar to the Japanese puppet theater Bunraku), manipulated a skeletal C-3PO figure attached to his front, while Anthony Daniels read his lines off-camera. The puppeteer was erased from the film during post-production.  ",
        "Darth Maul has six minutes of screen time.  ",
        "The design of Queen Amidala's starship, in which she escapes Naboo with Qui-Gonn and Obi-Wan, was inspired by the Lockheed Martin SR-71 \"Blackbird\" reconnaissance jet.  ",
        "George Lucas based Chancellor Valorum on Bill Clinton, calling him \"a good man, but he's beleaguered\".  ",
        "Among the props in the background, aboard the ship, as the group leaves Tatooine, are three Hewlett-Packard Inkjet cartridges.  ",
        "In the summer of 1998, the movie Godzilla (1998) was released amongst a whirlwind of media hype as part an ambitious studio campaign called \"Size Does Matter\", featuring massive signs and banners meant to emphasize the size of the monster. After its release, the movie was the subject of an intense backlash by both critics and audiences. The programmers of www.StarWars.com put up a temporary webpage with mocking the \"Godzilla\" campaign with a poster lettered with the green glow reading \"Plot Does Matter - May 1999\", in reference to Star Wars: Episódio I - A Ameaça Fantasma (1999).  ",
        "A re-release of The Phantom Menace in 3-D, was released to theaters in February 2012. In Sweden, it was decided that the movie would also be dubbed into Swedish, despite that no other Star Wars live-action movie had been dubbed into Swedish before. Swedish actress Pernilla August who played Shmi Skywalker, did the voice-over of herself in the dub.  ",
        "Reportedly, after a lightsaber scene, Ewan McGregor could be overheard muttering, \"'Do I want to be in Star Wars?' Fuck yeah!\"  ",
        "The first Star Wars film to be released on DVD (October 2001. Over a year after its release on VHS).  ",
        "Ray Park's voice is dubbed by Peter Serafinowicz.  ",
        "A few days before the scene, on the Royal Starship that introduces R2-D2, was to be shot, George Lucas decided that he wanted to have a 'barrel' domed droid (an R5 unit) added to the group, which was originally made up out of units with a dome similar to R2-D2. Years earlier, Lucasfilm had given away all the original R3, R4 and R5 domes to Disneyland, for their Star Tours (1987) ride, and being on location at Leavesden studios in England, Don Bies only had a single image to work with, as he quickly made an R5 dome over the weekend. Because of the rush job, it turned out looking slightly different from the original prop, but this same dome was repainted, and used, for every other R5 unit seen in all three Star War prequels.  ",
        "This was the final Star Wars film to be shot on 35mm film until Star Wars: O Despertar da Força (2015).  ",
        "Theaters receiving the first trailer and posters were warned, in writing, to return them to the distributor (20th Century Fox) on time, or risk not receiving further media, and possibly the film itself. This was done to attempt to prevent the black-market sale of the incredibly popular trailer.  ",
        "The \"visual theme\" of the planet Naboo is heavily influenced by Italian Renaissance design and architecture. While, on Tatooine, the stadium where the pod race takes place is based upon Roman designs of the early Christian era.  ",
        "George Lucas approached David Hare to write the screenplay and even co-direct the film. Lucas confessed he had reservations about working with the actors, and hoped that he could focus on the action while Hare focused on the acting. Hare declined.  ",
        "To fill all the Senate Pods, teams of extras (mostly Lucasfilm employees) were filmed separately. Some of them were shot on digital video. Enough library footage of Senators was gathered to populate the Senate scenes of both Star Wars: Episódio II - Ataque dos Clones (2002) and Star Wars: Episódio III - A Vingança dos Sith (2005).  ",
        "The crew was considering giving the Neimoidians an alien language with subtitles, translating this into English (similar to other alien species in the franchise), but decided not to, since the Neimoidians carried the \"political element\" of the film, and did not want to detract from this.  ",
        "George Lucas decided to make elaborate costumes because the film's society was more sophisticated than the one depicted in the original trilogy. Designer Trisha Biggar and her team created over 1,000 costumes that were inspired by various cultures. Biggar worked closely with concept designer Iain McCaig to create a color palette for the inhabitants of each world: Tatooine followed Guerra nas Estrelas (1977) with sun-bleached sand colors, Coruscant had grays, browns and blacks, and Naboo had green and gold for humans while Gungans wore \"a leathery look, like their skin\". The Jedi costumes followed the tradition from the original film; Obi-Wan's costume was inspired by the costume that was worn by Alec Guinness. Lucas said he and Biggar would look at the conceptual art to \"translate all of these designs into cloth and fabric and materials that would actually work, and not look silly\". Biggar also consulted Gillard to ensure the costumes would accommodate action scenes, and consulted the creature department to find which fabrics \"wouldn't wear too heavily\" on the alien skins. A huge wardrobe department was set up at Leavesden Film Studios to create over 250 costumes for the main actors and 5,000 for the background ones.  ",
        "As Sofia Coppola prepared the script for her directorial debut on As Virgens Suicidas (1999), she heard that George Lucas would make a new Star Wars film, and asked him if she could accompany him during filming. Lucas offered Coppola a role in the royal entourage, which she accepted because it \"seemed like a good vantage point to watch without getting in the way\".  ",
        "Before Samuel L. Jackson expressed his interest in joining the cast, Mace Windu was to be an animatronic character. This alien, was later identified as an 'Anx' and can be seen sitting in Watto's box during the pod race (as Graxol Kelvyyn) as well as during the Senate scenes (as Senator Horox Ryyder).  ",
        "The Neimodian's commercial culture and heavy robes were based on ancient Chinese merchants.  ",
        "Adrian Dunbar was originally cast as Bail Organa, and made a brief appearance in the Senate sequence. When his performance was cut, the character's name was changed to Bail Antilles (mentioned on screen by Captain Panaka). A picture of Dunbar still appeared in two publications: The Ultimate Star Wars: Episode I Sticker Book (as Senator Bail Organa) and Star Wars: Episode I Who's Who (as Bail Antilles).  ",
        "It appears that the other head of the podrace announcer is simply saying the same thing as the first head, but in Huttesse instead of English. This isn't so. Originally, what the second head said was supposed to be subtitled, and the screenplay of the movie contains a translation of all of his dialogue.  ",
        "Toward the end of the scene where Qui-Gon, Anakin, Anakin's Mother, etc. are eating dinner, Anakin turns his head to the left... these are two shots of actor Jake Lloyd morphed together.  ",
        "The first Star Wars movie to not win an Oscar.  ",
        "Nine R2-D2 models were created; one was for Kenny Baker, into which to be dropped, seven were built by ILM and featured two wheelchair motors capable of moving 440 pounds, enabling it to run, and be mostly used in stage sets, and the British studio produced a pneumatic R2-D2 that could shift from two to three legs, and was mostly used in Tunisia, because its motor-drive system allowed it to drive over sand.  ",
        "George Lucas described Sebulba's design as \"a spider crossed with an orangutan crossed with a sloth\", with a camel-like face, and clothing inspired by medieval armor. Part of the challenge was to create a creature that used its hands as feet, and its feet as hands.  ",
        "A full size EVA Pod from 2001: Uma Odisseia no Espaço (1968) can be seen in Watto's junkyard.  ",
        "The planet \"Tatooine\" was named after the town Tataouine in Tunisia. Shooting the \"Mos Espa\" scenes took place near that town in July 1997.  ",
        "Sebulba's condemnation of Anakin being a slave is hypocritical. According to his backstory, Sebulba was once a slave himself.  ",
        "Although Nute Gunray (Silas Carson) and Shmi Skywalker (Pernilla August) are both major supporting characters in the film, neither character's name is stated in dialogue until Star Wars: Episódio II - Ataque dos Clones (2002).  ",
        "Despite the rumor that Anakin's alien friend is a young Greedo, he is actually known as Wald. There is a deleted scene, however, showing the alien getting into a fight, and being told off: \"Stay out of trouble, Greedo, or you'll come to a bad end\".  ",
        "Two conflicting stories have come out of Lucasfilm, on the origin of the Nemoidians' name. One version says that the the aquatically-evolved aliens were named, as an allusion to the fictional naval character, Captain Nemo. According to other sources, however, the race was named for science fiction icon Leonard Nimoy.  ",
        "The \"buzzing\" sound of Captain Panaka's portable radio is actually a \"ray pistol\" from the 1950s. The same sound effect was used in the original Star Wars trilogy, for the restraining bolts on droids.  ",
        "Editing took two years; Paul Martin Smith started the process in England and focused on dialogue-heavy scenes. Ben Burtt (who was also the film's Sound Editor) was responsible for action sequences under George Lucas' supervision. Non-linear editing systems played a large part in translating Lucas' vision; he constantly tweaked, revised and reworked shots and scenes. The final sound mix was added in March 1999, and the following month the film was completed after the delivery of the remaining visual effects shots.  ",
        "Darth Maul is the only Dark Side apprentice who was not previously a Jedi. Count Dooku was once an apprentice to Yoda, and Master to Qui-Gon Jinn. Darth Vader/Anakin Skywalker is an apprentice to Obi-Wan Kenobi. Kylo Ren was an apprentice to Luke Skywalker.  ",
        "Brian Blessed originally auditioned for the role of Sio Bibble, the Governor of Naboo, for which he was considered \"too loud\". Casting Director Robin Gurland approached him to play Boss Nass, because it was a \"bigger than life\" character, with \"a kind of bravado\".  ",
        "Terence Stamp disliked working on the film. He declined to reprise his role in the sequels, saying that \"Actors prefer to work with actors\".  ",
        "Keira Knightley reported to have \"cried every single day\" due to finding the wardrobe uncomfortable.  ",
        "Hugh Jackman, Tim Roth and Harry Connick, Jr. were considered for the role of Obi-Wan Kenobi.  ",
        "Steven Spielberg visited the stage in London during set building, when he was shooting O Resgate do Soldado Ryan (1998).  ",
        "Contrary to popular belief, the city where Qui-Gon discovers Anakin is not Mos Eisley, but Mos Espa.  ",
        "Peter Serafinowicz criticized George Lucas' poor direction to him when voicing Darth Maul, which just amounted to \"Make him sound evil.\" and he was not happy that only three of his lines are in the movie, and that he only got a meager salary for those lines. On top of that, he was annoyed that he wasn't even invited to the film's premiere and had to pay for his own tickets and travel expenses, and he didn't think the film was very good on top of that.  ",
        "Except for Jake Lloyd inside a hydraulically controlled cockpit, and a few practical podracer models, the entire podracing scene, which the effects crew designed to be as \"out of this world\" as possible, is computer-generated.  ",
        "Nute Gunray's Thai accent was chosen after George Lucas and Rick McCallum listened to various languages to decide how the Neimodians would speak.  ",
        "The beginning and end of this film also parallel the beginning and end of O Retorno de Jedi (1983). Both films begin with a smaller ship asking to board a larger one. Both end with the death of a Sith Lord, and the death of a Jedi, with the Jedi being given a funeral by cremation.  ",
        "Every film in the franchise begins with a shot of a star field moving to a ship. This movie opens with a transport ship headed for a Trade Federation ship.  ",
        "Pernilla August, a veteran of Swedish cinema, was chosen after auditioning with Liam Neeson. She was afraid of being rejected, because of her accent.  ",
        "Ewan McGregor was in his late 20s when he played a twenty year old Obi-Wan Kenobi in this film.  ",
        "Ron Magid commented that \"it's easier to spot the few hundred shots that don't feature any CGI work at all, than the nearly 2,000 shots that do.\"  ",
        "In a scene in the Skywalker home, George Lucas digitally altered Jake Lloyd's eyes to look in a different direction momentarily.  ",
        "Silas Carson was cast as Nute Gunray, because another actor was uncomfortable with the costumes used by the Trade Federation characters, which were hot, exerted a lot of pressure on the bearer, and took about fifteen minutes to apply.  ",
        "The cameras were fitted with data capture models to provide technical data for the CGI artists.  ",
        "During the near-fight between Sebulba and Jar Jar, a background character can be seen with light skin, dreadlocks, and yellow paint over his nose. Expanded Universe writers were inspired by this to create the character Quinlan Vos, who was later mentioned by name in Star Wars: Episódio III - A Vingança dos Sith (2005).  ",
        "Greg Proops' and Scott Capurro's credits are reversed. Proops plays Beed Annodue, the red, English-speaking pod-race announcer, and Capurro plays Fode Annodue, the green, Huttese-speaking announcer.  ",
        "The Naboo Palace setting, was also the ballroom set for the Frankenstein family mansion in Geneva, used in Frankenstein de Mary Shelley (1994). Celia Imrie appears in both movies.  ",
        "One of the very first casting rumors for the \"Star Wars Prequel\", came from a science-fiction magazine called Starblazer. In their Summer 1985 issue, they published that actress Sybil Danning was to possibly portray the \"sexy witch\" that seduces Anakin Skywalker to the Dark Side. In 2012, Danning confirmed on her Facebook page that the rumor was indeed true, and that many discussions took place at that time.  ",
        "In November 2015, Ron Howard confirmed that he, Robert Zemeckis, and Steven Spielberg were approached by George Lucas to direct the film.  ",
        "George Lucas originally wanted Sammo Kam-Bo Hung to be the lightsaber fight choreographer.  ",
        "The Republic Cruiser, seen at the beginning of the film, is based on an early concept design for the Rebel Blockade Runner from Guerra nas Estrelas (1977).  ",
        "Greg Proops and Scott Capurro, the voices of the two-headed podrace commentator, originally recorded their scenes (both in English) in full makeup in front of a greenscreen. It wasn't until the film came out, that they discovered that they had been digitally replaced. This was also when Proops realized that Capurro had separately re-recorded his lines in Huttese.  ",
        "To research for the podrace vehicles, the visual effects crew visited a jet aircraft junkyard outside Phoenix, Arizona and scavenged four Boeing 747 engines. Life-sized replicas of the engines were built and sent to Tunisia, to provide reference in the film.  ",
        "Chroma key was extensively used for digital set extensions, backgrounds, or scenes that required Cinematographer David Tattersall to seek powerful lamps to light the sets, and Visual Effects Supervisor John Knoll to develop software that would remove the blue reflection from shiny floors. Knoll, who remained on set through most of the production, worked closely with Tatterstall to ensure that the shots were suitable to add effects later.  ",
        "John Knoll previewed 3,500 storyboards for the film; George Lucas accompanied him to explain factors of the shots that would be practical and those which would be created through visual effects. Knoll later said that on hearing the explanations of the storyboards, he did not know how to accomplish what he had seen. The result was a mixture of original techniques and the newest digital techniques to make it difficult for the viewer to guess which technique was being used. Knoll and his visual effects team wrote new computer software, including cloth simulators to allow a realistic depiction of the digital characters' clothing, to create certain shots.  ",
        "When young Anakin starts his pod racer for the first time, the ignition buttons on the panel are the same model of the Fiat Uno, an Italian car launched in 1983. One of the car's characteristics is that it featured ergonomic \"pod\" switchgear clusters on each side of the main instrument binnacle.  ",
        "Liam Neeson was 46 when he played Qui-Gon, whose age in the script and canon is 60.  ",
        "The first film to be mixed and encoded in Dolby Digital Surround EX.  ",
        "Sally Hawkins was an extra, while attending drama school. She was on set for one day, as a friend was able to give her access. She was paid 100 quid for playing an extra in the village, and wore a chiffon costume. On set she saw Ewan McGregor while he was playing football, but didn't talk to him. Years later she co-starred with him in O Sonho de Cassandra (2007) but has never told him they had previously \"co-starred\".  ",
        "Several crew members and actors had recurring, or multiple supporting, roles in the film. Among them, Jerome Blake played several alien characters, Mike Savva was a captured Naboo ground crew tech, and also a Naboo Guard, later appearing as the Naboo Guard at the beginning of Star Wars: Episódio II - Ataque dos Clones (2002).  ",
        "The UK DVD version is rated 'PG' instead of 'U' because of the deleted scenes on the supplemental disc. The making-of documentary was edited (ca. 13 sec.) to remove all sexual expletives (a '15' rating was available).  ",
        "Trace Beaulieu read for the role of Jar Jar Binks. He didn't get the role, but the movie would later be lampooned by his former Mystery Science Theater 3000 (1988) costars Michael J. Nelson and Kevin Murphy on RiffTrax.  ",
        "A binder with the film's storyboards, served as a reference for live-action filming, shots that would be filmed in front of a chroma key greenscreen, and shots that would be composed using CGI.  ",
        "The bullfrog in the underwater Gungan City is based on Jabba the Hut, since Jabba eats bullfrogs. He's seen in Star Wars: Episode VI - Return of the Jedi eating a bucket of bullfrogs and opens the pod race in this movie by biting the head off a frog and spitting it onto the gong to start the race. Their skin tones also match the environment in which they live.  ",
        "Russell Crowe, Frankie Muniz, Bruce Greenwood, Greg Kinnear, Jerry Seinfeld, Danny Glover, Ving Rhames, Keith David, Samuel E. Wright, Tony Goldwyn, Gabriel Byrne, William Hurt, BD Wong, Peter Coyote and Jeff Goldblum were considered for the role of Qui-Gon Jinn.  ",
        "Jim Broadbent was considered for the role of Senator Palpatine.  ",
        "The look of the Trade Federation Battle Droids, is partly inspired by African tribal sculpture. The appearance of the Naboo Star Fighters, is loosely based upon a hairpin.  ",
        "Star Wars Insider Magazine Publisher Dan Madsen is seen doing his bit, as an extra, grabbing the reins of a \"Kaadu\" at the celebration scene. He's short and wearing a light green outfit.  ",
        "Obi-Wan was right to \"have a bad feeling about this\", even though Qui-Gon says \"I don't sense anything\".  ",
        "The character design of Watto was an amalgam of rejected ideas; his expressions were based on video footage of Andy Secombe's voice acting, photographs of Animation Supervisor Rob Coleman imitating the character, and Modeller Steve Alpin saying Watto's lines to a mirror.  ",
        "Jabba the Hutt is noticeably different from his previous appearance in O Retorno de Jedi (1983), as he is much younger.  ",
        "Michael Angarano auditioned for the role of young Anakin, and was one of the three finalists along with Jake Lloyd, who won the role.  ",
        "Kelly Macdonald was in the running to play Queen Amidala.  ",
        "Dominic West also had an additional role as a Naboo officer, but that scene was deleted.  ",
        "A huge wardrobe department was set up at Leavesden Film Studios to create over 250 costumes for the main actors and 5,000 for the background ones.  ",
        "One of this film's trailers debuted with Wing Commander - A Batalha Final (1999), which starred Freddie Prinze, Jr., who would later provide the voice of fallen Jedi Kanan on Star Wars Rebels (2014).  ",
        "Recordings of Sound Designer Ben Burtt's baby daughter's cry were used for the sounds of an underwater sea monster on Naboo.  ",
        "George Lucas has the head of a Stormtrooper, and an R2-D2 in his office.  ",
        "The last film in the UK to be given the U rating, but it was later re-rated PG for the DVD. Star Wars: Episódio II - Ataque dos Clones (2002), the following film was given the PG rating and both Star Wars: Episódio III - A Vingança dos Sith (2005) and Star Wars: O Despertar da Força (2015) were given the 12A rating.  ",
        "Since Episode I is both the first of the franchise, and first of the prequel trilogy, the story matches O Retorno de Jedi (1983), since both a saga and Anakin's life have a beginning and end, while the characters reverse in both order of appearance and scenarios, with A New Hope, since they're the start of two trilogies.  ",
        "The only Star Wars movie re-released in 3-D.  ",
        "The pod race is 9 minutes and 30 seconds long.  ",
        "Leonardo DiCaprio, Brendan Fraser, George Clooney, Nicolas Cage, Tom Cruise, Brad Pitt, Matt Damon, Chris O'Donnell, Matthew McConaughey, Will Smith, Owen Wilson, Ashton Kutcher, Craig T. Nelson, Cary Elwes, Jim Carrey, Orlando Bloom, Tobey Maguire, Jerry O'Connell, Michael Imperioli, Steven Van Zandt, Vincent Pastore, Jack Davenport, Gary Oldman, Emilio Estevez, John Cusack, Matthew Broderick, Kevin Costner, Michael J. Fox, Bruce Willis, Johnny Depp, Kevin Spacey, Bill Paxton, Michael Keaton, Johnny Knoxville, Robert Downey Jr., Keanu Reeves, Mel Gibson, James Garner, Pierce Brosnan, Val Kilmer, Tommy Lee Jones, Dennis Quaid, Sam Neill, Hugh Grant, Richard Gere, Arnold Schwarzenegger, Sylvester Stallone, Kiefer Sutherland, Christopher McDonald, Charlie Sheen, Kevin Bacon, William Shatner, Bill Murray, Dan Aykroyd, Chevy Chase, Jim Belushi, Steve Martin, Charles Grodin, Billy Crystal, Albert Brooks, Ray Romano, Kurtwood Smith, Ed O'Neill, Bob Saget, Rupert Everett, Kevin Dunn and Vincent D'Onofrio were considered for the role of Obi-Wan Kenobi.  ",
        "Ewan McGregor's lightsaber prop stick was green instead of blue, because the blue screen would have made it look different if he used a blue lightsaber stick prop, the color for his lightsaber was later added in digitally for the movie itself.  ",
        "Sofia Coppola later directed Natalie Portman in a commercial for Dior clothing. That commercial also featured Alden Ehrenreich, who later played Han Solo.  ",
        "Frank Oz (the voice of Yoda) would direct Terence Stamp in Os Picaretas (1999) released the same year.  ",
        "Anakin appears at 32 minutes into the movie. The movie takes place 32 years before Episode IV.  ",
        "There were rumors that Larisa Oleynik was considered for the role of Padmé before Natalie Portman was officially cast.  ",
        "Jake Lloyd only just turned the same age as a Young Anakin Skywalker when Star Wars: Episódio I - A Ameaça Fantasma (1999) came out in May of 1999.  ",
        "Obi-Wan's character has many parallels to Luke in the original trilogy. Both men see their mentor cut down in front of them, and scream out \"No!\" in protest. Obi-Wan holds the dying Qui-Gon in his arms, just as Luke does his father. Qui-Gon makes Obi-Wan promise to train Anakin, just as Yoda implores Luke to pass on what he has learned. Neither of the two men are successful in that mission: Anakin turns to the Dark Side and becomes Darth Vader, while Luke's apprentice, Ben Solo, turns to the Dark Side and becomes Kylo Ren.  ",
        "After discovering he'd gotten the part of Obi-Wan, Ewan McGregor had his first ever lightsaber duel with Noel Gallagher using prop lightsabers owned by Noel. The duel took place in the back garden of Noel's house in Belsize Park after Ewan had attended an all-night party there the day before.  ",
        "Martin Sheen, Clint Eastwood, Paul Newman, Alec Baldwin, Al Pacino, John Heard, Jeff Bridges, Gene Hackman, Sean Connery, James Earl Jones, Jack Nicholson, Willem Dafoe, David Bowie, John Lithgow, James Woods, Tim Curry, Jeremy Irons, Malcolm McDowell, Dustin Hoffman, Robert De Niro, Ralph Fiennes, Hugo Weaving, Christopher Lloyd, Warren Beatty, Burt Reynolds, Robert Redford, Jon Voight, Jerry Van Dyke, Dean Stockwell, Marlon Brando, Robert Loggia, Richard Attenborough, Kirk Douglas, Mel Brooks, Albert Finney, Richard Griffiths, Michael Caine, David Kelly, Peter O'Toole, George Calin, David Warner, Alan Rickman, Christopher Lee, Ned Beatty, John Malkovich, Christopher Walken, Sean Penn, Bryan Brown, Jack Palance, Paul Hogan, Bruno Kirby, John Mahoney, Walter Cronkite, Nick Nolte, Edward James Olmos, James Caan, Robert Duvall, Jack Warden, Daniel Day-Lewis and Tom Selleck were considered for the role of Sio Bibble.  ",
        "Patrick Stewart, Ian McKellen, Brian Cox, Bill Hunter, Peter Boyle, Charles Durning, Christopher Reeve, Dennis Weaver, James Gandolfini, Robert Pastorelli and Stephen Fry were considered for the role of Boss Nass.  ",
        "The opening sequence has parallels to both Guerra nas Estrelas (1977) and O Retorno de Jedi (1983). Like Jedi, it begins with a small ship approaching a big one, and asking for permission to board. Like A New Hope, the two main characters end up in a firefight. Qui-Gon tries to melt through the door to the bridge, just as the storm troopers cut through a door to board the Tantive IV. One major reversal is that Qui-Gon and Obi-Wan are high-ranking Jedi, while R2-D2 and C-3PO are mere droids.  ",
        "Queen Amidala says to Senator Palpatine that she will \"pray\" he can restore sanity and compassion to the Senate, which is uncharacteristic of a Society that makes contact with \"the Force\", and hopes that it \"will be with you\".  ",
        "The Floaty-headed Jedi sitting in the Jedi Temple Council Chamber would have an inconvenient time of things standing up and walking around.  ",
        "When the kids are crowded around Anakin's pod racer, the girl on the far left has braces.  ",
        "When Padmé, Anakin, Qui-Gon, and Jar Jar are seated at the table, eating at Anakin's house, the mother pours two drinks from the pitcher, for two of the glasses. The third glass, Padmé's glass, is the only one that has anything in it.  ",
        "Warwick Davis: Davis, who played Wicket in O Retorno de Jedi (1983), is sitting next to Watto during the pod race scene. He also plays Anakin's friend Wald, a Rodian child.  ",
        "Sofia Coppola: as handmaiden Saché.  ",
        "Rick McCallum: The producer appears on the right, in a floppy wide-brim hat, when Queen Amidala meets Senator Palpatine.  ",
        "John Knoll: The visual effects supervisor at ILM plays the Naboo pilot who gets killed during the space battle with the Trade Federation. It happens after Ric Olié says, \"The deflector shield is too strong.\"  ",
        "Ben Burtt: The Sound Designer appears to the left of Rick McCallum (with goatee).  ",
        "Darth Maul only blinks once throughout the film. This is mostly because the contact lenses that Ray Park wore made it difficult to blink, and Park liked the idea of a villain who never stops staring. He blinks when he is sliced in half by Obi-Wan Kenobi.  ",
        "The sound effect when Obi-Wan Kenobi's lightsaber is kicked down the reactor shaft towards the end of the movie, is the same sound effect heard when Luke Skywalker throws his lightsaber away in O Retorno de Jedi (1983) when he tells the Emperor that he is a Jedi.  ",
        "According to revised Star Wars canon, Darth Maul did not die when Obi-Wan sliced him in two. While falling down the pit, Maul grabbed at a maintenance hatch and swung into a disposal tube. The impact of landing knocked him out. Later, garbage collection droids dumped him into a trash bin, which was shipped to an offworld refuse dump. Maul existed there for twelve years, a broken half-mad cripple, until he was eventually rescued by his brother, Savage Oppress.  ",
        "This is the only film in the franchise, in which the top-credited actor (Liam Neeson as Qui-Gon Jinn) plays a non-recurring character, and in which, the top-credited character dies (until Star Wars: Episode VII - The Force Awakens). Also, the only film in the prequel trilogy, that does not give Obi-Wan Kenobi (Ewan McGregor) the top credit.  ",
        "The film contains no acting credit for the character of Darth Sidious, although he is played by Ian McDiarmid, who also plays Senator (and then later, Chancellor, and Emperor) Palpatine.  ",
        "The final shot of principal photography was, appropriate enough, Qui-Gon Jinn's death.  ",
        "One of Darth Maul's few lines is \"At last we will reveal ourselves to the Jedi. At last we will have our revenge.\" It is never mentioned in this, or subsequent films, for what they are seeking revenge.  ",
        "Obi-Wan's reaction when Darth Maul finishes off Qui-Gon is the same reaction as Luke, in Guerra nas Estrelas (1977), when Darth Vader kills Obi-Wan.  ",
        "During the battle between Qui-Gon Jinn and Obi-Wan Kenobi against Darth Maul, a total of nine strikes are landed without the use of the lightsaber blade. Darth Maul lands a kick on each Jedi in the main hanger, Darth Maul lands a kick against Obi-Wan, causing him to fall to a lower platform, Qui-Gon lands an elbow and punch combination to knock Darth Maul to a lower platform, Darth Maul uses a kick as a counterattack after Qui-Gon jumps from a lower platform, Darth Maul uses the hilt of his lightsaber before fatally stabbing Qui-Gon, Obi-Wan lands a kick on Darth Maul after breaking his lightsaber in half, Darth Maul lands a kick on Obi-Wan causing him to completely flip over and land on his feet, and Darth Maul uses a force push to knock Obi-Wan into the chasm.  ",
        "The cruiser that loses its hyperdrive and lands for repair on Tatooine is similar to the design of the alien ship that kidnaps a boy in O Vôo do Navegador (1986).  ",
        "The only Star Wars movie where Obi-Wan doesn't wear a beard or is a mentor. Though he does get promoted to Jedi Knight by Yoda after Qui-Gon dies.  ",
        "The fact that Anakin is not always in control of his contribution to blowing up the space console, ending the war, is a reverse of how Luke is always in control, when destroying the Death Star in Episode IV.  ",
        "Qui-Gon's death forces Anakin to deal with two other Jedi: He becomes apprentice to Qui-Gon's former apprentice, Obi-Wan Kenobi. He later fights Qui-Gon's former Master, Count Dooku, loses a hand to him, then defeats him in a rematch. This is a reversal of the original trilogy, in which Obi-Wan's death forces Luke to receive training from his former Master, Yoda, and fight two duels with his former apprentice, Darth Vader.  ",
        "Anakin losing his mother is a reverse of Leia trying to get away from her father (Darth Vader).  ",
        "Although this trilogy culminates with Anakin becoming Darth Vader, the main villain of the trilogy is Palpatine. That makes this trilogy the only one, in which the villain is not related to the Skywalkers. The original trilogy had Darth Vader as the primary villain, while the sequel trilogy is about his grandson, Kylo Ren.  ",
        "The characters appear in reverse order per episode. Episode I reverses Episode IV by having Anakin arrive at 32 minutes at an indoor location compared to Luke arriving at 16 minutes in an outdoor location. Obi-Wan appears late in Episode IV, but early in Episode I. Vice versa for C-3PO. In fact, Anakin creating C-3PO foreshadows not only the fact that he will be a talking robot later in life, but Luke has it in him to be an inventor from his father, but doesn't know how to fix anything. When we first meet Luke, he's fixing a robot that is still broken. Also, his aunt and uncle say after lunch \"He has a lot of his father in him.\" Leia also has some of her father in her. She's held captive in Episode IV as he is in I and senses things before they happen. Leia is trying to escape her father (Darth Vader) without knowing they're related, but Anakin is taken away from his mom. He loses a dream to free the slaves, but Luke gained a dream of being a Jedi, after his aunt and uncle died. R2-D2 brings a spaceship to Tatooine where Anakin appears, but would later show a hologram of Princess Leia to Luke, leading him from Tatooine to a spaceship, to save her. Therefore, he's responsible for the discovery of two slaves. Obi-Wan kills Darth Maul in Episode I, and gets killed by Darth Vader in Episode IV. Qui-Gon needed to die, so it can mirror Obi-Wan's death from Darth Vader.  ",
        "The opening of Episode IV reverses in Episode I. Episode I opens with four characters approaching the spaceship, where a female Astrodroid greets the Jedi's. Soon, an explosion occurs, where white smoke in another room emerges, contrasting the dark interiors of the spaceship, where the Jedi's do battle with robots. Queen Amidala sends a message. In Episode IV, C-3PO is the first character talking, and soon Stormtroopers start blasting characters with guns, leading to an explosion of black smoke, contrasting the white interior of the spaceship, from where Darth Vader emerges. Princess Leia sends a message, and two characters (C-3PO and R2-D2) leave the spaceship.  ",
        "Darth Maul's death mirrors the death of Slag in Fúria Cega (1989).  ",
        "Natalie Portman plays the mother of Carrie Fisher's character. Portman's first film was O Profissional (1994), in which the title character watches Cantando na Chuva (1952), which featured Fisher's real-life mother, Debbie Reynolds. Like Reynolds, Portman at one point sings the title song.  "
    ],
    "cameo": [
        "Warwick Davis: Davis, who played Wicket in O Retorno de Jedi (1983), is sitting next to Watto during the pod race scene. He also plays Anakin's friend Wald, a Rodian child.  ",
        "Sofia Coppola: as handmaiden Saché.  ",
        "Rick McCallum: The producer appears on the right, in a floppy wide-brim hat, when Queen Amidala meets Senator Palpatine.  ",
        "John Knoll: The visual effects supervisor at ILM plays the Naboo pilot who gets killed during the space battle with the Trade Federation. It happens after Ric Olié says, \"The deflector shield is too strong.\"  ",
        "Ben Burtt: The Sound Designer appears to the left of Rick McCallum (with goatee).  "
    ],
    "spoiler": [
        "Darth Maul only blinks once throughout the film. This is mostly because the contact lenses that Ray Park wore made it difficult to blink, and Park liked the idea of a villain who never stops staring. He blinks when he is sliced in half by Obi-Wan Kenobi.  ",
        "The sound effect when Obi-Wan Kenobi's lightsaber is kicked down the reactor shaft towards the end of the movie, is the same sound effect heard when Luke Skywalker throws his lightsaber away in O Retorno de Jedi (1983) when he tells the Emperor that he is a Jedi.  ",
        "According to revised Star Wars canon, Darth Maul did not die when Obi-Wan sliced him in two. While falling down the pit, Maul grabbed at a maintenance hatch and swung into a disposal tube. The impact of landing knocked him out. Later, garbage collection droids dumped him into a trash bin, which was shipped to an offworld refuse dump. Maul existed there for twelve years, a broken half-mad cripple, until he was eventually rescued by his brother, Savage Oppress.  ",
        "This is the only film in the franchise, in which the top-credited actor (Liam Neeson as Qui-Gon Jinn) plays a non-recurring character, and in which, the top-credited character dies (until Star Wars: Episode VII - The Force Awakens). Also, the only film in the prequel trilogy, that does not give Obi-Wan Kenobi (Ewan McGregor) the top credit.  ",
        "The film contains no acting credit for the character of Darth Sidious, although he is played by Ian McDiarmid, who also plays Senator (and then later, Chancellor, and Emperor) Palpatine.  ",
        "The final shot of principal photography was, appropriate enough, Qui-Gon Jinn's death.  ",
        "One of Darth Maul's few lines is \"At last we will reveal ourselves to the Jedi. At last we will have our revenge.\" It is never mentioned in this, or subsequent films, for what they are seeking revenge.  ",
        "Obi-Wan's reaction when Darth Maul finishes off Qui-Gon is the same reaction as Luke, in Guerra nas Estrelas (1977), when Darth Vader kills Obi-Wan.  ",
        "During the battle between Qui-Gon Jinn and Obi-Wan Kenobi against Darth Maul, a total of nine strikes are landed without the use of the lightsaber blade. Darth Maul lands a kick on each Jedi in the main hanger, Darth Maul lands a kick against Obi-Wan, causing him to fall to a lower platform, Qui-Gon lands an elbow and punch combination to knock Darth Maul to a lower platform, Darth Maul uses a kick as a counterattack after Qui-Gon jumps from a lower platform, Darth Maul uses the hilt of his lightsaber before fatally stabbing Qui-Gon, Obi-Wan lands a kick on Darth Maul after breaking his lightsaber in half, Darth Maul lands a kick on Obi-Wan causing him to completely flip over and land on his feet, and Darth Maul uses a force push to knock Obi-Wan into the chasm.  ",
        "The cruiser that loses its hyperdrive and lands for repair on Tatooine is similar to the design of the alien ship that kidnaps a boy in O Vôo do Navegador (1986).  ",
        "The only Star Wars movie where Obi-Wan doesn't wear a beard or is a mentor. Though he does get promoted to Jedi Knight by Yoda after Qui-Gon dies.  ",
        "The fact that Anakin is not always in control of his contribution to blowing up the space console, ending the war, is a reverse of how Luke is always in control, when destroying the Death Star in Episode IV.  ",
        "Qui-Gon's death forces Anakin to deal with two other Jedi: He becomes apprentice to Qui-Gon's former apprentice, Obi-Wan Kenobi. He later fights Qui-Gon's former Master, Count Dooku, loses a hand to him, then defeats him in a rematch. This is a reversal of the original trilogy, in which Obi-Wan's death forces Luke to receive training from his former Master, Yoda, and fight two duels with his former apprentice, Darth Vader.  ",
        "Anakin losing his mother is a reverse of Leia trying to get away from her father (Darth Vader).  ",
        "Although this trilogy culminates with Anakin becoming Darth Vader, the main villain of the trilogy is Palpatine. That makes this trilogy the only one, in which the villain is not related to the Skywalkers. The original trilogy had Darth Vader as the primary villain, while the sequel trilogy is about his grandson, Kylo Ren.  ",
        "The characters appear in reverse order per episode. Episode I reverses Episode IV by having Anakin arrive at 32 minutes at an indoor location compared to Luke arriving at 16 minutes in an outdoor location. Obi-Wan appears late in Episode IV, but early in Episode I. Vice versa for C-3PO. In fact, Anakin creating C-3PO foreshadows not only the fact that he will be a talking robot later in life, but Luke has it in him to be an inventor from his father, but doesn't know how to fix anything. When we first meet Luke, he's fixing a robot that is still broken. Also, his aunt and uncle say after lunch \"He has a lot of his father in him.\" Leia also has some of her father in her. She's held captive in Episode IV as he is in I and senses things before they happen. Leia is trying to escape her father (Darth Vader) without knowing they're related, but Anakin is taken away from his mom. He loses a dream to free the slaves, but Luke gained a dream of being a Jedi, after his aunt and uncle died. R2-D2 brings a spaceship to Tatooine where Anakin appears, but would later show a hologram of Princess Leia to Luke, leading him from Tatooine to a spaceship, to save her. Therefore, he's responsible for the discovery of two slaves. Obi-Wan kills Darth Maul in Episode I, and gets killed by Darth Vader in Episode IV. Qui-Gon needed to die, so it can mirror Obi-Wan's death from Darth Vader.  ",
        "The opening of Episode IV reverses in Episode I. Episode I opens with four characters approaching the spaceship, where a female Astrodroid greets the Jedi's. Soon, an explosion occurs, where white smoke in another room emerges, contrasting the dark interiors of the spaceship, where the Jedi's do battle with robots. Queen Amidala sends a message. In Episode IV, C-3PO is the first character talking, and soon Stormtroopers start blasting characters with guns, leading to an explosion of black smoke, contrasting the white interior of the spaceship, from where Darth Vader emerges. Princess Leia sends a message, and two characters (C-3PO and R2-D2) leave the spaceship.  ",
        "Darth Maul's death mirrors the death of Slag in Fúria Cega (1989).  ",
        "Natalie Portman plays the mother of Carrie Fisher's character. Portman's first film was O Profissional (1994), in which the title character watches Cantando na Chuva (1952), which featured Fisher's real-life mother, Debbie Reynolds. Like Reynolds, Portman at one point sings the title song.  "
    ]
}